*** espanso-clipboard/src/cocoa/mod.rs:106:26: replace > with < in <impl Clipboard for CocoaClipboard>::set_html

*** mutation diff:
--- espanso-clipboard/src/cocoa/mod.rs
+++ replace > with < in <impl Clipboard for CocoaClipboard>::set_html
@@ -98,17 +98,17 @@
         let fallback_string = CString::new(fallback_text.unwrap_or_default())?;
         let fallback_ptr = if fallback_text.is_some() {
             fallback_string.as_ptr()
         } else {
             std::ptr::null()
         };
 
         let native_result = unsafe { ffi::clipboard_set_html(html_string.as_ptr(), fallback_ptr) };
-        if native_result > 0 {
+        if native_result < /* ~ changed by cargo-mutants ~ */ 0 {
             Ok(())
         } else {
             Err(CocoaClipboardError::SetOperationFailed().into())
         }
     }
 }
 
 #[derive(Error, Debug)]

*** result: Success
