*** espanso-clipboard/src/cocoa/mod.rs:44:9: replace <impl Clipboard for CocoaClipboard>::get_text -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- espanso-clipboard/src/cocoa/mod.rs
+++ replace <impl Clipboard for CocoaClipboard>::get_text -> Option<String> with Some("xyzzy".into())
@@ -36,32 +36,17 @@
     pub fn new() -> Result<Self> {
         Ok(Self {})
     }
 }
 
 impl Clipboard for CocoaClipboard {
     fn get_text(&self, _: &ClipboardOperationOptions) -> Option<String> {
         // get the clipbard size
-        let length = unsafe { ffi::clipboard_get_length() };
-        if length <= 0 {
-            return None;
-        }
-
-        // allocate the buffer with extra space for null terminator
-        let mut buffer: Vec<c_char> = vec![0; (length as usize) + 1];
-        let native_result =
-            unsafe { ffi::clipboard_get_text(buffer.as_mut_ptr(), buffer.len() as i32) };
-
-        if native_result > 0 {
-            let string = unsafe { CStr::from_ptr(buffer.as_ptr()) };
-            Some(string.to_string_lossy().to_string())
-        } else {
-            None
-        }
+        Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn set_text(&self, text: &str, _: &ClipboardOperationOptions) -> anyhow::Result<()> {
         let string = CString::new(text)?;
         let native_result = unsafe { ffi::clipboard_set_text(string.as_ptr()) };
         if native_result > 0 {
             Ok(())
         } else {

*** result: Success
