*** espanso-clipboard/src/cocoa/mod.rs:45:19: replace <= with > in <impl Clipboard for CocoaClipboard>::get_text

*** mutation diff:
--- espanso-clipboard/src/cocoa/mod.rs
+++ replace <= with > in <impl Clipboard for CocoaClipboard>::get_text
@@ -37,17 +37,17 @@
         Ok(Self {})
     }
 }
 
 impl Clipboard for CocoaClipboard {
     fn get_text(&self, _: &ClipboardOperationOptions) -> Option<String> {
         // get the clipbard size
         let length = unsafe { ffi::clipboard_get_length() };
-        if length <= 0 {
+        if length > /* ~ changed by cargo-mutants ~ */ 0 {
             return None;
         }
 
         // allocate the buffer with extra space for null terminator
         let mut buffer: Vec<c_char> = vec![0; (length as usize) + 1];
         let native_result =
             unsafe { ffi::clipboard_get_text(buffer.as_mut_ptr(), buffer.len() as i32) };

*** result: Success
