*** espanso-clipboard/src/lib.rs:104:5: replace get_clipboard -> Result<Box<dyn Clipboard>> with Ok(Box::new(Default::default()))

*** mutation diff:
--- espanso-clipboard/src/lib.rs
+++ replace get_clipboard -> Result<Box<dyn Clipboard>> with Ok(Box::new(Default::default()))
@@ -96,13 +96,10 @@
     // could enable the use of a much more efficient implementation relying on the "wl-clipboard-rs" crate.
     // Useful links: https://github.com/YaLTeR/wl-clipboard-rs/issues/8
     //
     // We could even decide the correct implementation at runtime by checking if the
     // required protocol is available, if so use the efficient implementation
     // instead of the fallback one, which calls the wl-copy and wl-paste binaries, and is thus
     // less efficient
 
-    info!("using WaylandFallbackClipboard");
-    Ok(Box::new(wayland::fallback::WaylandFallbackClipboard::new(
-        options,
-    )?))
+    Ok(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
