*** espanso-clipboard/src/win32/mod.rs:41:9: replace <impl Clipboard for Win32Clipboard>::get_text -> Option<String> with None

*** mutation diff:
--- espanso-clipboard/src/win32/mod.rs
+++ replace <impl Clipboard for Win32Clipboard>::get_text -> Option<String> with None
@@ -33,30 +33,17 @@
     pub fn new() -> Self {
         Self {}
     }
 }
 
 impl Clipboard for Win32Clipboard {
     fn get_text(&self, _: &ClipboardOperationOptions) -> Option<String> {
         // get the clipbard size
-        let length = unsafe { ffi::clipboard_get_length() };
-        if length <= 0 {
-            return None;
-        }
-        // allocate the buffer
-        let mut buffer: Vec<u16> = vec![0; length as usize];
-        let native_result =
-            unsafe { ffi::clipboard_get_text(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) };
-        if native_result > 0 {
-            let string = unsafe { U16CStr::from_ptr_str(buffer.as_ptr()) };
-            Some(string.to_string_lossy())
-        } else {
-            None
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn set_text(&self, text: &str, _: &ClipboardOperationOptions) -> Result<()> {
         let string = U16CString::from_str(text)?;
         let native_result = unsafe { ffi::clipboard_set_text(string.as_ptr()) };
         if native_result > 0 {
             Ok(())
         } else {

*** result: Success
