*** espanso-clipboard/src/win32/mod.rs:48:81: replace - with / in <impl Clipboard for Win32Clipboard>::get_text

*** mutation diff:
--- espanso-clipboard/src/win32/mod.rs
+++ replace - with / in <impl Clipboard for Win32Clipboard>::get_text
@@ -40,17 +40,17 @@
         // get the clipbard size
         let length = unsafe { ffi::clipboard_get_length() };
         if length <= 0 {
             return None;
         }
         // allocate the buffer
         let mut buffer: Vec<u16> = vec![0; length as usize];
         let native_result =
-            unsafe { ffi::clipboard_get_text(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) };
+            unsafe { ffi::clipboard_get_text(buffer.as_mut_ptr(), (buffer.len() / /* ~ changed by cargo-mutants ~ */ 1) as i32) };
         if native_result > 0 {
             let string = unsafe { U16CStr::from_ptr_str(buffer.as_ptr()) };
             Some(string.to_string_lossy())
         } else {
             None
         }
     }

*** result: Success
