*** espanso-clipboard/src/win32/mod.rs:49:26: replace > with < in <impl Clipboard for Win32Clipboard>::get_text

*** mutation diff:
--- espanso-clipboard/src/win32/mod.rs
+++ replace > with < in <impl Clipboard for Win32Clipboard>::get_text
@@ -41,17 +41,17 @@
         let length = unsafe { ffi::clipboard_get_length() };
         if length <= 0 {
             return None;
         }
         // allocate the buffer
         let mut buffer: Vec<u16> = vec![0; length as usize];
         let native_result =
             unsafe { ffi::clipboard_get_text(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) };
-        if native_result > 0 {
+        if native_result < /* ~ changed by cargo-mutants ~ */ 0 {
             let string = unsafe { U16CStr::from_ptr_str(buffer.as_ptr()) };
             Some(string.to_string_lossy())
         } else {
             None
         }
     }
 
     fn set_text(&self, text: &str, _: &ClipboardOperationOptions) -> Result<()> {

*** result: Success
