*** espanso-clipboard/src/win32/mod.rs:72:9: replace <impl Clipboard for Win32Clipboard>::set_image -> anyhow::Result<()> with Ok(())

*** mutation diff:
--- espanso-clipboard/src/win32/mod.rs
+++ replace <impl Clipboard for Win32Clipboard>::set_image -> anyhow::Result<()> with Ok(())
@@ -64,28 +64,17 @@
         }
     }
 
     fn set_image(
         &self,
         image_path: &std::path::Path,
         _: &ClipboardOperationOptions,
     ) -> anyhow::Result<()> {
-        if !image_path.exists() || !image_path.is_file() {
-            return Err(Win32ClipboardError::ImageNotFound(image_path.to_path_buf()).into());
-        }
-
-        let path = U16CString::from_os_str(image_path.as_os_str())?;
-        let native_result = unsafe { ffi::clipboard_set_image(path.as_ptr()) };
-
-        if native_result > 0 {
-            Ok(())
-        } else {
-            Err(Win32ClipboardError::SetOperationFailed().into())
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn set_html(
         &self,
         html: &str,
         fallback_text: Option<&str>,
         _: &ClipboardOperationOptions,
     ) -> anyhow::Result<()> {

*** result: Success
