*** espanso-clipboard/src/x11/mod.rs:43:9: replace <impl Clipboard for X11Clipboard>::get_text -> Option<String> with Some(String::new())

*** mutation diff:
--- espanso-clipboard/src/x11/mod.rs
+++ replace <impl Clipboard for X11Clipboard>::get_text -> Option<String> with Some(String::new())
@@ -35,21 +35,17 @@
             native_backend: native::X11NativeClipboard::new()?,
             xclip_backend: xclip::XClipClipboard::new(),
         })
     }
 }
 
 impl Clipboard for X11Clipboard {
     fn get_text(&self, options: &ClipboardOperationOptions) -> Option<String> {
-        if options.use_xclip_backend {
-            self.xclip_backend.get_text(options)
-        } else {
-            self.native_backend.get_text(options)
-        }
+        Some(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn set_text(&self, text: &str, options: &ClipboardOperationOptions) -> anyhow::Result<()> {
         if options.use_xclip_backend {
             self.xclip_backend.set_text(text, options)
         } else {
             self.native_backend.set_text(text, options)
         }

*** result: Success
