*** espanso-clipboard/src/x11/native/mod.rs:43:9: replace <impl Clipboard for X11NativeClipboard>::get_text -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- espanso-clipboard/src/x11/native/mod.rs
+++ replace <impl Clipboard for X11NativeClipboard>::get_text -> Option<String> with Some("xyzzy".into())
@@ -35,25 +35,17 @@
 impl X11NativeClipboard {
     pub fn new() -> Result<Self> {
         Ok(Self {})
     }
 }
 
 impl Clipboard for X11NativeClipboard {
     fn get_text(&self, _: &ClipboardOperationOptions) -> Option<String> {
-        let mut buffer: [c_char; 2048] = [0; 2048];
-        let native_result =
-            unsafe { ffi::clipboard_x11_get_text(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) };
-        if native_result > 0 {
-            let string = unsafe { CStr::from_ptr(buffer.as_ptr()) };
-            Some(string.to_string_lossy().to_string())
-        } else {
-            None
-        }
+        Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn set_text(&self, text: &str, _: &ClipboardOperationOptions) -> anyhow::Result<()> {
         let string = CString::new(text)?;
         let native_result = unsafe { ffi::clipboard_x11_set_text(string.as_ptr()) };
         if native_result > 0 {
             Ok(())
         } else {

*** result: Success
