*** espanso-clipboard/src/x11/native/mod.rs:46:26: replace > with < in <impl Clipboard for X11NativeClipboard>::get_text

*** mutation diff:
--- espanso-clipboard/src/x11/native/mod.rs
+++ replace > with < in <impl Clipboard for X11NativeClipboard>::get_text
@@ -38,17 +38,17 @@
     }
 }
 
 impl Clipboard for X11NativeClipboard {
     fn get_text(&self, _: &ClipboardOperationOptions) -> Option<String> {
         let mut buffer: [c_char; 2048] = [0; 2048];
         let native_result =
             unsafe { ffi::clipboard_x11_get_text(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) };
-        if native_result > 0 {
+        if native_result < /* ~ changed by cargo-mutants ~ */ 0 {
             let string = unsafe { CStr::from_ptr(buffer.as_ptr()) };
             Some(string.to_string_lossy().to_string())
         } else {
             None
         }
     }
 
     fn set_text(&self, text: &str, _: &ClipboardOperationOptions) -> anyhow::Result<()> {

*** result: Success
