*** espanso-clipboard/src/x11/native/mod.rs:57:26: replace > with == in <impl Clipboard for X11NativeClipboard>::set_text

*** mutation diff:
--- espanso-clipboard/src/x11/native/mod.rs
+++ replace > with == in <impl Clipboard for X11NativeClipboard>::set_text
@@ -49,17 +49,17 @@
         } else {
             None
         }
     }
 
     fn set_text(&self, text: &str, _: &ClipboardOperationOptions) -> anyhow::Result<()> {
         let string = CString::new(text)?;
         let native_result = unsafe { ffi::clipboard_x11_set_text(string.as_ptr()) };
-        if native_result > 0 {
+        if native_result == /* ~ changed by cargo-mutants ~ */ 0 {
             Ok(())
         } else {
             Err(X11NativeClipboardError::SetOperationFailed().into())
         }
     }
 
     fn set_image(
         &self,

*** result: Success
