*** espanso-clipboard/src/x11/native/mod.rs:69:9: replace <impl Clipboard for X11NativeClipboard>::set_image -> anyhow::Result<()> with Ok(())

*** mutation diff:
--- espanso-clipboard/src/x11/native/mod.rs
+++ replace <impl Clipboard for X11NativeClipboard>::set_image -> anyhow::Result<()> with Ok(())
@@ -61,33 +61,17 @@
         }
     }
 
     fn set_image(
         &self,
         image_path: &std::path::Path,
         _: &ClipboardOperationOptions,
     ) -> anyhow::Result<()> {
-        if !image_path.exists() || !image_path.is_file() {
-            return Err(X11NativeClipboardError::ImageNotFound(image_path.to_path_buf()).into());
-        }
-
-        // Load the image data
-        let mut file = std::fs::File::open(image_path)?;
-        let mut data = Vec::new();
-        file.read_to_end(&mut data)?;
-
-        let native_result =
-            unsafe { ffi::clipboard_x11_set_image(data.as_ptr(), data.len() as i32) };
-
-        if native_result > 0 {
-            Ok(())
-        } else {
-            Err(X11NativeClipboardError::SetOperationFailed().into())
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn set_html(
         &self,
         html: &str,
         fallback_text: Option<&str>,
         _: &ClipboardOperationOptions,
     ) -> anyhow::Result<()> {

*** result: Success
