*** espanso-clipboard/src/x11/native/mod.rs:81:26: replace > with == in <impl Clipboard for X11NativeClipboard>::set_image

*** mutation diff:
--- espanso-clipboard/src/x11/native/mod.rs
+++ replace > with == in <impl Clipboard for X11NativeClipboard>::set_image
@@ -73,17 +73,17 @@
         // Load the image data
         let mut file = std::fs::File::open(image_path)?;
         let mut data = Vec::new();
         file.read_to_end(&mut data)?;
 
         let native_result =
             unsafe { ffi::clipboard_x11_set_image(data.as_ptr(), data.len() as i32) };
 
-        if native_result > 0 {
+        if native_result == /* ~ changed by cargo-mutants ~ */ 0 {
             Ok(())
         } else {
             Err(X11NativeClipboardError::SetOperationFailed().into())
         }
     }
 
     fn set_html(
         &self,

*** result: Success
