*** espanso-clipboard/src/x11/native/mod.rs:94:9: replace <impl Clipboard for X11NativeClipboard>::set_html -> anyhow::Result<()> with Ok(())

*** mutation diff:
--- espanso-clipboard/src/x11/native/mod.rs
+++ replace <impl Clipboard for X11NativeClipboard>::set_html -> anyhow::Result<()> with Ok(())
@@ -86,31 +86,17 @@
     }
 
     fn set_html(
         &self,
         html: &str,
         fallback_text: Option<&str>,
         _: &ClipboardOperationOptions,
     ) -> anyhow::Result<()> {
-        let html_string = CString::new(html)?;
-        let fallback_string = CString::new(fallback_text.unwrap_or_default())?;
-        let fallback_ptr = if fallback_text.is_some() {
-            fallback_string.as_ptr()
-        } else {
-            std::ptr::null()
-        };
-
-        let native_result =
-            unsafe { ffi::clipboard_x11_set_html(html_string.as_ptr(), fallback_ptr) };
-        if native_result > 0 {
-            Ok(())
-        } else {
-            Err(X11NativeClipboardError::SetOperationFailed().into())
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Error, Debug)]
 pub enum X11NativeClipboardError {
     #[error("clipboard set operation failed")]
     SetOperationFailed(),

*** result: Success
