*** espanso-clipboard/src/x11/xclip/mod.rs:122:9: replace <impl Clipboard for XClipClipboard>::set_html -> anyhow::Result<()> with Ok(())

*** mutation diff:
--- espanso-clipboard/src/x11/xclip/mod.rs
+++ replace <impl Clipboard for XClipClipboard>::set_html -> anyhow::Result<()> with Ok(())
@@ -114,26 +114,11 @@
     }
 
     fn set_html(
         &self,
         html: &str,
         _: Option<&str>,
         _: &ClipboardOperationOptions,
     ) -> anyhow::Result<()> {
-        if !self.is_xclip_available {
-            bail!("attempted to use XClipClipboard, but `xclip` command can't be called");
-        }
-
-        let mut child = Command::new("xclip")
-            .args(["-sel", "clip", "-t", "text/html"])
-            .stdin(Stdio::piped())
-            .spawn()?;
-
-        let stdin = child.stdin.as_mut();
-        if let Some(input) = stdin {
-            input.write_all(html.as_bytes())?;
-            child.wait()?;
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
