*** espanso-clipboard/src/x11/xclip/mod.rs:44:12: delete ! in <impl Clipboard for XClipClipboard>::get_text

*** mutation diff:
--- espanso-clipboard/src/x11/xclip/mod.rs
+++ delete ! in <impl Clipboard for XClipClipboard>::get_text
@@ -36,17 +36,17 @@
             .unwrap_or(false);
 
         Self { is_xclip_available }
     }
 }
 
 impl Clipboard for XClipClipboard {
     fn get_text(&self, _: &ClipboardOperationOptions) -> Option<String> {
-        if !self.is_xclip_available {
+        if  /* ~ changed by cargo-mutants ~ */self.is_xclip_available {
             error!("attempted to use XClipClipboard, but `xclip` command can't be called");
             return None;
         }
 
         match Command::new("xclip").args(["-o", "-sel", "clip"]).output() {
             Ok(output) => {
                 if output.status.success() {
                     let s = String::from_utf8_lossy(&output.stdout);

*** result: Success
