*** espanso-clipboard/src/x11/xclip/mod.rs:44:9: replace <impl Clipboard for XClipClipboard>::get_text -> Option<String> with Some(String::new())

*** mutation diff:
--- espanso-clipboard/src/x11/xclip/mod.rs
+++ replace <impl Clipboard for XClipClipboard>::get_text -> Option<String> with Some(String::new())
@@ -36,34 +36,17 @@
             .unwrap_or(false);
 
         Self { is_xclip_available }
     }
 }
 
 impl Clipboard for XClipClipboard {
     fn get_text(&self, _: &ClipboardOperationOptions) -> Option<String> {
-        if !self.is_xclip_available {
-            error!("attempted to use XClipClipboard, but `xclip` command can't be called");
-            return None;
-        }
-
-        match Command::new("xclip").args(["-o", "-sel", "clip"]).output() {
-            Ok(output) => {
-                if output.status.success() {
-                    let s = String::from_utf8_lossy(&output.stdout);
-                    return Some(s.to_string());
-                }
-            }
-            Err(error) => {
-                error!("xclip reported an error: {}", error);
-            }
-        }
-
-        None
+        Some(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn set_text(&self, text: &str, _: &ClipboardOperationOptions) -> anyhow::Result<()> {
         if !self.is_xclip_available {
             bail!("attempted to use XClipClipboard, but `xclip` command can't be called");
         }
 
         let mut child = Command::new("xclip")

*** result: Success
