*** espanso-clipboard/src/x11/xclip/mod.rs:88:9: replace <impl Clipboard for XClipClipboard>::set_image -> anyhow::Result<()> with Ok(())

*** mutation diff:
--- espanso-clipboard/src/x11/xclip/mod.rs
+++ replace <impl Clipboard for XClipClipboard>::set_image -> anyhow::Result<()> with Ok(())
@@ -80,42 +80,17 @@
         Ok(())
     }
 
     fn set_image(
         &self,
         image_path: &std::path::Path,
         _: &ClipboardOperationOptions,
     ) -> anyhow::Result<()> {
-        if !self.is_xclip_available {
-            bail!("attempted to use XClipClipboard, but `xclip` command can't be called");
-        }
-
-        let extension = image_path.extension();
-        let mime = match extension {
-            Some(ext) => {
-                let ext = ext.to_string_lossy().to_lowercase();
-                match ext.as_ref() {
-                    "png" => "image/png",
-                    "jpg" | "jpeg" => "image/jpeg",
-                    "gif" => "image/gif",
-                    "svg" => "image/svg",
-                    _ => "image/png",
-                }
-            }
-            None => "image/png",
-        };
-
-        let image_path = image_path.to_string_lossy();
-
-        Command::new("xclip")
-            .args(["-selection", "clipboard", "-t", mime, "-i", &image_path])
-            .spawn()?;
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn set_html(
         &self,
         html: &str,
         _: Option<&str>,
         _: &ClipboardOperationOptions,
     ) -> anyhow::Result<()> {

*** result: Success
