*** espanso-clipboard/src/x11/xclip/mod.rs:99:21: delete match arm

*** mutation diff:
--- espanso-clipboard/src/x11/xclip/mod.rs
+++ delete match arm
@@ -91,17 +91,17 @@
 
         let extension = image_path.extension();
         let mime = match extension {
             Some(ext) => {
                 let ext = ext.to_string_lossy().to_lowercase();
                 match ext.as_ref() {
                     "png" => "image/png",
                     "jpg" | "jpeg" => "image/jpeg",
-                    "gif" => "image/gif",
+                     /* ~ changed by cargo-mutants ~ */
                     "svg" => "image/svg",
                     _ => "image/png",
                 }
             }
             None => "image/png",
         };
 
         let image_path = image_path.to_string_lossy();

*** result: Success
