*** espanso-config/src/config/mod.rs:203:9: replace Config::pretty_dump -> String with String::new()

*** mutation diff:
--- espanso-config/src/config/mod.rs
+++ replace Config::pretty_dump -> String with String::new()
@@ -195,92 +195,17 @@
     // could lower this amount to avoid the "lost detection" effect described
     // in this issue: https://github.com/espanso/espanso/issues/745
     fn win32_keyboard_layout_cache_interval(&self) -> i64;
 
     #[allow(clippy::needless_lifetimes)]
     fn is_match<'a>(&self, app: &AppProperties<'a>) -> bool;
 
     fn pretty_dump(&self) -> String {
-        formatdoc! {"
-        [espanso config: {:?}]
-
-        backend: {:?}
-        enable: {:?}
-        paste_shortcut: {:?}
-        inject_delay: {:?}
-        key_delay: {:?}
-        apply_patch: {:?}
-        word_separators: {:?}
-
-        preserve_clipboard: {:?}
-        clipboard_threshold: {:?}
-        disable_x11_fast_inject: {}
-        pre_paste_delay: {}
-        paste_shortcut_event_delay: {}
-        toggle_key: {:?}
-        auto_restart: {:?}
-        restore_clipboard_delay: {:?}
-        post_form_delay: {:?}
-        max_form_width: {:?}
-        max_form_height: {:?}
-        post_search_delay: {:?}
-        backspace_limit: {}
-        search_trigger: {:?}
-        search_shortcut: {:?}
-        keyboard_layout: {:?}
-
-        show_icon: {:?}
-        show_notifications: {:?}
-        secure_input_notification: {:?}
-
-        x11_use_xclip_backend: {:?}
-        x11_use_xdotool_backend: {:?}
-        win32_exclude_orphan_events: {:?}
-        win32_keyboard_layout_cache_interval: {:?}
-
-        match_paths: {:#?}
-      ",
-          self.label(),
-          self.backend(),
-          self.enable(),
-          self.paste_shortcut(),
-          self.inject_delay(),
-          self.key_delay(),
-          self.apply_patch(),
-          self.word_separators(),
-
-          self.preserve_clipboard(),
-          self.clipboard_threshold(),
-          self.disable_x11_fast_inject(),
-          self.pre_paste_delay(),
-          self.paste_shortcut_event_delay(),
-          self.toggle_key(),
-          self.auto_restart(),
-          self.restore_clipboard_delay(),
-          self.post_form_delay(),
-          self.max_form_width(),
-          self.max_form_height(),
-          self.post_search_delay(),
-          self.backspace_limit(),
-          self.search_trigger(),
-          self.search_shortcut(),
-          self.keyboard_layout(),
-
-          self.show_icon(),
-          self.show_notifications(),
-          self.secure_input_notification(),
-
-          self.x11_use_xclip_backend(),
-          self.x11_use_xdotool_backend(),
-          self.win32_exclude_orphan_events(),
-          self.win32_keyboard_layout_cache_interval(),
-
-          self.match_paths(),
-        }
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub trait ConfigStore: Send {
     fn default(&self) -> Arc<dyn Config>;
     fn active(&self, app: &AppProperties) -> Arc<dyn Config>;
     fn configs(&self) -> Vec<Arc<dyn Config>>;

*** result: Success
