*** espanso-config/src/config/parse/mod.rs:81:9: replace ParsedConfig::load -> Result<Self> with Ok(Default::default())

*** mutation diff:
--- espanso-config/src/config/parse/mod.rs
+++ replace ParsedConfig::load -> Result<Self> with Ok(Default::default())
@@ -73,21 +73,17 @@
     pub filter_title: Option<String>,
     pub filter_class: Option<String>,
     pub filter_exec: Option<String>,
     pub filter_os: Option<String>,
 }
 
 impl ParsedConfig {
     pub fn load(path: &Path) -> Result<Self> {
-        let content = std::fs::read_to_string(path)?;
-        match yaml::YAMLConfig::parse_from_str(&content) {
-            Ok(config) => Ok(config.try_into()?),
-            Err(err) => Err(ParsedConfigError::LoadFailed(err).into()),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Error, Debug)]
 pub enum ParsedConfigError {
     #[error("can't load config `{0}`")]
     LoadFailed(#[from] anyhow::Error),
 }

---- config::resolve::tests::is_match_filter_os stdout ----

thread 'config::resolve::tests::is_match_filter_os' panicked at espanso-config/src/config/resolve.rs:954:9:
assertion failed: test_filter_is_match(&format!("filter_os: {current}"),
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

---- config::resolve::tests::is_match_filter_exec stdout ----

thread 'config::resolve::tests::is_match_filter_exec' panicked at espanso-config/src/config/resolve.rs:914:9:
assertion failed: test_filter_is_match("filter_exec: chrome.exe",
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

---- config::resolve::tests::is_match_filter_title stdout ----

thread 'config::resolve::tests::is_match_filter_title' panicked at espanso-config/src/config/resolve.rs:854:9:
assertion failed: test_filter_is_match("filter_title: Google",
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

failures:
    config::resolve::tests::is_match_filter_class
    config::resolve::tests::is_match_filter_exec
    config::resolve::tests::is_match_filter_os
    config::resolve::tests::is_match_filter_title
    config::resolve::tests::is_match_multiple_filters
    config::resolve::tests::match_paths_generated_correctly_with_child_config
    config::resolve::tests::match_paths_generated_correctly_with_underscore_files
    tests::load_fatal_errors
    tests::load_non_fatal_errors
    tests::load_works_correctly

test result: FAILED. 69 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
