*** espanso-config/src/config/path.rs:34:5: replace calculate_paths -> HashSet<String> with HashSet::from_iter([String::new()])

*** mutation diff:
--- espanso-config/src/config/path.rs
+++ replace calculate_paths -> HashSet<String> with HashSet::from_iter([String::new()])
@@ -26,61 +26,17 @@
 
 static ABSOLUTE_PATH: LazyLock<Regex> =
     LazyLock::new(|| Regex::new(r"(?m)^([a-zA-Z]:\\|/).*$").unwrap());
 
 pub fn calculate_paths<'a>(
     base_dir: &Path,
     glob_patterns: impl Iterator<Item = &'a String>,
 ) -> HashSet<String> {
-    let mut path_set = HashSet::new();
-    for glob_pattern in glob_patterns {
-        // Handle relative and absolute paths appropriately
-        let pattern = if ABSOLUTE_PATH.is_match(glob_pattern) {
-            glob_pattern.clone()
-        } else {
-            format!("{}/{}", base_dir.to_string_lossy(), glob_pattern)
-        };
-
-        let entries = glob(&pattern);
-        match entries {
-            Ok(paths) => {
-                for path in paths {
-                    match path {
-                        Ok(path) => {
-                            // Canonicalize the path
-                            match dunce::canonicalize(&path) {
-                                Ok(canonical_path) => {
-                                    path_set.insert(canonical_path.to_string_lossy().to_string());
-                                }
-                                Err(err) => {
-                                    error!(
-                    "unable to canonicalize path from glob: {:?}, with error: {}",
-                    path, err
-                  );
-                                }
-                            }
-                        }
-                        Err(err) => error!(
-                            "glob error when processing pattern: {}, with error: {}",
-                            glob_pattern, err
-                        ),
-                    }
-                }
-            }
-            Err(err) => {
-                error!(
-                    "unable to calculate glob from pattern: {}, with error: {}",
-                    glob_pattern, err
-                );
-            }
-        }
-    }
-
-    path_set
+    HashSet::from_iter([String::new()]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 pub mod tests {
     use super::*;
     use crate::util::tests::use_test_directory;
     use std::fs::create_dir_all;

---- config::path::tests::calculate_paths_absolute_paths stdout ----

thread 'config::path::tests::calculate_paths_absolute_paths' panicked at espanso-config/src/config/path.rs:135:13:
assertion `left == right` failed
  left: {""}

---- config::path::tests::calculate_paths_relative_paths stdout ----

thread 'config::path::tests::calculate_paths_relative_paths' panicked at espanso-config/src/config/path.rs:75:13:
assertion `left == right` failed
  left: {""}

---- config::path::tests::calculate_paths_relative_with_parent_modifier stdout ----

thread 'config::path::tests::calculate_paths_relative_with_parent_modifier' panicked at espanso-config/src/config/path.rs:99:13:
assertion `left == right` failed
  left: {""}
 right: {"/private/var/folders/6f/_7411vhs4c58v7633qtsvlwc0000gn/T/tempconfig.sWbGj2CoboS8/match/sub/sub.yml"}

failures:
    config::path::tests::calculate_paths_absolute_paths
    config::path::tests::calculate_paths_relative_paths
    config::path::tests::calculate_paths_relative_with_parent_modifier
    config::resolve::tests::match_paths_generated_correctly
    config::resolve::tests::match_paths_generated_correctly_with_child_config
    config::resolve::tests::match_paths_generated_correctly_with_underscore_files
    tests::load_non_fatal_errors
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 70 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
