*** espanso-config/src/config/resolve.rs:124:56: replace && with || in <impl Config for ResolvedConfig>::is_match

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace && with || in <impl Config for ResolvedConfig>::is_match
@@ -116,17 +116,17 @@
             } else {
                 false
             }
         } else {
             true
         };
 
         // All the filters that have been specified must be true to define a match
-        is_os_match && is_exec_match && is_title_match && is_class_match
+        is_os_match && is_exec_match && is_title_match || /* ~ changed by cargo-mutants ~ */ is_class_match
     }
 
     fn backend(&self) -> Backend {
         match self
             .parsed
             .backend
             .as_deref()
             .map(str::to_lowercase)

---- config::resolve::tests::is_match_filter_class stdout ----

thread 'config::resolve::tests::is_match_filter_class' panicked at espanso-config/src/config/resolve.rs:893:9:
assertion failed: !test_filter_is_match("filter_class: Chrome",
        &AppProperties {
                title: Some("Yahoo"),
                class: Some("Another"),
                exec: Some("chrome.exe"),
            })

---- config::resolve::tests::is_match_filter_os stdout ----

thread 'config::resolve::tests::is_match_filter_os' panicked at espanso-config/src/config/resolve.rs:963:9:
assertion failed: !test_filter_is_match(&format!("filter_os: {another}"),
        &AppProperties {
                title: Some("Google Mail"),
                class: Some("Chrome"),
                exec: Some("chrome.exe"),
            })

---- config::resolve::tests::is_match_filter_exec stdout ----

thread 'config::resolve::tests::is_match_filter_exec' panicked at espanso-config/src/config/resolve.rs:923:9:
assertion failed: !test_filter_is_match("filter_exec: chrome.exe",
        &AppProperties {
                title: Some("Yahoo"),
                class: Some("Another"),
                exec: Some("zoom.exe"),
            })

failures:
    config::resolve::tests::is_match_filter_class
    config::resolve::tests::is_match_filter_exec
    config::resolve::tests::is_match_filter_os
    config::resolve::tests::is_match_filter_title
    config::resolve::tests::is_match_multiple_filters

test result: FAILED. 74 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
