*** espanso-config/src/config/resolve.rs:206:9: replace <impl Config for ResolvedConfig>::paste_shortcut_event_delay -> usize with 1

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace <impl Config for ResolvedConfig>::paste_shortcut_event_delay -> usize with 1
@@ -198,19 +198,17 @@
 
     fn restore_clipboard_delay(&self) -> usize {
         self.parsed
             .restore_clipboard_delay
             .unwrap_or(DEFAULT_RESTORE_CLIPBOARD_DELAY)
     }
 
     fn paste_shortcut_event_delay(&self) -> usize {
-        self.parsed
-            .paste_shortcut_event_delay
-            .unwrap_or(DEFAULT_SHORTCUT_EVENT_DELAY)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     fn paste_shortcut(&self) -> Option<String> {
         self.parsed.paste_shortcut.clone()
     }
 
     fn disable_x11_fast_inject(&self) -> bool {
         self.parsed.disable_x11_fast_inject.unwrap_or(false)

*** result: Success
