*** espanso-config/src/config/resolve.rs:220:9: replace <impl Config for ResolvedConfig>::inject_delay -> Option<usize> with None

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace <impl Config for ResolvedConfig>::inject_delay -> Option<usize> with None
@@ -212,17 +212,17 @@
         self.parsed.paste_shortcut.clone()
     }
 
     fn disable_x11_fast_inject(&self) -> bool {
         self.parsed.disable_x11_fast_inject.unwrap_or(false)
     }
 
     fn inject_delay(&self) -> Option<usize> {
-        self.parsed.inject_delay
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn key_delay(&self) -> Option<usize> {
         self.parsed.key_delay
     }
 
     fn word_separators(&self) -> Vec<String> {
         self.parsed.word_separators.clone().unwrap_or_else(|| {

*** result: Success
