*** espanso-config/src/config/resolve.rs:224:9: replace <impl Config for ResolvedConfig>::key_delay -> Option<usize> with Some(1)

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace <impl Config for ResolvedConfig>::key_delay -> Option<usize> with Some(1)
@@ -216,17 +216,17 @@
         self.parsed.disable_x11_fast_inject.unwrap_or(false)
     }
 
     fn inject_delay(&self) -> Option<usize> {
         self.parsed.inject_delay
     }
 
     fn key_delay(&self) -> Option<usize> {
-        self.parsed.key_delay
+        Some(1) /* ~ changed by cargo-mutants ~ */
     }
 
     fn word_separators(&self) -> Vec<String> {
         self.parsed.word_separators.clone().unwrap_or_else(|| {
             vec![
                 " ".to_string(),
                 ",".to_string(),
                 ";".to_string(),

*** result: Success
