*** espanso-config/src/config/resolve.rs:260:9: replace <impl Config for ResolvedConfig>::apply_patch -> bool with true

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace <impl Config for ResolvedConfig>::apply_patch -> bool with true
@@ -252,17 +252,17 @@
         })
     }
 
     fn backspace_limit(&self) -> usize {
         self.parsed.backspace_limit.unwrap_or(5)
     }
 
     fn apply_patch(&self) -> bool {
-        self.parsed.apply_patch.unwrap_or(true)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn keyboard_layout(&self) -> Option<RMLVOConfig> {
         self.parsed
             .keyboard_layout
             .as_ref()
             .map(|layout| RMLVOConfig {
                 rules: layout.get("rules").map(String::from),

*** result: Success
