*** espanso-config/src/config/resolve.rs:277:9: replace <impl Config for ResolvedConfig>::search_trigger -> Option<String> with None

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace <impl Config for ResolvedConfig>::search_trigger -> Option<String> with None
@@ -269,21 +269,17 @@
                 model: layout.get("model").map(String::from),
                 layout: layout.get("layout").map(String::from),
                 variant: layout.get("variant").map(String::from),
                 options: layout.get("options").map(String::from),
             })
     }
 
     fn search_trigger(&self) -> Option<String> {
-        match self.parsed.search_trigger.as_deref() {
-            Some("OFF" | "off") => None,
-            Some(x) => Some(x.to_string()),
-            None => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn search_shortcut(&self) -> Option<String> {
         match self.parsed.search_shortcut.as_deref() {
             Some("OFF" | "off") => None,
             Some(x) => Some(x.to_string()),
             None => Some("ALT+SPACE".to_string()),
         }

*** result: Success
