*** espanso-config/src/config/resolve.rs:321:9: replace <impl Config for ResolvedConfig>::max_form_width -> usize with 1

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace <impl Config for ResolvedConfig>::max_form_width -> usize with 1
@@ -313,17 +313,17 @@
 
     fn post_form_delay(&self) -> usize {
         self.parsed
             .post_form_delay
             .unwrap_or(DEFAULT_POST_FORM_DELAY)
     }
 
     fn max_form_width(&self) -> usize {
-        self.parsed.max_form_width.unwrap_or(700)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     fn max_form_height(&self) -> usize {
         self.parsed.max_form_height.unwrap_or(500)
     }
 
     fn post_search_delay(&self) -> usize {
         self.parsed

*** result: Success
