*** espanso-config/src/config/resolve.rs:349:9: replace <impl Config for ResolvedConfig>::x11_use_xclip_backend -> bool with false

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace <impl Config for ResolvedConfig>::x11_use_xclip_backend -> bool with false
@@ -341,17 +341,17 @@
 
     fn win32_keyboard_layout_cache_interval(&self) -> i64 {
         self.parsed
             .win32_keyboard_layout_cache_interval
             .unwrap_or(2000)
     }
 
     fn x11_use_xclip_backend(&self) -> bool {
-        self.parsed.x11_use_xclip_backend.unwrap_or(false)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn x11_use_xdotool_backend(&self) -> bool {
         self.parsed.x11_use_xdotool_backend.unwrap_or(false)
     }
 }
 
 impl ResolvedConfig {

*** result: Success
