*** espanso-config/src/config/resolve.rs:359:9: replace ResolvedConfig::load -> Result<Self> with Ok(Default::default())

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace ResolvedConfig::load -> Result<Self> with Ok(Default::default())
@@ -351,59 +351,17 @@
 
     fn x11_use_xdotool_backend(&self) -> bool {
         self.parsed.x11_use_xdotool_backend.unwrap_or(false)
     }
 }
 
 impl ResolvedConfig {
     pub fn load(path: &Path, parent: Option<&Self>) -> Result<Self> {
-        let mut config = ParsedConfig::load(path)?;
-
-        // Merge with parent config if present
-        if let Some(parent) = parent {
-            Self::merge_parsed(&mut config, &parent.parsed);
-        }
-
-        // Extract the base directory
-        let base_dir = path
-            .parent()
-            .ok_or_else(ResolveError::ParentResolveFailed)?;
-
-        let match_paths = Self::generate_match_paths(&config, base_dir)
-            .into_iter()
-            .collect();
-
-        let filter_title = if let Some(filter_title) = config.filter_title.as_deref() {
-            Some(Regex::new(filter_title)?)
-        } else {
-            None
-        };
-
-        let filter_class = if let Some(filter_class) = config.filter_class.as_deref() {
-            Some(Regex::new(filter_class)?)
-        } else {
-            None
-        };
-
-        let filter_exec = if let Some(filter_exec) = config.filter_exec.as_deref() {
-            Some(Regex::new(filter_exec)?)
-        } else {
-            None
-        };
-
-        Ok(Self {
-            parsed: config,
-            source_path: Some(path.to_owned()),
-            id: next_id(),
-            match_paths,
-            filter_title,
-            filter_class,
-            filter_exec,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn merge_parsed(child: &mut ParsedConfig, parent: &ParsedConfig) {
         // Override the None fields with the parent's value
         merge!(
             ParsedConfig,
             child,
             parent,

---- config::resolve::tests::is_match_filter_class stdout ----

thread 'config::resolve::tests::is_match_filter_class' panicked at espanso-config/src/config/resolve.rs:842:9:
assertion failed: test_filter_is_match("filter_class: Chrome",
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

---- config::resolve::tests::is_match_filter_os stdout ----

thread 'config::resolve::tests::is_match_filter_os' panicked at espanso-config/src/config/resolve.rs:912:9:
assertion failed: test_filter_is_match(&format!("filter_os: {current}"),
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

---- config::resolve::tests::is_match_multiple_filters stdout ----

thread 'config::resolve::tests::is_match_multiple_filters' panicked at espanso-config/src/config/resolve.rs:933:9:
assertion failed: test_filter_is_match(r#"
      filter_exec: chrome.exe
      filter_title: "Youtube"
      "#,
    &AppProperties {
            title: Some("Youtube - Broadcast Yourself"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

failures:
    config::resolve::tests::is_match_filter_class
    config::resolve::tests::is_match_filter_exec
    config::resolve::tests::is_match_filter_os
    config::resolve::tests::is_match_filter_title
    config::resolve::tests::is_match_multiple_filters
    config::resolve::tests::match_paths_generated_correctly
    config::resolve::tests::match_paths_generated_correctly_with_child_config
    config::resolve::tests::match_paths_generated_correctly_with_underscore_files
    tests::load_fatal_errors
    tests::load_non_fatal_errors
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 67 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
