*** espanso-config/src/config/resolve.rs:458:9: replace ResolvedConfig::aggregate_includes -> HashSet<String> with HashSet::new()

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace ResolvedConfig::aggregate_includes -> HashSet<String> with HashSet::new()
@@ -450,37 +450,17 @@
             filter_title,
             filter_class,
             filter_exec,
             filter_os
         );
     }
 
     fn aggregate_includes(config: &ParsedConfig) -> HashSet<String> {
-        let mut includes = HashSet::new();
-
-        if config.use_standard_includes.is_none() || config.use_standard_includes.unwrap() {
-            for include in STANDARD_INCLUDES {
-                includes.insert((*include).to_string());
-            }
-        }
-
-        if let Some(yaml_includes) = config.includes.as_ref() {
-            for include in yaml_includes {
-                includes.insert(include.to_string());
-            }
-        }
-
-        if let Some(extra_includes) = config.extra_includes.as_ref() {
-            for include in extra_includes {
-                includes.insert(include.to_string());
-            }
-        }
-
-        includes
+        HashSet::new() /* ~ changed by cargo-mutants ~ */
     }
 
     fn aggregate_excludes(config: &ParsedConfig) -> HashSet<String> {
         let mut excludes = HashSet::new();
 
         if let Some(yaml_excludes) = config.excludes.as_ref() {
             for exclude in yaml_excludes {
                 excludes.insert(exclude.to_string());

---- config::resolve::tests::aggregate_includes_empty_config stdout ----

thread 'config::resolve::tests::aggregate_includes_empty_config' panicked at espanso-config/src/config/resolve.rs:508:9:
assertion `left == right` failed
  left: {}
 right: {"../match/**/[!_]*.yml"}

---- config::resolve::tests::aggregate_includes_custom_includes stdout ----

thread 'config::resolve::tests::aggregate_includes_custom_includes' panicked at espanso-config/src/config/resolve.rs:532:9:
assertion `left == right` failed
  left: {}
 right: {"../match/**/[!_]*.yml", "custom/*.yml"}

---- config::resolve::tests::aggregate_includes_includes_and_extra_includes stdout ----

thread 'config::resolve::tests::aggregate_includes_includes_and_extra_includes' panicked at espanso-config/src/config/resolve.rs:566:9:
assertion `left == right` failed
  left: {}
 right: {"custom/*.yml", "../match/**/[!_]*.yml", "sub/*.yml"}

failures:
    config::resolve::tests::aggregate_includes_custom_includes
    config::resolve::tests::aggregate_includes_empty_config
    config::resolve::tests::aggregate_includes_extra_includes
    config::resolve::tests::aggregate_includes_includes_and_extra_includes
    config::resolve::tests::match_paths_generated_correctly
    config::resolve::tests::match_paths_generated_correctly_with_child_config
    config::resolve::tests::match_paths_generated_correctly_with_underscore_files
    tests::load_non_fatal_errors
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 69 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
