*** espanso-config/src/config/resolve.rs:460:51: replace || with && in ResolvedConfig::aggregate_includes

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace || with && in ResolvedConfig::aggregate_includes
@@ -452,17 +452,17 @@
             filter_exec,
             filter_os
         );
     }
 
     fn aggregate_includes(config: &ParsedConfig) -> HashSet<String> {
         let mut includes = HashSet::new();
 
-        if config.use_standard_includes.is_none() || config.use_standard_includes.unwrap() {
+        if config.use_standard_includes.is_none() && /* ~ changed by cargo-mutants ~ */ config.use_standard_includes.unwrap() {
             for include in STANDARD_INCLUDES {
                 includes.insert((*include).to_string());
             }
         }
 
         if let Some(yaml_includes) = config.includes.as_ref() {
             for include in yaml_includes {
                 includes.insert(include.to_string());

---- config::resolve::tests::aggregate_includes_custom_includes stdout ----

thread 'config::resolve::tests::aggregate_includes_custom_includes' panicked at espanso-config/src/config/resolve.rs:460:118:
called `Option::unwrap()` on a `None` value

---- config::resolve::tests::aggregate_includes_empty_config stdout ----

thread 'config::resolve::tests::aggregate_includes_empty_config' panicked at espanso-config/src/config/resolve.rs:460:118:
called `Option::unwrap()` on a `None` value

---- config::resolve::tests::aggregate_includes_extra_includes stdout ----

thread 'config::resolve::tests::aggregate_includes_extra_includes' panicked at espanso-config/src/config/resolve.rs:460:118:
called `Option::unwrap()` on a `None` value

failures:
    config::resolve::tests::aggregate_includes_custom_includes
    config::resolve::tests::aggregate_includes_empty_config
    config::resolve::tests::aggregate_includes_extra_includes
    config::resolve::tests::aggregate_includes_includes_and_extra_includes
    config::resolve::tests::is_match_filter_class
    config::resolve::tests::is_match_filter_exec
    config::resolve::tests::is_match_filter_os
    config::resolve::tests::is_match_filter_title
    config::resolve::tests::is_match_multiple_filters
    config::resolve::tests::is_match_no_filters
    config::resolve::tests::match_paths_generated_correctly
    config::resolve::tests::match_paths_generated_correctly_with_child_config

test result: FAILED. 63 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
