*** espanso-config/src/config/resolve.rs:482:9: replace ResolvedConfig::aggregate_excludes -> HashSet<String> with HashSet::from_iter([String::new()])

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace ResolvedConfig::aggregate_excludes -> HashSet<String> with HashSet::from_iter([String::new()])
@@ -474,31 +474,17 @@
                 includes.insert(include.to_string());
             }
         }
 
         includes
     }
 
     fn aggregate_excludes(config: &ParsedConfig) -> HashSet<String> {
-        let mut excludes = HashSet::new();
-
-        if let Some(yaml_excludes) = config.excludes.as_ref() {
-            for exclude in yaml_excludes {
-                excludes.insert(exclude.to_string());
-            }
-        }
-
-        if let Some(extra_excludes) = config.extra_excludes.as_ref() {
-            for exclude in extra_excludes {
-                excludes.insert(exclude.to_string());
-            }
-        }
-
-        excludes
+        HashSet::from_iter([String::new()]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn generate_match_paths(config: &ParsedConfig, base_dir: &Path) -> HashSet<String> {
         let includes = Self::aggregate_includes(config);
         let excludes = Self::aggregate_excludes(config);
 
         // Extract the paths
         let exclude_paths = calculate_paths(base_dir, excludes.iter());

---- config::resolve::tests::aggregate_excludes_custom_excludes stdout ----

thread 'config::resolve::tests::aggregate_excludes_custom_excludes' panicked at espanso-config/src/config/resolve.rs:613:9:
assertion `left == right` failed
  left: {""}
 right: {"custom/*.yml"}

---- config::resolve::tests::aggregate_excludes_excludes_and_extra_excludes stdout ----

thread 'config::resolve::tests::aggregate_excludes_excludes_and_extra_excludes' panicked at espanso-config/src/config/resolve.rs:641:9:
assertion `left == right` failed
  left: {""}
 right: {"sub/*.yml", "custom/*.yml"}

---- config::resolve::tests::aggregate_excludes_empty_config stdout ----

thread 'config::resolve::tests::aggregate_excludes_empty_config' panicked at espanso-config/src/config/resolve.rs:591:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    config::resolve::tests::aggregate_excludes_custom_excludes
    config::resolve::tests::aggregate_excludes_empty_config
    config::resolve::tests::aggregate_excludes_excludes_and_extra_excludes
    config::resolve::tests::aggregate_excludes_extra_excludes
    config::resolve::tests::aggregate_excludes_no_standard
    config::resolve::tests::match_paths_generated_correctly_with_child_config

test result: FAILED. 73 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
