*** espanso-config/src/config/resolve.rs:500:9: replace ResolvedConfig::generate_match_paths -> HashSet<String> with HashSet::new()

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace ResolvedConfig::generate_match_paths -> HashSet<String> with HashSet::new()
@@ -492,27 +492,17 @@
                 excludes.insert(exclude.to_string());
             }
         }
 
         excludes
     }
 
     fn generate_match_paths(config: &ParsedConfig, base_dir: &Path) -> HashSet<String> {
-        let includes = Self::aggregate_includes(config);
-        let excludes = Self::aggregate_excludes(config);
-
-        // Extract the paths
-        let exclude_paths = calculate_paths(base_dir, excludes.iter());
-        let include_paths = calculate_paths(base_dir, includes.iter());
-
-        include_paths
-            .difference(&exclude_paths)
-            .cloned()
-            .collect::<HashSet<_>>()
+        HashSet::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Error, Debug)]
 pub enum ResolveError {
     #[error("unable to resolve parent path")]
     ParentResolveFailed(),
 }

---- config::resolve::tests::match_paths_generated_correctly stdout ----

thread 'config::resolve::tests::match_paths_generated_correctly' panicked at espanso-config/src/config/resolve.rs:719:13:
assertion `left == right` failed
  left: []

---- config::resolve::tests::match_paths_generated_correctly_with_underscore_files stdout ----

thread 'config::resolve::tests::match_paths_generated_correctly_with_underscore_files' panicked at espanso-config/src/config/resolve.rs:812:13:
assertion `left == right` failed
  left: []

---- config::resolve::tests::match_paths_generated_correctly_with_child_config stdout ----

thread 'config::resolve::tests::match_paths_generated_correctly_with_child_config' panicked at espanso-config/src/config/resolve.rs:773:13:
assertion `left == right` failed
  left: []
 right: ["/private/var/folders/6f/_7411vhs4c58v7633qtsvlwc0000gn/T/tempconfig.8hRNZXI6USu6/match/sub/_sub.yml", "/private/var/folders/6f/_7411vhs4c58v7633qtsvlwc0000gn/T/tempconfig.8hRNZXI6USu6/match/sub/another.yml"]

failures:
    config::resolve::tests::match_paths_generated_correctly
    config::resolve::tests::match_paths_generated_correctly_with_child_config
    config::resolve::tests::match_paths_generated_correctly_with_underscore_files
    tests::load_non_fatal_errors
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 73 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
