*** espanso-config/src/config/resolve.rs:75:9: replace <impl Config for ResolvedConfig>::match_paths -> &[String] with Vec::leak(Vec::new())

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace <impl Config for ResolvedConfig>::match_paths -> &[String] with Vec::leak(Vec::new())
@@ -67,17 +67,17 @@
                 return source_path;
             }
         }
 
         "none"
     }
 
     fn match_paths(&self) -> &[String] {
-        &self.match_paths
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_match(&self, app: &AppProperties) -> bool {
         if self.parsed.filter_os.is_none()
             && self.parsed.filter_title.is_none()
             && self.parsed.filter_exec.is_none()
             && self.parsed.filter_class.is_none()
         {

---- config::resolve::tests::match_paths_generated_correctly stdout ----

thread 'config::resolve::tests::match_paths_generated_correctly' panicked at espanso-config/src/config/resolve.rs:729:13:
assertion `left == right` failed
  left: []

---- config::resolve::tests::match_paths_generated_correctly_with_child_config stdout ----

thread 'config::resolve::tests::match_paths_generated_correctly_with_child_config' panicked at espanso-config/src/config/resolve.rs:783:13:
assertion `left == right` failed
  left: []
 right: ["/private/var/folders/6f/_7411vhs4c58v7633qtsvlwc0000gn/T/tempconfig.j7nwidwGYMmN/match/sub/_sub.yml", "/private/var/folders/6f/_7411vhs4c58v7633qtsvlwc0000gn/T/tempconfig.j7nwidwGYMmN/match/sub/another.yml"]

---- config::resolve::tests::match_paths_generated_correctly_with_underscore_files stdout ----

thread 'config::resolve::tests::match_paths_generated_correctly_with_underscore_files' panicked at espanso-config/src/config/resolve.rs:822:13:
assertion `left == right` failed
  left: []

failures:
    config::resolve::tests::match_paths_generated_correctly
    config::resolve::tests::match_paths_generated_correctly_with_child_config
    config::resolve::tests::match_paths_generated_correctly_with_underscore_files
    tests::load_non_fatal_errors
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 73 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
