*** espanso-config/src/config/resolve.rs:79:9: replace <impl Config for ResolvedConfig>::is_match -> bool with true

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace <impl Config for ResolvedConfig>::is_match -> bool with true
@@ -71,62 +71,17 @@
         "none"
     }
 
     fn match_paths(&self) -> &[String] {
         &self.match_paths
     }
 
     fn is_match(&self, app: &AppProperties) -> bool {
-        if self.parsed.filter_os.is_none()
-            && self.parsed.filter_title.is_none()
-            && self.parsed.filter_exec.is_none()
-            && self.parsed.filter_class.is_none()
-        {
-            return false;
-        }
-
-        let is_os_match = if let Some(filter_os) = self.parsed.filter_os.as_deref() {
-            os_matches(filter_os)
-        } else {
-            true
-        };
-
-        let is_title_match = if let Some(title_regex) = self.filter_title.as_ref() {
-            if let Some(title) = app.title {
-                title_regex.is_match(title)
-            } else {
-                false
-            }
-        } else {
-            true
-        };
-
-        let is_exec_match = if let Some(exec_regex) = self.filter_exec.as_ref() {
-            if let Some(exec) = app.exec {
-                exec_regex.is_match(exec)
-            } else {
-                false
-            }
-        } else {
-            true
-        };
-
-        let is_class_match = if let Some(class_regex) = self.filter_class.as_ref() {
-            if let Some(class) = app.class {
-                class_regex.is_match(class)
-            } else {
-                false
-            }
-        } else {
-            true
-        };
-
-        // All the filters that have been specified must be true to define a match
-        is_os_match && is_exec_match && is_title_match && is_class_match
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn backend(&self) -> Backend {
         match self
             .parsed
             .backend
             .as_deref()
             .map(str::to_lowercase)

---- config::resolve::tests::is_match_filter_os stdout ----

thread 'config::resolve::tests::is_match_filter_os' panicked at espanso-config/src/config/resolve.rs:918:9:
assertion failed: !test_filter_is_match(&format!("filter_os: {another}"),
        &AppProperties {
                title: Some("Google Mail"),
                class: Some("Chrome"),
                exec: Some("chrome.exe"),
            })

---- config::resolve::tests::is_match_filter_title stdout ----

thread 'config::resolve::tests::is_match_filter_title' panicked at espanso-config/src/config/resolve.rs:818:9:
assertion failed: !test_filter_is_match("filter_title: Google",
        &AppProperties {
                title: Some("Yahoo"),
                class: Some("Chrome"),
                exec: Some("chrome.exe"),
            })

---- config::resolve::tests::is_match_filter_exec stdout ----

thread 'config::resolve::tests::is_match_filter_exec' panicked at espanso-config/src/config/resolve.rs:878:9:
assertion failed: !test_filter_is_match("filter_exec: chrome.exe",
        &AppProperties {
                title: Some("Yahoo"),
                class: Some("Another"),
                exec: Some("zoom.exe"),
            })

failures:
    config::resolve::tests::is_match_filter_class
    config::resolve::tests::is_match_filter_exec
    config::resolve::tests::is_match_filter_os
    config::resolve::tests::is_match_filter_title
    config::resolve::tests::is_match_multiple_filters
    config::resolve::tests::is_match_no_filters

test result: FAILED. 73 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
