*** espanso-config/src/config/resolve.rs:81:13: replace && with || in <impl Config for ResolvedConfig>::is_match

*** mutation diff:
--- espanso-config/src/config/resolve.rs
+++ replace && with || in <impl Config for ResolvedConfig>::is_match
@@ -73,17 +73,17 @@
 
     fn match_paths(&self) -> &[String] {
         &self.match_paths
     }
 
     fn is_match(&self, app: &AppProperties) -> bool {
         if self.parsed.filter_os.is_none()
             && self.parsed.filter_title.is_none()
-            && self.parsed.filter_exec.is_none()
+            || /* ~ changed by cargo-mutants ~ */ self.parsed.filter_exec.is_none()
             && self.parsed.filter_class.is_none()
         {
             return false;
         }
 
         let is_os_match = if let Some(filter_os) = self.parsed.filter_os.as_deref() {
             os_matches(filter_os)
         } else {

---- config::resolve::tests::is_match_filter_os stdout ----

thread 'config::resolve::tests::is_match_filter_os' panicked at espanso-config/src/config/resolve.rs:954:9:
assertion failed: test_filter_is_match(&format!("filter_os: {current}"),
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

---- config::resolve::tests::is_match_filter_exec stdout ----

thread 'config::resolve::tests::is_match_filter_exec' panicked at espanso-config/src/config/resolve.rs:914:9:
assertion failed: test_filter_is_match("filter_exec: chrome.exe",
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

---- config::resolve::tests::is_match_filter_class stdout ----

thread 'config::resolve::tests::is_match_filter_class' panicked at espanso-config/src/config/resolve.rs:884:9:
assertion failed: test_filter_is_match("filter_class: Chrome",
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

failures:
    config::resolve::tests::is_match_filter_class
    config::resolve::tests::is_match_filter_exec
    config::resolve::tests::is_match_filter_os
    config::resolve::tests::is_match_filter_title
    tests::load_works_correctly

test result: FAILED. 74 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
