*** espanso-config/src/config/store.rs:102:40: replace || with && in DefaultConfigStore::load

*** mutation diff:
--- espanso-config/src/config/store.rs
+++ replace || with && in DefaultConfigStore::load
@@ -94,17 +94,17 @@
                 .extension()
                 .unwrap_or_default()
                 .to_string_lossy()
                 .to_lowercase();
 
             // Additional config files are loaded best-effort
             if config_file.is_file()
                 && config_file != default_file
-                && (extension == "yml" || extension == "yaml")
+                && (extension == "yml" && /* ~ changed by cargo-mutants ~ */ extension == "yaml")
             {
                 match ResolvedConfig::load(&config_file, Some(&default)) {
                     Ok(config) => {
                         customs.push(Arc::new(config));
                         debug!("loaded config at path: {:?}", config_file);
                     }
                     Err(err) => {
                         error!(

---- tests::load_non_fatal_errors stdout ----

thread 'tests::load_non_fatal_errors' panicked at espanso-config/src/lib.rs:224:13:
assertion `left == right` failed
  left: 2
 right: 3

---- tests::load_works_correctly stdout ----

thread 'tests::load_works_correctly' panicked at espanso-config/src/lib.rs:131:13:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    tests::load_non_fatal_errors
    tests::load_works_correctly

test result: FAILED. 77 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
