*** espanso-config/src/config/store.rs:49:9: replace <impl ConfigStore for DefaultConfigStore>::configs -> Vec<Arc<dyn Config>> with vec![]

*** mutation diff:
--- espanso-config/src/config/store.rs
+++ replace <impl ConfigStore for DefaultConfigStore>::configs -> Vec<Arc<dyn Config>> with vec![]
@@ -41,23 +41,17 @@
             if custom.is_match(app) {
                 return Arc::clone(custom);
             }
         }
         Arc::clone(&self.default)
     }
 
     fn configs(&self) -> Vec<Arc<dyn Config>> {
-        let mut configs = vec![Arc::clone(&self.default)];
-
-        for custom in &self.customs {
-            configs.push(Arc::clone(custom));
-        }
-
-        configs
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     fn get_all_match_paths(&self) -> HashSet<String> {
         let mut paths = HashSet::new();
 
         paths.extend(self.default().match_paths().iter().cloned());
         for custom in &self.customs {
             paths.extend(custom.match_paths().iter().cloned());

---- tests::load_non_fatal_errors stdout ----

thread 'tests::load_non_fatal_errors' panicked at espanso-config/src/lib.rs:226:13:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    tests::load_non_fatal_errors

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
