*** espanso-config/src/config/store.rs:59:9: replace <impl ConfigStore for DefaultConfigStore>::get_all_match_paths -> HashSet<String> with HashSet::from_iter(["xyzzy".into()])

*** mutation diff:
--- espanso-config/src/config/store.rs
+++ replace <impl ConfigStore for DefaultConfigStore>::get_all_match_paths -> HashSet<String> with HashSet::from_iter(["xyzzy".into()])
@@ -51,24 +51,17 @@
         for custom in &self.customs {
             configs.push(Arc::clone(custom));
         }
 
         configs
     }
 
     fn get_all_match_paths(&self) -> HashSet<String> {
-        let mut paths = HashSet::new();
-
-        paths.extend(self.default().match_paths().iter().cloned());
-        for custom in &self.customs {
-            paths.extend(custom.match_paths().iter().cloned());
-        }
-
-        paths
+        HashSet::from_iter(["xyzzy".into()]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl DefaultConfigStore {
     pub fn load(config_dir: &Path) -> Result<(Self, Vec<NonFatalErrorSet>)> {
         if !config_dir.is_dir() {
             return Err(ConfigStoreError::InvalidConfigDir().into());
         }

---- tests::load_non_fatal_match_errors stdout ----

thread 'tests::load_non_fatal_match_errors' panicked at espanso-config/src/lib.rs:253:13:
assertion `left == right` failed
  left: "xyzzy"
 right: "/private/var/folders/6f/_7411vhs4c58v7633qtsvlwc0000gn/T/tempconfig.LzFfrlIluN1q/match/base.yml"

---- tests::load_non_fatal_errors stdout ----

thread 'tests::load_non_fatal_errors' panicked at espanso-config/src/lib.rs:224:13:
assertion `left == right` failed
  left: 2
 right: 3

---- tests::load_works_correctly stdout ----

thread 'tests::load_works_correctly' panicked at espanso-config/src/lib.rs:129:13:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    tests::load_non_fatal_errors
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 76 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
