*** espanso-config/src/config/store.rs:72:12: delete ! in DefaultConfigStore::load

*** mutation diff:
--- espanso-config/src/config/store.rs
+++ delete ! in DefaultConfigStore::load
@@ -64,17 +64,17 @@
         }
 
         paths
     }
 }
 
 impl DefaultConfigStore {
     pub fn load(config_dir: &Path) -> Result<(Self, Vec<NonFatalErrorSet>)> {
-        if !config_dir.is_dir() {
+        if  /* ~ changed by cargo-mutants ~ */config_dir.is_dir() {
             return Err(ConfigStoreError::InvalidConfigDir().into());
         }
 
         // First get the default.yml file
         let default_file = config_dir.join("default.yml");
         if !default_file.exists() || !default_file.is_file() {
             return Err(ConfigStoreError::MissingDefault().into());
         }

---- tests::load_non_fatal_match_errors stdout ----

thread 'tests::load_non_fatal_match_errors' panicked at espanso-config/src/lib.rs:250:66:
called `Result::unwrap()` on an `Err` value: invalid config directory

---- tests::load_non_fatal_errors stdout ----

thread 'tests::load_non_fatal_errors' panicked at espanso-config/src/lib.rs:222:66:
called `Result::unwrap()` on an `Err` value: invalid config directory

---- tests::load_works_correctly stdout ----

thread 'tests::load_works_correctly' panicked at espanso-config/src/lib.rs:127:66:
called `Result::unwrap()` on an `Err` value: invalid config directory

failures:
    tests::load_non_fatal_errors
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 76 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
