*** espanso-config/src/config/util.rs:42:5: replace os_matches -> bool with false

*** mutation diff:
--- espanso-config/src/config/util.rs
+++ replace os_matches -> bool with false
@@ -34,22 +34,17 @@
           $x: None,
         )*
       };
     }
   };
 }
 
 pub fn os_matches(os: &str) -> bool {
-    match os {
-        "macos" => cfg!(target_os = "macos"),
-        "windows" => cfg!(target_os = "windows"),
-        "linux" => cfg!(target_os = "linux"),
-        _ => false,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     #[cfg(target_os = "linux")]

---- config::resolve::tests::is_match_filter_os stdout ----

thread 'config::resolve::tests::is_match_filter_os' panicked at espanso-config/src/config/resolve.rs:954:9:
assertion failed: test_filter_is_match(&format!("filter_os: {current}"),
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

---- config::util::tests::os_matches_macos stdout ----

thread 'config::util::tests::os_matches_macos' panicked at espanso-config/src/config/util.rs:61:9:
assertion failed: os_matches("macos")

failures:
    config::resolve::tests::is_match_filter_os
    config::util::tests::os_matches_macos

test result: FAILED. 77 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
