*** espanso-config/src/config/util.rs:43:9: delete match arm

*** mutation diff:
--- espanso-config/src/config/util.rs
+++ delete match arm
@@ -35,17 +35,17 @@
         )*
       };
     }
   };
 }
 
 pub fn os_matches(os: &str) -> bool {
     match os {
-        "macos" => cfg!(target_os = "macos"),
+         /* ~ changed by cargo-mutants ~ */
         "windows" => cfg!(target_os = "windows"),
         "linux" => cfg!(target_os = "linux"),
         _ => false,
     }
 }
 
 #[cfg(test)]
 mod tests {

---- config::resolve::tests::is_match_filter_os stdout ----

thread 'config::resolve::tests::is_match_filter_os' panicked at espanso-config/src/config/resolve.rs:954:9:
assertion failed: test_filter_is_match(&format!("filter_os: {current}"),
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

---- config::util::tests::os_matches_macos stdout ----

thread 'config::util::tests::os_matches_macos' panicked at espanso-config/src/config/util.rs:66:9:
assertion failed: os_matches("macos")

failures:
    config::resolve::tests::is_match_filter_os
    config::util::tests::os_matches_macos

test result: FAILED. 77 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
