*** espanso-config/src/counter.rs:33:5: replace next_id -> StructId with Default::default()

*** mutation diff:
--- espanso-config/src/counter.rs
+++ replace next_id -> StructId with Default::default()
@@ -25,10 +25,10 @@
 }
 
 pub type StructId = i32;
 
 /// Some structs need a unique id.
 /// In order to generate it, we use an atomic static variable
 /// that is incremented for each struct.
 pub fn next_id() -> StructId {
-    STRUCT_COUNTER.with(|count| count.fetch_add(1, Ordering::SeqCst))
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }

---- matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap stdout ----

thread 'matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap' panicked at espanso-config/src/matches/store/default.rs:704:13:
assertion `left == right` failed
  left: [Match { id: 0, cause: Trigger(TriggerCause { triggers: ["hello"], left_word: false, right_word: false, propagate_case: false, uppercase_style: Uppercase }), effect: Text(TextEffect { replace: "world3", vars: [], format: Plain, force_mode: None }), label: None, search_terms: [] }]

---- matches::store::default::tests::match_store_query_single_path_with_imports stdout ----

thread 'matches::store::default::tests::match_store_query_single_path_with_imports' panicked at espanso-config/src/matches/store/default.rs:414:13:
assertion `left == right` failed
  left: [Match { id: 0, cause: Trigger(TriggerCause { triggers: ["hello"], left_word: false, right_word: false, propagate_case: false, uppercase_style: Uppercase }), effect: Text(TextEffect { replace: "world3", vars: [], format: Plain, force_mode: None }), label: None, search_terms: [] }]

---- matches::store::default::tests::match_store_query_handles_circular_depencencies stdout ----

thread 'matches::store::default::tests::match_store_query_handles_circular_depencencies' panicked at espanso-config/src/matches/store/default.rs:511:13:
assertion `left == right` failed
  left: [Match { id: 0, cause: Trigger(TriggerCause { triggers: ["hello"], left_word: false, right_word: false, propagate_case: false, uppercase_style: Uppercase }), effect: Text(TextEffect { replace: "world3", vars: [], format: Plain, force_mode: None }), label: None, search_terms: [] }]

failures:
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports
    tests::load_works_correctly

test result: FAILED. 74 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
