*** espanso-config/src/lib.rs:40:8: delete ! in load

*** mutation diff:
--- espanso-config/src/lib.rs
+++ delete ! in load
@@ -32,17 +32,17 @@
 type LoadableConfig = (
     Box<dyn ConfigStore>,
     Box<dyn MatchStore>,
     Vec<error::NonFatalErrorSet>,
 );
 
 pub fn load(base_path: &Path) -> Result<LoadableConfig> {
     let config_dir = base_path.join("config");
-    if !config_dir.exists() || !config_dir.is_dir() {
+    if  /* ~ changed by cargo-mutants ~ */config_dir.exists() || !config_dir.is_dir() {
         return Err(ConfigError::MissingConfigDir().into());
     }
 
     let (config_store, non_fatal_config_errors) = config::load_store(&config_dir)?;
     let root_paths = config_store.get_all_match_paths();
 
     let (match_store, non_fatal_match_errors) =
         matches::store::load(&root_paths.into_iter().collect::<Vec<String>>());

---- tests::load_non_fatal_errors stdout ----

thread 'tests::load_non_fatal_errors' panicked at espanso-config/src/lib.rs:222:66:
called `Result::unwrap()` on an `Err` value: missing config directory

---- tests::load_non_fatal_match_errors stdout ----

thread 'tests::load_non_fatal_match_errors' panicked at espanso-config/src/lib.rs:250:66:
called `Result::unwrap()` on an `Err` value: missing config directory

---- tests::load_works_correctly stdout ----

thread 'tests::load_works_correctly' panicked at espanso-config/src/lib.rs:127:66:
called `Result::unwrap()` on an `Err` value: missing config directory

failures:
    tests::load_non_fatal_errors
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 76 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
