*** espanso-config/src/matches/group/loader/mod.rs:41:5: replace load_match_group -> Result<(MatchGroup, Option<NonFatalErrorSet>)> with Ok((Default::default(), None))

*** mutation diff:
--- espanso-config/src/matches/group/loader/mod.rs
+++ replace load_match_group -> Result<(MatchGroup, Option<NonFatalErrorSet>)> with Ok((Default::default(), None))
@@ -33,33 +33,17 @@
     fn is_supported(&self, extension: &str) -> bool;
     fn load_group(&self, path: &Path) -> Result<(MatchGroup, Option<NonFatalErrorSet>)>;
 }
 
 static IMPORTERS: LazyLock<Vec<Box<dyn Importer + Sync + Send>>> =
     LazyLock::new(|| vec![Box::new(YAMLImporter::new())]);
 
 pub(crate) fn load_match_group(path: &Path) -> Result<(MatchGroup, Option<NonFatalErrorSet>)> {
-    if let Some(extension) = path.extension() {
-        let extension = extension.to_string_lossy().to_lowercase();
-
-        let importer = IMPORTERS
-            .iter()
-            .find(|importer| importer.is_supported(&extension));
-
-        match importer {
-            Some(importer) => match importer.load_group(path) {
-                Ok((group, non_fatal_error_set)) => Ok((group, non_fatal_error_set)),
-                Err(err) => Err(LoadError::ParsingError(err).into()),
-            },
-            None => Err(LoadError::InvalidFormat.into()),
-        }
-    } else {
-        Err(LoadError::MissingExtension.into())
-    }
+    Ok((Default::default(), None)) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Error, Debug)]
 pub enum LoadError {
     #[error("missing extension in match group file")]
     MissingExtension,
 
     #[error("invalid match group format")]

---- matches::group::loader::tests::load_group_missing_extension stdout ----

thread 'matches::group::loader::tests::load_group_missing_extension' panicked at espanso-config/src/matches/group/loader/mod.rs:85:22:
called `Result::unwrap_err()` on an `Ok` value: (MatchGroup { imports: [], global_vars: [], matches: [] }, None)

---- matches::group::loader::tests::load_group_parsing_error stdout ----

thread 'matches::group::loader::tests::load_group_parsing_error' panicked at espanso-config/src/matches/group/loader/mod.rs:101:22:
called `Result::unwrap_err()` on an `Ok` value: (MatchGroup { imports: [], global_vars: [], matches: [] }, None)

---- matches::group::loader::tests::load_group_invalid_format stdout ----

thread 'matches::group::loader::tests::load_group_invalid_format' panicked at espanso-config/src/matches/group/loader/mod.rs:69:22:
called `Result::unwrap_err()` on an `Ok` value: (MatchGroup { imports: [], global_vars: [], matches: [] }, None)

failures:
    matches::group::loader::tests::load_group_invalid_format
    matches::group::loader::tests::load_group_missing_extension
    matches::group::loader::tests::load_group_parsing_error
    matches::group::loader::tests::load_group_yaml_format
    matches::group::loader::tests::load_group_yaml_format_2
    matches::group::loader::tests::load_group_yaml_format_casing
    matches::store::default::tests::match_store_handles_circular_dependency
    matches::store::default::tests::match_store_loads_correctly
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports

test result: FAILED. 64 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
