*** espanso-config/src/matches/group/loader/yaml/mod.rs:131:45: replace && with || in try_convert_into_match

*** mutation diff:
--- espanso-config/src/matches/group/loader/yaml/mod.rs
+++ replace && with || in try_convert_into_match
@@ -123,17 +123,17 @@
 }
 
 pub fn try_convert_into_match(
     yaml_match: YAMLMatch,
     use_compatibility_mode: bool, // TODO: unused variable. Remove from the codebase
 ) -> Result<(Match, Vec<Warning>)> {
     let mut warnings = Vec::new();
 
-    if yaml_match.uppercase_style.is_some() && yaml_match.propagate_case.is_none() {
+    if yaml_match.uppercase_style.is_some() || /* ~ changed by cargo-mutants ~ */ yaml_match.propagate_case.is_none() {
         warnings.push(anyhow!(
             "specifying the 'uppercase_style' option without 'propagate_case' has no effect"
         ));
     }
 
     let triggers = if let Some(trigger) = yaml_match.trigger {
         Some(vec![trigger])
     } else {

---- matches::group::loader::yaml::tests::basic_match_maps_correctly stdout ----

thread 'matches::group::loader::yaml::tests::basic_match_maps_correctly' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:352:9:
warnings were detected but not handled: [specifying the 'uppercase_style' option without 'propagate_case' has no effect]

---- matches::group::loader::yaml::tests::left_word_maps_correctly stdout ----

thread 'matches::group::loader::yaml::tests::left_word_maps_correctly' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:352:9:
warnings were detected but not handled: [specifying the 'uppercase_style' option without 'propagate_case' has no effect]

---- matches::group::loader::yaml::tests::multiple_triggers_maps_correctly stdout ----

thread 'matches::group::loader::yaml::tests::multiple_triggers_maps_correctly' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:352:9:
warnings were detected but not handled: [specifying the 'uppercase_style' option without 'propagate_case' has no effect]

failures:
    matches::group::loader::yaml::tests::basic_match_maps_correctly
    matches::group::loader::yaml::tests::form_maps_correctly
    matches::group::loader::yaml::tests::form_maps_correctly_with_variable_injection
    matches::group::loader::yaml::tests::importer_works_correctly
    matches::group::loader::yaml::tests::left_word_maps_correctly
    matches::group::loader::yaml::tests::multiple_triggers_maps_correctly
    matches::group::loader::yaml::tests::right_word_maps_correctly
    matches::group::loader::yaml::tests::uppercase_style_maps_correctly
    matches::group::loader::yaml::tests::vars_inject_vars_and_depends_on
    matches::group::loader::yaml::tests::vars_maps_correctly
    matches::group::loader::yaml::tests::vars_no_params_maps_correctly
    matches::group::loader::yaml::tests::word_maps_correctly

test result: FAILED. 58 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
