*** espanso-config/src/matches/group/loader/yaml/mod.rs:150:9: delete match arm

*** mutation diff:
--- espanso-config/src/matches/group/loader/yaml/mod.rs
+++ delete match arm
@@ -142,17 +142,17 @@
 
     let uppercase_style = match yaml_match
         .uppercase_style
         .map(|s| s.to_lowercase())
         .as_deref()
     {
         Some("uppercase") => UpperCasingStyle::Uppercase,
         Some("capitalize") => UpperCasingStyle::Capitalize,
-        Some("capitalize_words") => UpperCasingStyle::CapitalizeWords,
+         /* ~ changed by cargo-mutants ~ */
         Some(style) => {
             warnings.push(anyhow!(
                 "unrecognized uppercase_style: {:?}, falling back to the default",
                 style
             ));
             TriggerCause::default().uppercase_style
         }
         _ => TriggerCause::default().uppercase_style,

---- matches::group::loader::yaml::tests::uppercase_style_maps_correctly stdout ----

thread 'matches::group::loader::yaml::tests::uppercase_style_maps_correctly' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:352:9:
warnings were detected but not handled: [unrecognized uppercase_style: "capitalize_words", falling back to the default]

failures:
    matches::group::loader::yaml::tests::uppercase_style_maps_correctly

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
