*** espanso-config/src/matches/group/loader/yaml/mod.rs:151:9: delete match arm

*** mutation diff:
--- espanso-config/src/matches/group/loader/yaml/mod.rs
+++ delete match arm
@@ -143,23 +143,17 @@
     let uppercase_style = match yaml_match
         .uppercase_style
         .map(|s| s.to_lowercase())
         .as_deref()
     {
         Some("uppercase") => UpperCasingStyle::Uppercase,
         Some("capitalize") => UpperCasingStyle::Capitalize,
         Some("capitalize_words") => UpperCasingStyle::CapitalizeWords,
-        Some(style) => {
-            warnings.push(anyhow!(
-                "unrecognized uppercase_style: {:?}, falling back to the default",
-                style
-            ));
-            TriggerCause::default().uppercase_style
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => TriggerCause::default().uppercase_style,
     };
 
     let cause = if let Some(triggers) = triggers {
         MatchCause::Trigger(TriggerCause {
             triggers,
             left_word: yaml_match
                 .left_word

---- matches::group::loader::yaml::tests::uppercase_style_maps_correctly stdout ----

thread 'matches::group::loader::yaml::tests::uppercase_style_maps_correctly' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:590:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    matches::group::loader::yaml::tests::uppercase_style_maps_correctly

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
