*** espanso-config/src/matches/group/loader/yaml/mod.rs:188:13: delete match arm

*** mutation diff:
--- espanso-config/src/matches/group/loader/yaml/mod.rs
+++ delete match arm
@@ -180,17 +180,17 @@
         MatchCause::None
     };
 
     let force_mode = if let Some(true) = yaml_match.force_clipboard {
         Some(TextInjectMode::Clipboard)
     } else if let Some(mode) = yaml_match.force_mode {
         match mode.to_lowercase().as_str() {
             "clipboard" => Some(TextInjectMode::Clipboard),
-            "keys" => Some(TextInjectMode::Keys),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         }
     } else {
         None
     };
 
     let effect = if yaml_match.replace.is_some()
         || yaml_match.markdown.is_some()

*** result: Success
