*** espanso-config/src/matches/group/loader/yaml/mod.rs:196:9: replace || with && in try_convert_into_match

*** mutation diff:
--- espanso-config/src/matches/group/loader/yaml/mod.rs
+++ replace || with && in try_convert_into_match
@@ -188,17 +188,17 @@
             "keys" => Some(TextInjectMode::Keys),
             _ => None,
         }
     } else {
         None
     };
 
     let effect = if yaml_match.replace.is_some()
-        || yaml_match.markdown.is_some()
+        && /* ~ changed by cargo-mutants ~ */ yaml_match.markdown.is_some()
         || yaml_match.html.is_some()
     {
         let (replace, format) = if let Some(plain) = yaml_match.replace {
             (plain, TextFormat::Plain)
         } else if let Some(markdown) = yaml_match.markdown {
             (markdown, TextFormat::Markdown)
         } else if let Some(html) = yaml_match.html {
             (html, TextFormat::Html)

---- matches::group::loader::yaml::tests::basic_match_maps_correctly stdout ----

thread 'matches::group::loader::yaml::tests::basic_match_maps_correctly' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:368:14:
called `Result::unwrap()` on an `Err` value: match triggered by "triggers: [\"Hello\"]" does not produce any effect. Did you forget the 'replace' field?

---- matches::group::loader::tests::load_group_yaml_format stdout ----

thread 'matches::group::loader::tests::load_group_yaml_format' panicked at espanso-config/src/matches/group/loader/mod.rs:139:13:
assertion `left == right` failed
  left: 0
 right: 1

---- matches::group::loader::tests::load_group_yaml_format_2 stdout ----

thread 'matches::group::loader::tests::load_group_yaml_format_2' panicked at espanso-config/src/matches/group/loader/mod.rs:157:13:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    matches::group::loader::tests::load_group_yaml_format
    matches::group::loader::tests::load_group_yaml_format_2
    matches::group::loader::tests::load_group_yaml_format_casing
    matches::group::loader::yaml::tests::basic_match_maps_correctly
    matches::group::loader::yaml::tests::importer_works_correctly
    matches::group::loader::yaml::tests::left_word_maps_correctly
    matches::group::loader::yaml::tests::multiple_triggers_maps_correctly
    matches::group::loader::yaml::tests::propagate_case_maps_correctly
    matches::group::loader::yaml::tests::right_word_maps_correctly
    matches::group::loader::yaml::tests::uppercase_style_maps_correctly
    matches::group::loader::yaml::tests::vars_inject_vars_and_depends_on
    matches::group::loader::yaml::tests::vars_maps_correctly

test result: FAILED. 56 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
