*** espanso-config/src/matches/group/loader/yaml/mod.rs:312:5: replace try_convert_into_variable -> Result<(Variable, Vec<Warning>)> with Ok((Default::default(), vec![]))

*** mutation diff:
--- espanso-config/src/matches/group/loader/yaml/mod.rs
+++ replace try_convert_into_variable -> Result<(Variable, Vec<Warning>)> with Ok((Default::default(), vec![]))
@@ -304,27 +304,17 @@
         warnings,
     ))
 }
 
 pub fn try_convert_into_variable(
     yaml_var: YAMLVariable,
     use_compatibility_mode: bool,
 ) -> Result<(Variable, Vec<Warning>)> {
-    Ok((
-        Variable {
-            name: yaml_var.name,
-            var_type: yaml_var.var_type,
-            params: convert_params(yaml_var.params)?,
-            id: next_id(),
-            inject_vars: !use_compatibility_mode && yaml_var.inject_vars.unwrap_or(true),
-            depends_on: yaml_var.depends_on,
-        },
-        Vec::new(),
-    ))
+    Ok((Default::default(), vec![])) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::{
         matches::{Match, Params, Value},
         util::tests::use_test_directory,

---- matches::group::loader::yaml::tests::vars_inject_vars_and_depends_on stdout ----

thread 'matches::group::loader::yaml::tests::vars_inject_vars_and_depends_on' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:756:9:
assertion `left == right` failed

---- matches::group::loader::yaml::tests::vars_no_params_maps_correctly stdout ----

thread 'matches::group::loader::yaml::tests::vars_no_params_maps_correctly' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:794:9:
assertion `left == right` failed

---- matches::group::loader::yaml::tests::vars_maps_correctly stdout ----

thread 'matches::group::loader::yaml::tests::vars_maps_correctly' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:712:9:
assertion `left == right` failed

failures:
    matches::group::loader::yaml::tests::importer_works_correctly
    matches::group::loader::yaml::tests::vars_inject_vars_and_depends_on
    matches::group::loader::yaml::tests::vars_maps_correctly
    matches::group::loader::yaml::tests::vars_no_params_maps_correctly
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports

test result: FAILED. 71 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
