*** espanso-config/src/matches/group/loader/yaml/mod.rs:318:26: delete ! in try_convert_into_variable

*** mutation diff:
--- espanso-config/src/matches/group/loader/yaml/mod.rs
+++ delete ! in try_convert_into_variable
@@ -310,17 +310,17 @@
     use_compatibility_mode: bool,
 ) -> Result<(Variable, Vec<Warning>)> {
     Ok((
         Variable {
             name: yaml_var.name,
             var_type: yaml_var.var_type,
             params: convert_params(yaml_var.params)?,
             id: next_id(),
-            inject_vars: !use_compatibility_mode && yaml_var.inject_vars.unwrap_or(true),
+            inject_vars:  /* ~ changed by cargo-mutants ~ */use_compatibility_mode && yaml_var.inject_vars.unwrap_or(true),
             depends_on: yaml_var.depends_on,
         },
         Vec::new(),
     ))
 }
 
 #[cfg(test)]
 mod tests {

---- matches::group::loader::yaml::tests::vars_inject_vars_and_depends_on stdout ----

thread 'matches::group::loader::yaml::tests::vars_inject_vars_and_depends_on' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:766:9:
assertion `left == right` failed

---- matches::group::loader::yaml::tests::vars_maps_correctly stdout ----

thread 'matches::group::loader::yaml::tests::vars_maps_correctly' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:722:9:
assertion `left == right` failed

---- matches::group::loader::yaml::tests::vars_no_params_maps_correctly stdout ----

thread 'matches::group::loader::yaml::tests::vars_no_params_maps_correctly' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:804:9:
assertion `left == right` failed

failures:
    matches::group::loader::yaml::tests::importer_works_correctly
    matches::group::loader::yaml::tests::vars_inject_vars_and_depends_on
    matches::group::loader::yaml::tests::vars_maps_correctly
    matches::group::loader::yaml::tests::vars_no_params_maps_correctly
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports

test result: FAILED. 71 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
