*** espanso-config/src/matches/group/loader/yaml/mod.rs:318:50: replace && with || in try_convert_into_variable

*** mutation diff:
--- espanso-config/src/matches/group/loader/yaml/mod.rs
+++ replace && with || in try_convert_into_variable
@@ -310,17 +310,17 @@
     use_compatibility_mode: bool,
 ) -> Result<(Variable, Vec<Warning>)> {
     Ok((
         Variable {
             name: yaml_var.name,
             var_type: yaml_var.var_type,
             params: convert_params(yaml_var.params)?,
             id: next_id(),
-            inject_vars: !use_compatibility_mode && yaml_var.inject_vars.unwrap_or(true),
+            inject_vars: !use_compatibility_mode || /* ~ changed by cargo-mutants ~ */ yaml_var.inject_vars.unwrap_or(true),
             depends_on: yaml_var.depends_on,
         },
         Vec::new(),
     ))
 }
 
 #[cfg(test)]
 mod tests {

---- matches::group::loader::yaml::tests::vars_inject_vars_and_depends_on stdout ----

thread 'matches::group::loader::yaml::tests::vars_inject_vars_and_depends_on' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:766:9:
assertion `left == right` failed

failures:
    matches::group::loader::yaml::tests::vars_inject_vars_and_depends_on

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
