*** espanso-config/src/matches/group/loader/yaml/mod.rs:64:19: replace == with != in <impl Importer for YAMLImporter>::is_supported

*** mutation diff:
--- espanso-config/src/matches/group/loader/yaml/mod.rs
+++ replace == with != in <impl Importer for YAMLImporter>::is_supported
@@ -56,17 +56,17 @@
 impl YAMLImporter {
     pub fn new() -> Self {
         Self {}
     }
 }
 
 impl Importer for YAMLImporter {
     fn is_supported(&self, extension: &str) -> bool {
-        extension == "yaml" || extension == "yml"
+        extension != /* ~ changed by cargo-mutants ~ */ "yaml" || extension == "yml"
     }
 
     fn load_group(
         &self,
         path: &std::path::Path,
     ) -> anyhow::Result<(crate::matches::group::MatchGroup, Option<NonFatalErrorSet>)> {
         let yaml_group =
             YAMLMatchGroup::parse_from_file(path).context("failed to parse YAML match group")?;

---- matches::group::loader::tests::load_group_invalid_format stdout ----

thread 'matches::group::loader::tests::load_group_invalid_format' panicked at espanso-config/src/matches/group/loader/mod.rs:83:13:
assertion failed: matches!(load_match_group(&file).unwrap_err().downcast::<LoadError>().unwrap(),
    LoadError::InvalidFormat)

---- matches::group::loader::tests::load_group_yaml_format_2 stdout ----

thread 'matches::group::loader::tests::load_group_yaml_format_2' panicked at espanso-config/src/matches/group/loader/mod.rs:157:48:
called `Result::unwrap()` on an `Err` value: invalid match group format

---- matches::group::loader::yaml::tests::importer_is_supported stdout ----

thread 'matches::group::loader::yaml::tests::importer_is_supported' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:833:9:
assertion failed: importer.is_supported("yaml")

failures:
    matches::group::loader::tests::load_group_invalid_format
    matches::group::loader::tests::load_group_yaml_format_2
    matches::group::loader::yaml::tests::importer_is_supported

test result: FAILED. 76 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
