*** espanso-config/src/matches/group/loader/yaml/mod.rs:64:42: replace == with != in <impl Importer for YAMLImporter>::is_supported

*** mutation diff:
--- espanso-config/src/matches/group/loader/yaml/mod.rs
+++ replace == with != in <impl Importer for YAMLImporter>::is_supported
@@ -56,17 +56,17 @@
 impl YAMLImporter {
     pub fn new() -> Self {
         Self {}
     }
 }
 
 impl Importer for YAMLImporter {
     fn is_supported(&self, extension: &str) -> bool {
-        extension == "yaml" || extension == "yml"
+        extension == "yaml" || extension != /* ~ changed by cargo-mutants ~ */ "yml"
     }
 
     fn load_group(
         &self,
         path: &std::path::Path,
     ) -> anyhow::Result<(crate::matches::group::MatchGroup, Option<NonFatalErrorSet>)> {
         let yaml_group =
             YAMLMatchGroup::parse_from_file(path).context("failed to parse YAML match group")?;

---- matches::group::loader::tests::load_group_invalid_format stdout ----

thread 'matches::group::loader::tests::load_group_invalid_format' panicked at espanso-config/src/matches/group/loader/mod.rs:83:13:
assertion failed: matches!(load_match_group(&file).unwrap_err().downcast::<LoadError>().unwrap(),
    LoadError::InvalidFormat)

---- matches::group::loader::tests::load_group_yaml_format_casing stdout ----

thread 'matches::group::loader::tests::load_group_yaml_format_casing' panicked at espanso-config/src/matches/group/loader/mod.rs:175:48:
called `Result::unwrap()` on an `Err` value: invalid match group format

---- matches::group::loader::tests::load_group_parsing_error stdout ----

thread 'matches::group::loader::tests::load_group_parsing_error' panicked at espanso-config/src/matches/group/loader/mod.rs:115:13:
assertion failed: matches!(load_match_group(&file).unwrap_err().downcast::<LoadError>().unwrap(),
    LoadError::ParsingError(_))

failures:
    matches::group::loader::tests::load_group_invalid_format
    matches::group::loader::tests::load_group_parsing_error
    matches::group::loader::tests::load_group_yaml_format
    matches::group::loader::tests::load_group_yaml_format_casing
    matches::group::loader::yaml::tests::importer_is_supported
    matches::store::default::tests::match_store_handles_circular_dependency
    matches::store::default::tests::match_store_loads_correctly
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports
    tests::load_non_fatal_errors

test result: FAILED. 65 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
