*** espanso-config/src/matches/group/loader/yaml/mod.rs:71:9: replace <impl Importer for YAMLImporter>::load_group -> anyhow::Result<(crate::matches::group::MatchGroup, Option<NonFatalErrorSet>)> with Ok((Default::default(), None))

*** mutation diff:
--- espanso-config/src/matches/group/loader/yaml/mod.rs
+++ replace <impl Importer for YAMLImporter>::load_group -> anyhow::Result<(crate::matches::group::MatchGroup, Option<NonFatalErrorSet>)> with Ok((Default::default(), None))
@@ -63,67 +63,17 @@
     fn is_supported(&self, extension: &str) -> bool {
         extension == "yaml" || extension == "yml"
     }
 
     fn load_group(
         &self,
         path: &std::path::Path,
     ) -> anyhow::Result<(crate::matches::group::MatchGroup, Option<NonFatalErrorSet>)> {
-        let yaml_group =
-            YAMLMatchGroup::parse_from_file(path).context("failed to parse YAML match group")?;
-
-        let mut non_fatal_errors = Vec::new();
-
-        let mut global_vars = Vec::new();
-        for yaml_global_var in yaml_group.global_vars.clone().unwrap_or_default() {
-            match try_convert_into_variable(yaml_global_var, false) {
-                Ok((var, warnings)) => {
-                    global_vars.push(var);
-                    non_fatal_errors.extend(warnings.into_iter().map(ErrorRecord::warn));
-                }
-                Err(err) => {
-                    non_fatal_errors.push(ErrorRecord::error(err));
-                }
-            }
-        }
-
-        let mut matches = Vec::new();
-        for yaml_match in yaml_group.matches.clone().unwrap_or_default() {
-            match try_convert_into_match(yaml_match, false) {
-                Ok((m, warnings)) => {
-                    matches.push(m);
-                    non_fatal_errors.extend(warnings.into_iter().map(ErrorRecord::warn));
-                }
-                Err(err) => {
-                    non_fatal_errors.push(ErrorRecord::error(err));
-                }
-            }
-        }
-
-        // Resolve imports
-        let (resolved_imports, import_errors) =
-            resolve_imports(path, &yaml_group.imports.unwrap_or_default())
-                .context("failed to resolve YAML match group imports")?;
-        non_fatal_errors.extend(import_errors);
-
-        let non_fatal_error_set = if non_fatal_errors.is_empty() {
-            None
-        } else {
-            Some(NonFatalErrorSet::new(path, non_fatal_errors))
-        };
-
-        Ok((
-            MatchGroup {
-                imports: resolved_imports,
-                global_vars,
-                matches,
-            },
-            non_fatal_error_set,
-        ))
+        Ok((Default::default(), None)) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub fn try_convert_into_match(
     yaml_match: YAMLMatch,
     use_compatibility_mode: bool, // TODO: unused variable. Remove from the codebase
 ) -> Result<(Match, Vec<Warning>)> {
     let mut warnings = Vec::new();

---- matches::group::loader::tests::load_group_parsing_error stdout ----

thread 'matches::group::loader::tests::load_group_parsing_error' panicked at espanso-config/src/matches/group/loader/mod.rs:117:22:
called `Result::unwrap_err()` on an `Ok` value: (MatchGroup { imports: [], global_vars: [], matches: [] }, None)

---- matches::group::loader::tests::load_group_yaml_format_casing stdout ----

thread 'matches::group::loader::tests::load_group_yaml_format_casing' panicked at espanso-config/src/matches/group/loader/mod.rs:175:13:
assertion `left == right` failed
  left: 0
 right: 1

---- matches::group::loader::tests::load_group_yaml_format stdout ----

thread 'matches::group::loader::tests::load_group_yaml_format' panicked at espanso-config/src/matches/group/loader/mod.rs:139:13:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    matches::group::loader::tests::load_group_parsing_error
    matches::group::loader::tests::load_group_yaml_format
    matches::group::loader::tests::load_group_yaml_format_2
    matches::group::loader::tests::load_group_yaml_format_casing
    matches::group::loader::yaml::tests::importer_invalid_syntax
    matches::group::loader::yaml::tests::importer_works_correctly
    matches::store::default::tests::match_store_handles_circular_dependency
    matches::store::default::tests::match_store_loads_correctly
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports

test result: FAILED. 64 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
