*** espanso-config/src/matches/group/loader/yaml/parse.rs:139:5: replace default_params -> Mapping with Default::default()

*** mutation diff:
--- espanso-config/src/matches/group/loader/yaml/parse.rs
+++ replace default_params -> Mapping with Default::default()
@@ -131,10 +131,10 @@
     #[serde(default)]
     pub inject_vars: Option<bool>,
 
     #[serde(default)]
     pub depends_on: Vec<String>,
 }
 
 fn default_params() -> Mapping {
-    Mapping::new()
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
