*** espanso-config/src/matches/group/loader/yaml/util.rs:29:5: replace convert_params -> Result<Params> with Ok(Default::default())

*** mutation diff:
--- espanso-config/src/matches/group/loader/yaml/util.rs
+++ replace convert_params -> Result<Params> with Ok(Default::default())
@@ -21,25 +21,17 @@
 
 use anyhow::Result;
 use serde_yaml::Mapping;
 use thiserror::Error;
 
 use crate::matches::{Number, Params, Value};
 
 pub(crate) fn convert_params(m: Mapping) -> Result<Params> {
-    let mut params = Params::new();
-
-    for (key, value) in m {
-        let key = key.as_str().ok_or(ConversionError::InvalidKeyFormat)?;
-        let value = convert_value(value)?;
-        params.insert(key.to_owned(), value);
-    }
-
-    Ok(params)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn convert_value(value: serde_yaml::Value) -> Result<Value> {
     Ok(match value {
         serde_yaml::Value::Null => Value::Null,
         serde_yaml::Value::Bool(val) => Value::Bool(val),
         serde_yaml::Value::Number(n) => {
             if n.is_i64() {

---- matches::group::loader::yaml::tests::vars_maps_correctly stdout ----

thread 'matches::group::loader::yaml::tests::vars_maps_correctly' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:722:9:
assertion `left == right` failed

---- matches::group::loader::yaml::util::tests::convert_params_invalid_key_type stdout ----

thread 'matches::group::loader::yaml::util::tests::convert_params_invalid_key_type' panicked at espanso-config/src/matches/group/loader/yaml/util.rs:165:9:
assertion failed: convert_params(mapping).is_err()

---- matches::group::loader::yaml::util::tests::convert_params_works_correctly stdout ----

thread 'matches::group::loader::yaml::util::tests::convert_params_works_correctly' panicked at espanso-config/src/matches/group/loader/yaml/util.rs:157:9:
assertion `left == right` failed
  left: {}
 right: {"test": Null}

failures:
    matches::group::loader::yaml::tests::vars_maps_correctly
    matches::group::loader::yaml::util::tests::convert_params_invalid_key_type
    matches::group::loader::yaml::util::tests::convert_params_works_correctly
    matches::group::loader::yaml::util::tests::convert_value_params

test result: FAILED. 75 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
