*** espanso-config/src/matches/group/mod.rs:39:9: replace MatchGroup::load -> Result<(Self, Option<NonFatalErrorSet>)> with Ok((Default::default(), None))

*** mutation diff:
--- espanso-config/src/matches/group/mod.rs
+++ replace MatchGroup::load -> Result<(Self, Option<NonFatalErrorSet>)> with Ok((Default::default(), None))
@@ -31,11 +31,11 @@
 pub(crate) struct MatchGroup {
     pub imports: Vec<String>,
     pub global_vars: Vec<Variable>,
     pub matches: Vec<Match>,
 }
 
 impl MatchGroup {
     pub fn load(group_path: &Path) -> Result<(Self, Option<NonFatalErrorSet>)> {
-        loader::load_match_group(group_path)
+        Ok((Default::default(), None)) /* ~ changed by cargo-mutants ~ */
     }
 }

---- matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap stdout ----

thread 'matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap' panicked at espanso-config/src/matches/store/default.rs:704:13:
assertion `left == right` failed
  left: []

---- matches::store::default::tests::match_store_handles_circular_dependency stdout ----

thread 'matches::store::default::tests::match_store_handles_circular_dependency' panicked at espanso-config/src/matches/store/default.rs:348:13:
assertion `left == right` failed
  left: 1
 right: 3

---- matches::store::default::tests::match_store_loads_correctly stdout ----

thread 'matches::store::default::tests::match_store_loads_correctly' panicked at espanso-config/src/matches/store/default.rs:242:13:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    matches::store::default::tests::match_store_handles_circular_dependency
    matches::store::default::tests::match_store_loads_correctly
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports
    tests::load_non_fatal_errors
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 70 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
