*** espanso-config/src/matches/group/path.rs:30:5: replace resolve_imports -> Result<(Vec<String>, Vec<ErrorRecord>)> with Ok((vec![], vec![]))

*** mutation diff:
--- espanso-config/src/matches/group/path.rs
+++ replace resolve_imports -> Result<(Vec<String>, Vec<ErrorRecord>)> with Ok((vec![], vec![]))
@@ -22,68 +22,17 @@
 use thiserror::Error;
 
 use crate::error::ErrorRecord;
 
 pub fn resolve_imports(
     group_path: &Path,
     imports: &[String],
 ) -> Result<(Vec<String>, Vec<ErrorRecord>)> {
-    let mut paths = Vec::new();
-
-    // Get the containing directory
-    let current_dir = if group_path.is_file() {
-        if let Some(parent) = group_path.parent() {
-            parent
-        } else {
-            return Err(ResolveImportError::Failed(format!(
-          "unable to resolve imports for match group starting from current path: {group_path:?}"
-        ))
-            .into());
-        }
-    } else {
-        group_path
-    };
-
-    let mut non_fatal_errors = Vec::new();
-
-    for import in imports {
-        let import_path = PathBuf::from(import);
-
-        // Absolute or relative import
-        let full_path = if import_path.is_relative() {
-            current_dir.join(import_path)
-        } else {
-            import_path
-        };
-
-        match dunce::canonicalize(&full_path)
-            .with_context(|| format!("unable to canonicalize import path: {full_path:?}"))
-        {
-            Ok(canonical_path) => {
-                if canonical_path.exists() && canonical_path.is_file() {
-                    paths.push(canonical_path);
-                } else {
-                    // Best effort imports
-                    non_fatal_errors.push(ErrorRecord::error(anyhow!(
-                        "unable to resolve import at path: {:?}",
-                        canonical_path
-                    )));
-                }
-            }
-            Err(error) => non_fatal_errors.push(ErrorRecord::error(error)),
-        }
-    }
-
-    let string_paths = paths
-        .into_iter()
-        .map(|path| path.to_string_lossy().to_string())
-        .collect();
-
-    Ok((string_paths, non_fatal_errors))
+    Ok((vec![], vec![])) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Error, Debug)]
 pub enum ResolveImportError {
     #[error("resolve import failed: `{0}`")]
     Failed(String),
 }

---- matches::group::loader::yaml::tests::importer_works_correctly stdout ----

thread 'matches::group::loader::yaml::tests::importer_works_correctly' panicked at espanso-config/src/matches/group/loader/yaml/mod.rs:869:44:
called `Option::unwrap()` on a `None` value

---- matches::group::path::tests::resolve_imports_parent_relative_path stdout ----

thread 'matches::group::path::tests::resolve_imports_parent_relative_path' panicked at espanso-config/src/matches/group/path.rs:102:13:
assertion `left == right` failed
  left: []
 right: ["/private/var/folders/6f/_7411vhs4c58v7633qtsvlwc0000gn/T/tempconfig.CnBL3C2mwEc5/match/base.yml"]

---- matches::store::default::tests::match_store_loads_correctly stdout ----

thread 'matches::store::default::tests::match_store_loads_correctly' panicked at espanso-config/src/matches/store/default.rs:242:13:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    matches::group::loader::yaml::tests::importer_works_correctly
    matches::group::path::tests::resolve_imports_parent_relative_path
    matches::group::path::tests::resolve_imports_works_correctly
    matches::store::default::tests::match_store_handles_circular_dependency
    matches::store::default::tests::match_store_loads_correctly
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports
    tests::load_non_fatal_errors
    tests::load_works_correctly

test result: FAILED. 68 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
