*** espanso-config/src/matches/mod.rs:102:9: replace MatchCause::long_description -> String with "xyzzy".into()

*** mutation diff:
--- espanso-config/src/matches/mod.rs
+++ replace MatchCause::long_description -> String with "xyzzy".into()
@@ -94,21 +94,17 @@
             }
             MatchCause::Regex(trigger_cause) => Some(trigger_cause.regex.as_str()),
             MatchCause::None => None,
         }
         // TODO: insert rendering for hotkey/shortcut
     }
 
     pub fn long_description(&self) -> String {
-        match &self {
-            MatchCause::Trigger(trigger_cause) => format!("triggers: {:?}", trigger_cause.triggers),
-            MatchCause::Regex(trigger_cause) => format!("regex: {:?}", trigger_cause.regex),
-            MatchCause::None => "No description available".to_owned(),
-        }
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
         // TODO: insert rendering for hotkey/shortcut
     }
 
     pub fn search_terms(&self) -> Vec<&str> {
         if let MatchCause::Trigger(trigger_cause) = &self {
             trigger_cause.triggers.iter().map(String::as_str).collect()
         } else {
             vec![]

---- matches::tests::match_cause_regex_long_description stdout ----

thread 'matches::tests::match_cause_regex_long_description' panicked at espanso-config/src/matches/mod.rs:281:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "regex: \":greet\\\\d\""

---- matches::tests::match_cause_trigger_long_description stdout ----

thread 'matches::tests::match_cause_trigger_long_description' panicked at espanso-config/src/matches/mod.rs:271:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "triggers: [\":greet\"]"

failures:
    matches::tests::match_cause_regex_long_description
    matches::tests::match_cause_trigger_long_description

test result: FAILED. 77 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
