*** espanso-config/src/matches/mod.rs:91:9: replace MatchCause::description -> Option<&str> with Some("xyzzy")

*** mutation diff:
--- espanso-config/src/matches/mod.rs
+++ replace MatchCause::description -> Option<&str> with Some("xyzzy")
@@ -83,23 +83,17 @@
     None,
     Trigger(TriggerCause),
     Regex(RegexCause),
     // TODO: shortcut
 }
 
 impl MatchCause {
     pub fn description(&self) -> Option<&str> {
-        match &self {
-            MatchCause::Trigger(trigger_cause) => {
-                trigger_cause.triggers.first().map(String::as_str)
-            }
-            MatchCause::Regex(trigger_cause) => Some(trigger_cause.regex.as_str()),
-            MatchCause::None => None,
-        }
+        Some("xyzzy") /* ~ changed by cargo-mutants ~ */
         // TODO: insert rendering for hotkey/shortcut
     }
 
     pub fn long_description(&self) -> String {
         match &self {
             MatchCause::Trigger(trigger_cause) => format!("triggers: {:?}", trigger_cause.triggers),
             MatchCause::Regex(trigger_cause) => format!("regex: {:?}", trigger_cause.regex),
             MatchCause::None => "No description available".to_owned(),

---- matches::tests::match_cause_regex_description stdout ----

thread 'matches::tests::match_cause_regex_description' panicked at espanso-config/src/matches/mod.rs:262:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some(":greet\\d")

---- matches::tests::match_cause_trigger_description stdout ----

thread 'matches::tests::match_cause_trigger_description' panicked at espanso-config/src/matches/mod.rs:256:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some(":greet")

failures:
    matches::tests::match_cause_regex_description
    matches::tests::match_cause_trigger_description

test result: FAILED. 77 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
