*** espanso-config/src/matches/store/default.rs:117:5: replace query_matches_for_paths with ()

*** mutation diff:
--- espanso-config/src/matches/store/default.rs
+++ replace query_matches_for_paths with ()
@@ -109,47 +109,17 @@
     groups: &'a HashMap<String, MatchGroup>,
     visited_paths: &mut HashSet<String>,
     visited_matches: &mut HashSet<StructId>,
     visited_global_vars: &mut HashSet<StructId>,
     matches: &mut Vec<&'a Match>,
     global_vars: &mut Vec<&'a Variable>,
     paths: &[String],
 ) {
-    for path in paths {
-        if !visited_paths.contains(path) {
-            visited_paths.insert(path.clone());
-
-            if let Some(group) = groups.get(path) {
-                query_matches_for_paths(
-                    groups,
-                    visited_paths,
-                    visited_matches,
-                    visited_global_vars,
-                    matches,
-                    global_vars,
-                    &group.imports,
-                );
-
-                for m in &group.matches {
-                    if !visited_matches.contains(&m.id) {
-                        matches.push(m);
-                        visited_matches.insert(m.id);
-                    }
-                }
-
-                for var in &group.global_vars {
-                    if !visited_global_vars.contains(&var.id) {
-                        global_vars.push(var);
-                        visited_global_vars.insert(var.id);
-                    }
-                }
-            }
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::{
         matches::{MatchCause, MatchEffect, TextEffect, TriggerCause},
         util::tests::use_test_directory,

---- matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap stdout ----

thread 'matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap' panicked at espanso-config/src/matches/store/default.rs:674:13:
assertion `left == right` failed
  left: []

---- matches::store::default::tests::match_store_query_handles_circular_depencencies stdout ----

thread 'matches::store::default::tests::match_store_query_handles_circular_depencencies' panicked at espanso-config/src/matches/store/default.rs:481:13:
assertion `left == right` failed
  left: []

---- matches::store::default::tests::match_store_query_single_path_with_imports stdout ----

thread 'matches::store::default::tests::match_store_query_single_path_with_imports' panicked at espanso-config/src/matches/store/default.rs:384:13:
assertion `left == right` failed
  left: []

failures:
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 73 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
