*** espanso-config/src/matches/store/default.rs:118:12: delete ! in query_matches_for_paths

*** mutation diff:
--- espanso-config/src/matches/store/default.rs
+++ delete ! in query_matches_for_paths
@@ -110,17 +110,17 @@
     visited_paths: &mut HashSet<String>,
     visited_matches: &mut HashSet<StructId>,
     visited_global_vars: &mut HashSet<StructId>,
     matches: &mut Vec<&'a Match>,
     global_vars: &mut Vec<&'a Variable>,
     paths: &[String],
 ) {
     for path in paths {
-        if !visited_paths.contains(path) {
+        if  /* ~ changed by cargo-mutants ~ */visited_paths.contains(path) {
             visited_paths.insert(path.clone());
 
             if let Some(group) = groups.get(path) {
                 query_matches_for_paths(
                     groups,
                     visited_paths,
                     visited_matches,
                     visited_global_vars,

---- matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap stdout ----

thread 'matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap' panicked at espanso-config/src/matches/store/default.rs:704:13:
assertion `left == right` failed
  left: []

---- matches::store::default::tests::match_store_query_multiple_paths stdout ----

thread 'matches::store::default::tests::match_store_query_multiple_paths' panicked at espanso-config/src/matches/store/default.rs:607:13:
assertion `left == right` failed
  left: []

---- tests::load_non_fatal_match_errors stdout ----

thread 'tests::load_non_fatal_match_errors' panicked at espanso-config/src/lib.rs:256:13:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 73 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
