*** espanso-config/src/matches/store/default.rs:133:24: delete ! in query_matches_for_paths

*** mutation diff:
--- espanso-config/src/matches/store/default.rs
+++ delete ! in query_matches_for_paths
@@ -125,17 +125,17 @@
                     visited_matches,
                     visited_global_vars,
                     matches,
                     global_vars,
                     &group.imports,
                 );
 
                 for m in &group.matches {
-                    if !visited_matches.contains(&m.id) {
+                    if  /* ~ changed by cargo-mutants ~ */visited_matches.contains(&m.id) {
                         matches.push(m);
                         visited_matches.insert(m.id);
                     }
                 }
 
                 for var in &group.global_vars {
                     if !visited_global_vars.contains(&var.id) {
                         global_vars.push(var);

---- matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap stdout ----

thread 'matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap' panicked at espanso-config/src/matches/store/default.rs:704:13:
assertion `left == right` failed
  left: []

---- matches::store::default::tests::match_store_query_handles_circular_depencencies stdout ----

thread 'matches::store::default::tests::match_store_query_handles_circular_depencencies' panicked at espanso-config/src/matches/store/default.rs:511:13:
assertion `left == right` failed
  left: []

---- matches::store::default::tests::match_store_query_multiple_paths stdout ----

thread 'matches::store::default::tests::match_store_query_multiple_paths' panicked at espanso-config/src/matches/store/default.rs:607:13:
assertion `left == right` failed
  left: []

failures:
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 73 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
