*** espanso-config/src/matches/store/default.rs:140:24: delete ! in query_matches_for_paths

*** mutation diff:
--- espanso-config/src/matches/store/default.rs
+++ delete ! in query_matches_for_paths
@@ -132,17 +132,17 @@
                 for m in &group.matches {
                     if !visited_matches.contains(&m.id) {
                         matches.push(m);
                         visited_matches.insert(m.id);
                     }
                 }
 
                 for var in &group.global_vars {
-                    if !visited_global_vars.contains(&var.id) {
+                    if  /* ~ changed by cargo-mutants ~ */visited_global_vars.contains(&var.id) {
                         global_vars.push(var);
                         visited_global_vars.insert(var.id);
                     }
                 }
             }
         }
     }
 }

---- matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap stdout ----

thread 'matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap' panicked at espanso-config/src/matches/store/default.rs:722:13:
assertion `left == right` failed
  left: []
 right: [Variable { id: 0, name: "var2", var_type: "test", params: {}, inject_vars: true, depends_on: [] }, Variable { id: 0, name: "var1", var_type: "test", params: {}, inject_vars: true, depends_on: [] }]

---- matches::store::default::tests::match_store_query_multiple_paths stdout ----

thread 'matches::store::default::tests::match_store_query_multiple_paths' panicked at espanso-config/src/matches/store/default.rs:625:13:
assertion `left == right` failed
  left: []
 right: [Variable { id: 0, name: "var1", var_type: "test", params: {}, inject_vars: true, depends_on: [] }, Variable { id: 0, name: "var2", var_type: "test", params: {}, inject_vars: true, depends_on: [] }]

---- matches::store::default::tests::match_store_query_handles_circular_depencencies stdout ----

thread 'matches::store::default::tests::match_store_query_handles_circular_depencencies' panicked at espanso-config/src/matches/store/default.rs:529:13:
assertion `left == right` failed
  left: []
 right: [Variable { id: 0, name: "var2", var_type: "test", params: {}, inject_vars: true, depends_on: [] }, Variable { id: 0, name: "var1", var_type: "test", params: {}, inject_vars: true, depends_on: [] }]

failures:
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports

test result: FAILED. 75 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
