*** espanso-config/src/matches/store/default.rs:75:9: replace <impl MatchStore for DefaultMatchStore>::loaded_paths -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- espanso-config/src/matches/store/default.rs
+++ replace <impl MatchStore for DefaultMatchStore>::loaded_paths -> Vec<String> with vec!["xyzzy".into()]
@@ -67,17 +67,17 @@
 
         MatchSet {
             matches,
             global_vars,
         }
     }
 
     fn loaded_paths(&self) -> Vec<String> {
-        self.groups.keys().cloned().collect()
+        vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn load_match_groups_recursively(
     groups: &mut HashMap<String, MatchGroup>,
     paths: &[String],
     non_fatal_error_sets: &mut Vec<NonFatalErrorSet>,
 ) {

*** result: Success
