*** espanso-config/src/matches/store/default.rs:75:9: replace <impl MatchStore for DefaultMatchStore>::loaded_paths -> Vec<String> with vec![]

*** mutation diff:
--- espanso-config/src/matches/store/default.rs
+++ replace <impl MatchStore for DefaultMatchStore>::loaded_paths -> Vec<String> with vec![]
@@ -67,17 +67,17 @@
 
         MatchSet {
             matches,
             global_vars,
         }
     }
 
     fn loaded_paths(&self) -> Vec<String> {
-        self.groups.keys().cloned().collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn load_match_groups_recursively(
     groups: &mut HashMap<String, MatchGroup>,
     paths: &[String],
     non_fatal_error_sets: &mut Vec<NonFatalErrorSet>,
 ) {

---- tests::load_non_fatal_errors stdout ----

thread 'tests::load_non_fatal_errors' panicked at espanso-config/src/lib.rs:228:13:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    tests::load_non_fatal_errors

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
