*** espanso-config/src/matches/store/default.rs:84:5: replace load_match_groups_recursively with ()

*** mutation diff:
--- espanso-config/src/matches/store/default.rs
+++ replace load_match_groups_recursively with ()
@@ -76,38 +76,17 @@
     }
 }
 
 fn load_match_groups_recursively(
     groups: &mut HashMap<String, MatchGroup>,
     paths: &[String],
     non_fatal_error_sets: &mut Vec<NonFatalErrorSet>,
 ) {
-    for path in paths {
-        if !groups.contains_key(path) {
-            let group_path = PathBuf::from(path);
-            match MatchGroup::load(&group_path)
-                .with_context(|| format!("unable to load match group {group_path:?}"))
-            {
-                Ok((group, non_fatal_error_set)) => {
-                    let imports = group.imports.clone();
-                    groups.insert(path.clone(), group);
-
-                    if let Some(non_fatal_error_set) = non_fatal_error_set {
-                        non_fatal_error_sets.push(non_fatal_error_set);
-                    }
-
-                    load_match_groups_recursively(groups, &imports, non_fatal_error_sets);
-                }
-                Err(err) => {
-                    non_fatal_error_sets.push(NonFatalErrorSet::single_error(&group_path, err));
-                }
-            }
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn query_matches_for_paths<'a>(
     groups: &'a HashMap<String, MatchGroup>,
     visited_paths: &mut HashSet<String>,
     visited_matches: &mut HashSet<StructId>,
     visited_global_vars: &mut HashSet<StructId>,
     matches: &mut Vec<&'a Match>,

---- matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap stdout ----

thread 'matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap' panicked at espanso-config/src/matches/store/default.rs:683:13:
assertion `left == right` failed
  left: []

---- matches::store::default::tests::match_store_loads_correctly stdout ----

thread 'matches::store::default::tests::match_store_loads_correctly' panicked at espanso-config/src/matches/store/default.rs:221:13:
assertion `left == right` failed
  left: 0
 right: 3

---- matches::store::default::tests::match_store_handles_circular_dependency stdout ----

thread 'matches::store::default::tests::match_store_handles_circular_dependency' panicked at espanso-config/src/matches/store/default.rs:327:13:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    matches::store::default::tests::match_store_handles_circular_dependency
    matches::store::default::tests::match_store_loads_correctly
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports
    tests::load_non_fatal_errors
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 70 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
