*** espanso-config/src/matches/store/default.rs:85:12: delete ! in load_match_groups_recursively

*** mutation diff:
--- espanso-config/src/matches/store/default.rs
+++ delete ! in load_match_groups_recursively
@@ -77,17 +77,17 @@
 }
 
 fn load_match_groups_recursively(
     groups: &mut HashMap<String, MatchGroup>,
     paths: &[String],
     non_fatal_error_sets: &mut Vec<NonFatalErrorSet>,
 ) {
     for path in paths {
-        if !groups.contains_key(path) {
+        if  /* ~ changed by cargo-mutants ~ */groups.contains_key(path) {
             let group_path = PathBuf::from(path);
             match MatchGroup::load(&group_path)
                 .with_context(|| format!("unable to load match group {group_path:?}"))
             {
                 Ok((group, non_fatal_error_set)) => {
                     let imports = group.imports.clone();
                     groups.insert(path.clone(), group);

---- matches::store::default::tests::match_store_loads_correctly stdout ----

thread 'matches::store::default::tests::match_store_loads_correctly' panicked at espanso-config/src/matches/store/default.rs:242:13:
assertion `left == right` failed
  left: 0
 right: 3

---- matches::store::default::tests::match_store_handles_circular_dependency stdout ----

thread 'matches::store::default::tests::match_store_handles_circular_dependency' panicked at espanso-config/src/matches/store/default.rs:348:13:
assertion `left == right` failed
  left: 0
 right: 3

---- matches::store::default::tests::match_store_query_handles_circular_depencencies stdout ----

thread 'matches::store::default::tests::match_store_query_handles_circular_depencencies' panicked at espanso-config/src/matches/store/default.rs:511:13:
assertion `left == right` failed
  left: []

failures:
    matches::store::default::tests::match_store_handles_circular_dependency
    matches::store::default::tests::match_store_loads_correctly
    matches::store::default::tests::match_store_query_handle_duplicates_when_imports_and_paths_overlap
    matches::store::default::tests::match_store_query_handles_circular_depencencies
    matches::store::default::tests::match_store_query_multiple_paths
    matches::store::default::tests::match_store_query_single_path_with_imports
    tests::load_non_fatal_errors
    tests::load_non_fatal_match_errors
    tests::load_works_correctly

test result: FAILED. 70 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
