*** espanso-config/src/util.rs:24:5: replace is_yaml_empty -> bool with true

*** mutation diff:
--- espanso-config/src/util.rs
+++ replace is_yaml_empty -> bool with true
@@ -16,24 +16,17 @@
  * You should have received a copy of the GNU General Public License
  * along with espanso.  If not, see <https://www.gnu.org/licenses/>.
  */
 
 /// Check if the given string represents an empty YAML.
 /// In other words, it checks if the document is only composed
 /// of spaces and/or comments
 pub fn is_yaml_empty(yaml: &str) -> bool {
-    for line in yaml.lines() {
-        let trimmed_line = line.trim();
-        if !trimmed_line.starts_with('#') && !trimmed_line.is_empty() {
-            return false;
-        }
-    }
-
-    true
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 pub mod tests {
     use super::*;
     use std::{fs::create_dir_all, path::Path};
     use tempdir::TempDir;

---- config::parse::yaml::tests::conversion_to_parsed_config_works_correctly stdout ----

thread 'config::parse::yaml::tests::conversion_to_parsed_config_works_correctly' panicked at espanso-config/src/config/parse/yaml.rs:323:9:
assertion `left == right` failed

---- config::resolve::tests::is_match_filter_exec stdout ----

thread 'config::resolve::tests::is_match_filter_exec' panicked at espanso-config/src/config/resolve.rs:914:9:
assertion failed: test_filter_is_match("filter_exec: chrome.exe",
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

---- config::resolve::tests::is_match_filter_title stdout ----

thread 'config::resolve::tests::is_match_filter_title' panicked at espanso-config/src/config/resolve.rs:854:9:
assertion failed: test_filter_is_match("filter_title: Google",
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

failures:
    config::parse::yaml::tests::conversion_to_parsed_config_works_correctly
    config::resolve::tests::is_match_filter_class
    config::resolve::tests::is_match_filter_exec
    config::resolve::tests::is_match_filter_os
    config::resolve::tests::is_match_filter_title
    config::resolve::tests::is_match_multiple_filters
    config::resolve::tests::match_paths_generated_correctly_with_child_config
    config::resolve::tests::match_paths_generated_correctly_with_underscore_files
    matches::group::loader::tests::load_group_parsing_error
    matches::group::loader::tests::load_group_yaml_format
    matches::group::loader::tests::load_group_yaml_format_2
    matches::group::loader::tests::load_group_yaml_format_casing

test result: FAILED. 53 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
