*** espanso-config/src/util.rs:24:5: replace is_yaml_empty -> bool with false

*** mutation diff:
--- espanso-config/src/util.rs
+++ replace is_yaml_empty -> bool with false
@@ -16,24 +16,17 @@
  * You should have received a copy of the GNU General Public License
  * along with espanso.  If not, see <https://www.gnu.org/licenses/>.
  */
 
 /// Check if the given string represents an empty YAML.
 /// In other words, it checks if the document is only composed
 /// of spaces and/or comments
 pub fn is_yaml_empty(yaml: &str) -> bool {
-    for line in yaml.lines() {
-        let trimmed_line = line.trim();
-        if !trimmed_line.starts_with('#') && !trimmed_line.is_empty() {
-            return false;
-        }
-    }
-
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 pub mod tests {
     use super::*;
     use std::{fs::create_dir_all, path::Path};
     use tempdir::TempDir;

---- config::resolve::tests::is_match_no_filters stdout ----

thread 'config::resolve::tests::is_match_no_filters' panicked at espanso-config/src/config/resolve.rs:833:67:
called `Result::unwrap()` on an `Err` value: can't load config `EOF while parsing a value`

Caused by:
    EOF while parsing a value

---- config::resolve::tests::match_paths_generated_correctly stdout ----

thread 'config::resolve::tests::match_paths_generated_correctly' panicked at espanso-config/src/config/resolve.rs:717:67:
called `Result::unwrap()` on an `Err` value: can't load config `EOF while parsing a value`

Caused by:
    EOF while parsing a value

---- util::tests::is_yaml_empty_document_empty stdout ----

thread 'util::tests::is_yaml_empty_document_empty' panicked at espanso-config/src/util.rs:50:9:
assertion failed: is_yaml_empty("")

failures:
    config::resolve::tests::is_match_no_filters
    config::resolve::tests::match_paths_generated_correctly
    tests::load_non_fatal_errors
    tests::load_non_fatal_match_errors
    tests::load_works_correctly
    util::tests::is_yaml_empty_document_empty
    util::tests::is_yaml_empty_document_with_comments

test result: FAILED. 72 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
