*** espanso-config/src/util.rs:26:43: replace && with || in is_yaml_empty

*** mutation diff:
--- espanso-config/src/util.rs
+++ replace && with || in is_yaml_empty
@@ -18,17 +18,17 @@
  */
 
 /// Check if the given string represents an empty YAML.
 /// In other words, it checks if the document is only composed
 /// of spaces and/or comments
 pub fn is_yaml_empty(yaml: &str) -> bool {
     for line in yaml.lines() {
         let trimmed_line = line.trim();
-        if !trimmed_line.starts_with('#') && !trimmed_line.is_empty() {
+        if !trimmed_line.starts_with('#') || /* ~ changed by cargo-mutants ~ */ !trimmed_line.is_empty() {
             return false;
         }
     }
 
     true
 }
 
 #[cfg(test)]

---- util::tests::is_yaml_empty_document_with_comments stdout ----

thread 'util::tests::is_yaml_empty_document_with_comments' panicked at espanso-config/src/util.rs:62:9:
assertion failed: is_yaml_empty("\n#comment \n \n")

failures:
    util::tests::is_yaml_empty_document_with_comments

test result: FAILED. 78 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
