*** espanso-config/src/util.rs:26:46: delete ! in is_yaml_empty

*** mutation diff:
--- espanso-config/src/util.rs
+++ delete ! in is_yaml_empty
@@ -18,17 +18,17 @@
  */
 
 /// Check if the given string represents an empty YAML.
 /// In other words, it checks if the document is only composed
 /// of spaces and/or comments
 pub fn is_yaml_empty(yaml: &str) -> bool {
     for line in yaml.lines() {
         let trimmed_line = line.trim();
-        if !trimmed_line.starts_with('#') && !trimmed_line.is_empty() {
+        if !trimmed_line.starts_with('#') &&  /* ~ changed by cargo-mutants ~ */trimmed_line.is_empty() {
             return false;
         }
     }
 
     true
 }
 
 #[cfg(test)]

---- config::resolve::tests::is_match_filter_class stdout ----

thread 'config::resolve::tests::is_match_filter_class' panicked at espanso-config/src/config/resolve.rs:884:9:
assertion failed: test_filter_is_match("filter_class: Chrome",
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

---- config::resolve::tests::is_match_filter_exec stdout ----

thread 'config::resolve::tests::is_match_filter_exec' panicked at espanso-config/src/config/resolve.rs:914:9:
assertion failed: test_filter_is_match("filter_exec: chrome.exe",
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

---- config::resolve::tests::is_match_filter_title stdout ----

thread 'config::resolve::tests::is_match_filter_title' panicked at espanso-config/src/config/resolve.rs:854:9:
assertion failed: test_filter_is_match("filter_title: Google",
    &AppProperties {
            title: Some("Google Mail"),
            class: Some("Chrome"),
            exec: Some("chrome.exe"),
        })

failures:
    config::resolve::tests::is_match_filter_class
    config::resolve::tests::is_match_filter_exec
    config::resolve::tests::is_match_filter_os
    config::resolve::tests::is_match_filter_title
    config::resolve::tests::match_paths_generated_correctly_with_underscore_files
    matches::group::loader::tests::load_group_parsing_error
    util::tests::is_yaml_empty_document_with_comments

test result: FAILED. 72 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
