*** espanso-detect/src/evdev/device.rs:114:20: replace <= with > in Device::read

*** mutation diff:
--- espanso-detect/src/evdev/device.rs
+++ replace <= with > in Device::read
@@ -106,17 +106,17 @@
         loop {
             len = unsafe {
                 libc::read(
                     self.file.as_raw_fd(),
                     evs.as_mut_ptr() as *mut c_void,
                     std::mem::size_of_val(&evs),
                 )
             };
-            if len <= 0 {
+            if len > /* ~ changed by cargo-mutants ~ */ 0 {
                 break;
             }
 
             let nevs: size_t = len as usize / std::mem::size_of::<input_event>();
 
             #[allow(clippy::needless_range_loop)]
             for i in 0..nevs {
                 let event = self.process_event(evs[i].type_, evs[i].code, evs[i].value);

*** result: Success
