*** espanso-detect/src/evdev/device.rs:130:38: replace == with != in Device::read

*** mutation diff:
--- espanso-detect/src/evdev/device.rs
+++ replace == with != in Device::read
@@ -122,17 +122,17 @@
                 let event = self.process_event(evs[i].type_, evs[i].code, evs[i].value);
                 if let Some(event) = event {
                     events.push(event);
                 }
             }
         }
 
         if len < 0 && unsafe { *errno_ptr } != EWOULDBLOCK {
-            if unsafe { *errno_ptr } == ENODEV {
+            if unsafe { *errno_ptr } != /* ~ changed by cargo-mutants ~ */ ENODEV {
                 return Err(DeviceError::FailedReadNoSuchDevice.into());
             }
 
             return Err(DeviceError::FailedRead(unsafe { *errno_ptr }).into());
         }
 
         Ok(events)
     }

*** result: Success
