*** espanso-detect/src/evdev/device.rs:158:38: replace && with || in Device::process_event

*** mutation diff:
--- espanso-detect/src/evdev/device.rs
+++ replace && with || in Device::process_event
@@ -150,17 +150,17 @@
             return Some(RawInputEvent::Mouse(RawMouseEvent { code, is_down }));
         }
 
         // Keyboard event
 
         let keycode: xkb_keycode_t = EVDEV_OFFSET as u32 + code as u32;
         let keymap = unsafe { xkb_state_get_keymap(self.get_state()) };
 
-        if value == KEY_STATE_REPEAT && unsafe { xkb_keymap_key_repeats(keymap, keycode) } == 0 {
+        if value == KEY_STATE_REPEAT || /* ~ changed by cargo-mutants ~ */ unsafe { xkb_keymap_key_repeats(keymap, keycode) } == 0 {
             return None;
         }
 
         let sym = unsafe { xkb_state_key_get_one_sym(self.get_state(), keycode) };
         if sym == 0 {
             return None;
         }

*** result: Success
