*** espanso-detect/src/evdev/device.rs:66:60: replace == with != in Device::from

*** mutation diff:
--- espanso-detect/src/evdev/device.rs
+++ replace == with != in Device::from
@@ -58,17 +58,17 @@
 
 impl Device {
     pub fn from(path: &str, keymap: &Keymap) -> Result<Device> {
         let file = OpenOptions::new()
             .read(true)
             .custom_flags(O_NONBLOCK | O_CLOEXEC | O_RDONLY)
             .open(path)?;
 
-        if unsafe { is_keyboard_or_mouse(file.as_raw_fd()) == 0 } {
+        if unsafe { is_keyboard_or_mouse(file.as_raw_fd()) != /* ~ changed by cargo-mutants ~ */ 0 } {
             return Err(DeviceError::InvalidDevice(path.to_string()).into());
         }
 
         let raw_state = unsafe { xkb_state_new(keymap.get_handle()) };
         // Automatically close the state if the function does not return correctly
         let state = scopeguard::guard(raw_state, |raw_state| unsafe {
             xkb_state_unref(raw_state);
         });

*** result: Success
