*** espanso-detect/src/evdev/device.rs:89:9: replace Device::get_state -> *mut xkb_state with Default::default()

*** mutation diff:
--- espanso-detect/src/evdev/device.rs
+++ replace Device::get_state -> *mut xkb_state with Default::default()
@@ -81,17 +81,17 @@
             path: path.to_string(),
             file,
             // Release the state without freeing it
             state: ScopeGuard::into_inner(state),
         })
     }
 
     pub fn get_state(&self) -> *mut xkb_state {
-        self.state
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn get_raw_fd(&self) -> i32 {
         self.file.as_raw_fd()
     }
 
     pub fn get_path(&self) -> String {
         self.path.to_string()

*** result: Success
