*** espanso-detect/src/evdev/hotkey.rs:109:12: delete ! in HotKeyFilter::process_event

*** mutation diff:
--- espanso-detect/src/evdev/hotkey.rs
+++ delete ! in HotKeyFilter::process_event
@@ -101,17 +101,17 @@
                         Some(i)
                     } else {
                         None
                     }
                 }),
         );
 
         // Remove duplicates and revert
-        if !to_be_removed.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */to_be_removed.is_empty() {
             to_be_removed.sort_unstable();
             to_be_removed.dedup();
             to_be_removed.reverse();
             for index in to_be_removed {
                 self.memory.remove(index);
             }
         }

*** result: Success
