*** espanso-detect/src/evdev/mod.rs:196:89: replace != with == in <impl Source for EVDEVSource>::eventloop

*** mutation diff:
--- espanso-detect/src/evdev/mod.rs
+++ replace != with == in <impl Source for EVDEVSource>::eventloop
@@ -188,17 +188,17 @@
         }
 
         // Setup epoll for all input devices
         let errno_ptr = unsafe { __errno_location() };
         for (i, device) in self.devices.iter().enumerate() {
             let mut ev: epoll_event = unsafe { std::mem::zeroed() };
             ev.events = EPOLLIN as u32;
             ev.u64 = i as u64;
-            if unsafe { epoll_ctl(*epfd, EPOLL_CTL_ADD, device.get_raw_fd(), &mut ev) } != 0 {
+            if unsafe { epoll_ctl(*epfd, EPOLL_CTL_ADD, device.get_raw_fd(), &mut ev) } == /* ~ changed by cargo-mutants ~ */ 0 {
                 error!(
                     "Could not add {} to epoll, errno {}",
                     device.get_path(),
                     unsafe { *errno_ptr }
                 );
                 return Err(EVDEVSourceError::Internal().into());
             }
         }

*** result: Success
