*** espanso-detect/src/evdev/mod.rs:211:72: delete - in <impl Source for EVDEVSource>::eventloop

*** mutation diff:
--- espanso-detect/src/evdev/mod.rs
+++ delete - in <impl Source for EVDEVSource>::eventloop
@@ -203,17 +203,17 @@
             }
         }
 
         let mut hotkey_filter = self._hotkey_filter.borrow_mut();
 
         // Read events indefinitely
         let mut evs: [epoll_event; 16] = unsafe { std::mem::zeroed() };
         loop {
-            let ret = unsafe { epoll_wait(*epfd, evs.as_mut_ptr(), 16, -1) };
+            let ret = unsafe { epoll_wait(*epfd, evs.as_mut_ptr(), 16,  /* ~ changed by cargo-mutants ~ */1) };
             if ret < 0 {
                 if unsafe { *errno_ptr } == EINTR {
                     continue;
                 }
                 error!("Could not poll for events, {}", unsafe { *errno_ptr });
                 return Err(EVDEVSourceError::Internal().into());
             }

*** result: Success
