*** espanso-detect/src/evdev/mod.rs:213:42: replace == with != in <impl Source for EVDEVSource>::eventloop

*** mutation diff:
--- espanso-detect/src/evdev/mod.rs
+++ replace == with != in <impl Source for EVDEVSource>::eventloop
@@ -205,17 +205,17 @@
 
         let mut hotkey_filter = self._hotkey_filter.borrow_mut();
 
         // Read events indefinitely
         let mut evs: [epoll_event; 16] = unsafe { std::mem::zeroed() };
         loop {
             let ret = unsafe { epoll_wait(*epfd, evs.as_mut_ptr(), 16, -1) };
             if ret < 0 {
-                if unsafe { *errno_ptr } == EINTR {
+                if unsafe { *errno_ptr } != /* ~ changed by cargo-mutants ~ */ EINTR {
                     continue;
                 }
                 error!("Could not poll for events, {}", unsafe { *errno_ptr });
                 return Err(EVDEVSourceError::Internal().into());
             }
 
             for ev in evs.iter().take(ret as usize) {
                 let device = &self.devices[ev.u64 as usize];

*** result: Success
