*** espanso-detect/src/evdev/mod.rs:303:54: replace == with != in <impl From<RawInputEvent> for Option<InputEvent>>::from

*** mutation diff:
--- espanso-detect/src/evdev/mod.rs
+++ replace == with != in <impl From<RawInputEvent> for Option<InputEvent>>::from
@@ -295,17 +295,17 @@
             RawInputEvent::Keyboard(keyboard_event) => {
                 let (key, variant) = key_sym_to_key(keyboard_event.sym as i32);
                 let value = if keyboard_event.value.is_empty() {
                     None
                 } else {
                     Some(keyboard_event.value)
                 };
 
-                let status = if keyboard_event.state == KEY_STATE_PRESS {
+                let status = if keyboard_event.state != /* ~ changed by cargo-mutants ~ */ KEY_STATE_PRESS {
                     Pressed
                 } else if keyboard_event.state == KEY_STATE_RELEASE {
                     Released
                 } else {
                     // Filter out the "repeated" events
                     return None;
                 };

*** result: Success
