*** espanso-detect/src/evdev/mod.rs:352:9: delete match arm

*** mutation diff:
--- espanso-detect/src/evdev/mod.rs
+++ delete match arm
@@ -344,17 +344,17 @@
         0xFFEA => (Alt, Some(Right)),
         0xFFE5 => (CapsLock, None),
         0xFFE3 => (Control, Some(Left)),
         0xFFE4 => (Control, Some(Right)),
         0xFFE7 | 0xFFEB => (Meta, Some(Left)),
         0xFFE8 | 0xFFEC => (Meta, Some(Right)),
         0xFF7F => (NumLock, None),
         0xFFE1 => (Shift, Some(Left)),
-        0xFFE2 => (Shift, Some(Right)),
+         /* ~ changed by cargo-mutants ~ */
 
         // Whitespace
         0xFF0D => (Enter, None),
         0xFF09 => (Tab, None),
         0x20 => (Space, None),
 
         // Navigation
         0xFF54 => (ArrowDown, None),

*** result: Success
