*** espanso-detect/src/evdev/mod.rs:357:9: delete match arm

*** mutation diff:
--- espanso-detect/src/evdev/mod.rs
+++ delete match arm
@@ -349,17 +349,17 @@
         0xFFE8 | 0xFFEC => (Meta, Some(Right)),
         0xFF7F => (NumLock, None),
         0xFFE1 => (Shift, Some(Left)),
         0xFFE2 => (Shift, Some(Right)),
 
         // Whitespace
         0xFF0D => (Enter, None),
         0xFF09 => (Tab, None),
-        0x20 => (Space, None),
+         /* ~ changed by cargo-mutants ~ */
 
         // Navigation
         0xFF54 => (ArrowDown, None),
         0xFF51 => (ArrowLeft, None),
         0xFF53 => (ArrowRight, None),
         0xFF52 => (ArrowUp, None),
         0xFF57 => (End, None),
         0xFF50 => (Home, None),

*** result: Success
