*** espanso-detect/src/evdev/mod.rs:370:9: delete match arm

*** mutation diff:
--- espanso-detect/src/evdev/mod.rs
+++ delete match arm
@@ -362,17 +362,17 @@
         0xFF53 => (ArrowRight, None),
         0xFF52 => (ArrowUp, None),
         0xFF57 => (End, None),
         0xFF50 => (Home, None),
         0xFF56 => (PageDown, None),
         0xFF55 => (PageUp, None),
 
         // UI
-        0xFF1B => (Escape, None),
+         /* ~ changed by cargo-mutants ~ */
 
         // Editing keys
         0xFF08 => (Backspace, None),
 
         // Function keys
         0xFFBE => (F1, None),
         0xFFBF => (F2, None),
         0xFFC0 => (F3, None),

*** result: Success
