*** espanso-detect/src/evdev/mod.rs:373:9: delete match arm

*** mutation diff:
--- espanso-detect/src/evdev/mod.rs
+++ delete match arm
@@ -365,17 +365,17 @@
         0xFF50 => (Home, None),
         0xFF56 => (PageDown, None),
         0xFF55 => (PageUp, None),
 
         // UI
         0xFF1B => (Escape, None),
 
         // Editing keys
-        0xFF08 => (Backspace, None),
+         /* ~ changed by cargo-mutants ~ */
 
         // Function keys
         0xFFBE => (F1, None),
         0xFFBF => (F2, None),
         0xFFC0 => (F3, None),
         0xFFC1 => (F4, None),
         0xFFC2 => (F5, None),
         0xFFC3 => (F6, None),

*** result: Success
