*** espanso-detect/src/evdev/mod.rs:380:9: delete match arm

*** mutation diff:
--- espanso-detect/src/evdev/mod.rs
+++ delete match arm
@@ -372,17 +372,17 @@
         // Editing keys
         0xFF08 => (Backspace, None),
 
         // Function keys
         0xFFBE => (F1, None),
         0xFFBF => (F2, None),
         0xFFC0 => (F3, None),
         0xFFC1 => (F4, None),
-        0xFFC2 => (F5, None),
+         /* ~ changed by cargo-mutants ~ */
         0xFFC3 => (F6, None),
         0xFFC4 => (F7, None),
         0xFFC5 => (F8, None),
         0xFFC6 => (F9, None),
         0xFFC7 => (F10, None),
         0xFFC8 => (F11, None),
         0xFFC9 => (F12, None),
         0xFFCA => (F13, None),

*** result: Success
