*** espanso-detect/src/evdev/mod.rs:386:9: delete match arm

*** mutation diff:
--- espanso-detect/src/evdev/mod.rs
+++ delete match arm
@@ -378,17 +378,17 @@
         0xFFC0 => (F3, None),
         0xFFC1 => (F4, None),
         0xFFC2 => (F5, None),
         0xFFC3 => (F6, None),
         0xFFC4 => (F7, None),
         0xFFC5 => (F8, None),
         0xFFC6 => (F9, None),
         0xFFC7 => (F10, None),
-        0xFFC8 => (F11, None),
+         /* ~ changed by cargo-mutants ~ */
         0xFFC9 => (F12, None),
         0xFFCA => (F13, None),
         0xFFCB => (F14, None),
         0xFFCC => (F15, None),
         0xFFCD => (F16, None),
         0xFFCE => (F17, None),
         0xFFCF => (F18, None),
         0xFFD0 => (F19, None),

*** result: Success
