*** espanso-detect/src/evdev/mod.rs:395:9: delete match arm

*** mutation diff:
--- espanso-detect/src/evdev/mod.rs
+++ delete match arm
@@ -387,17 +387,17 @@
         0xFFC9 => (F12, None),
         0xFFCA => (F13, None),
         0xFFCB => (F14, None),
         0xFFCC => (F15, None),
         0xFFCD => (F16, None),
         0xFFCE => (F17, None),
         0xFFCF => (F18, None),
         0xFFD0 => (F19, None),
-        0xFFD1 => (F20, None),
+         /* ~ changed by cargo-mutants ~ */
 
         // Numpad
         0xFFB0 => (Numpad0, None),
         0xFFB1 => (Numpad1, None),
         0xFFB2 => (Numpad2, None),
         0xFFB3 => (Numpad3, None),
         0xFFB4 => (Numpad4, None),
         0xFFB5 => (Numpad5, None),

*** result: Success
