*** espanso-detect/src/evdev/mod.rs:417:9: delete match arm

*** mutation diff:
--- espanso-detect/src/evdev/mod.rs
+++ delete match arm
@@ -409,17 +409,17 @@
         // Other keys, includes the raw code provided by the operating system
         _ => (Other(key_sym), None),
     }
 }
 
 // These codes can be found in the "input-event-codes.h" header file
 fn raw_to_mouse_button(raw: u16) -> Option<MouseButton> {
     match raw {
-        BTN_LEFT => Some(MouseButton::Left),
+         /* ~ changed by cargo-mutants ~ */
         BTN_RIGHT => Some(MouseButton::Right),
         BTN_MIDDLE => Some(MouseButton::Middle),
         BTN_SIDE => Some(MouseButton::Button1),
         BTN_EXTRA => Some(MouseButton::Button2),
         _ => None,
     }
 }

*** result: Success
