*** espanso-detect/src/evdev/state.rs:36:16: replace == with != in State::get_sym

*** mutation diff:
--- espanso-detect/src/evdev/state.rs
+++ replace == with != in State::get_sym
@@ -28,17 +28,17 @@
 
         Ok(Self {
             state: ScopeGuard::into_inner(state),
         })
     }
 
     pub fn get_sym(&self, code: u32) -> Option<u32> {
         let sym = unsafe { xkb_state_key_get_one_sym(self.state, code) };
-        if sym == 0 {
+        if sym != /* ~ changed by cargo-mutants ~ */ 0 {
             None
         } else {
             Some(sym)
         }
     }
 }
 
 impl Drop for State {

*** result: Success
