*** espanso-detect/src/evdev/sync/mod.rs:38:5: replace get_modifiers_state -> anyhow::Result<Option<ModifiersState>> with Ok(Some(Default::default()))

*** mutation diff:
--- espanso-detect/src/evdev/sync/mod.rs
+++ replace get_modifiers_state -> anyhow::Result<Option<ModifiersState>> with Ok(Some(Default::default()))
@@ -30,10 +30,10 @@
 #[cfg(feature = "wayland")]
 mod wayland;
 #[cfg(feature = "wayland")]
 pub use wayland::get_modifiers_state;
 
 #[cfg(not(feature = "wayland"))]
 pub fn get_modifiers_state() -> anyhow::Result<Option<ModifiersState>> {
     // Fallback for non-wayland systems
-    Ok(None)
+    Ok(Some(Default::default())) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
