*** espanso-detect/src/evdev/sync/wayland.rs:262:47: replace && with || in <impl SeatHandler for SimpleWindow>::new_capability

*** mutation diff:
--- espanso-detect/src/evdev/sync/wayland.rs
+++ replace && with || in <impl SeatHandler for SimpleWindow>::new_capability
@@ -254,17 +254,17 @@
 
     fn new_capability(
         &mut self,
         _conn: &Connection,
         qh: &QueueHandle<Self>,
         seat: wl_seat::WlSeat,
         capability: Capability,
     ) {
-        if capability == Capability::Keyboard && self.keyboard.is_none() {
+        if capability == Capability::Keyboard || /* ~ changed by cargo-mutants ~ */ self.keyboard.is_none() {
             debug!("Set keyboard capability");
             let keyboard = self
                 .seat_state
                 .get_keyboard(qh, &seat, None)
                 .expect("Failed to create keyboard");
 
             self.keyboard = Some(keyboard);
         }

*** result: Success
