*** espanso-detect/src/evdev/sync/wayland.rs:280:47: replace && with || in <impl SeatHandler for SimpleWindow>::remove_capability

*** mutation diff:
--- espanso-detect/src/evdev/sync/wayland.rs
+++ replace && with || in <impl SeatHandler for SimpleWindow>::remove_capability
@@ -272,17 +272,17 @@
 
     fn remove_capability(
         &mut self,
         _conn: &Connection,
         _: &QueueHandle<Self>,
         _: wl_seat::WlSeat,
         capability: Capability,
     ) {
-        if capability == Capability::Keyboard && self.keyboard.is_some() {
+        if capability == Capability::Keyboard || /* ~ changed by cargo-mutants ~ */ self.keyboard.is_some() {
             debug!("Unset keyboard capability");
             self.keyboard.take().unwrap().release();
         }
     }
 
     fn remove_seat(&mut self, _: &Connection, _: &QueueHandle<Self>, _: wl_seat::WlSeat) {}
 }

*** result: Success
