*** espanso-detect/src/evdev/sync/wayland.rs:314:9: replace <impl KeyboardHandler for SimpleWindow>::leave with ()

*** mutation diff:
--- espanso-detect/src/evdev/sync/wayland.rs
+++ replace <impl KeyboardHandler for SimpleWindow>::leave with ()
@@ -306,20 +306,17 @@
     fn leave(
         &mut self,
         _: &Connection,
         _: &QueueHandle<Self>,
         _: &wl_keyboard::WlKeyboard,
         surface: &wl_surface::WlSurface,
         _: u32,
     ) {
-        if self.window.wl_surface() == surface {
-            debug!("Release keyboard focus on window");
-            self.keyboard_focus = false;
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn press_key(
         &mut self,
         _conn: &Connection,
         _qh: &QueueHandle<Self>,
         _: &wl_keyboard::WlKeyboard,
         _: u32,

*** result: Success
