*** espanso-detect/src/evdev/sync/wayland.rs:414:55: replace % with + in SimpleWindow::draw

*** mutation diff:
--- espanso-detect/src/evdev/sync/wayland.rs
+++ replace % with + in SimpleWindow::draw
@@ -406,17 +406,17 @@
 
         // Draw to the window:
         {
             let shift = self.shift.unwrap_or(0);
             canvas
                 .chunks_exact_mut(4)
                 .enumerate()
                 .for_each(|(index, chunk)| {
-                    let x = ((index + shift as usize) % width as usize) as u32;
+                    let x = ((index + shift as usize) + /* ~ changed by cargo-mutants ~ */ width as usize) as u32;
                     let y = (index / width as usize) as u32;
 
                     let a = 0xFF;
                     let r = u32::min(((width - x) * 0xFF) / width, ((height - y) * 0xFF) / height);
                     let g = u32::min((x * 0xFF) / width, ((height - y) * 0xFF) / height);
                     let b = u32::min(((width - x) * 0xFF) / width, (y * 0xFF) / height);
                     let color = (a << 24) + (r << 16) + (g << 8) + b;

*** result: Success
