*** espanso-detect/src/evdev/sync/wayland.rs:415:36: replace / with % in SimpleWindow::draw

*** mutation diff:
--- espanso-detect/src/evdev/sync/wayland.rs
+++ replace / with % in SimpleWindow::draw
@@ -407,17 +407,17 @@
         // Draw to the window:
         {
             let shift = self.shift.unwrap_or(0);
             canvas
                 .chunks_exact_mut(4)
                 .enumerate()
                 .for_each(|(index, chunk)| {
                     let x = ((index + shift as usize) % width as usize) as u32;
-                    let y = (index / width as usize) as u32;
+                    let y = (index % /* ~ changed by cargo-mutants ~ */ width as usize) as u32;
 
                     let a = 0xFF;
                     let r = u32::min(((width - x) * 0xFF) / width, ((height - y) * 0xFF) / height);
                     let g = u32::min((x * 0xFF) / width, ((height - y) * 0xFF) / height);
                     let b = u32::min(((width - x) * 0xFF) / width, (y * 0xFF) / height);
                     let color = (a << 24) + (r << 16) + (g << 8) + b;
 
                     let array: &mut [u8; 4] = chunk.try_into().unwrap();

*** result: Success
