*** espanso-detect/src/evdev/sync/wayland.rs:419:80: replace / with % in SimpleWindow::draw

*** mutation diff:
--- espanso-detect/src/evdev/sync/wayland.rs
+++ replace / with % in SimpleWindow::draw
@@ -411,17 +411,17 @@
                 .chunks_exact_mut(4)
                 .enumerate()
                 .for_each(|(index, chunk)| {
                     let x = ((index + shift as usize) % width as usize) as u32;
                     let y = (index / width as usize) as u32;
 
                     let a = 0xFF;
                     let r = u32::min(((width - x) * 0xFF) / width, ((height - y) * 0xFF) / height);
-                    let g = u32::min((x * 0xFF) / width, ((height - y) * 0xFF) / height);
+                    let g = u32::min((x * 0xFF) / width, ((height - y) * 0xFF) % /* ~ changed by cargo-mutants ~ */ height);
                     let b = u32::min(((width - x) * 0xFF) / width, (y * 0xFF) / height);
                     let color = (a << 24) + (r << 16) + (g << 8) + b;
 
                     let array: &mut [u8; 4] = chunk.try_into().unwrap();
                     *array = color.to_le_bytes();
                 });
 
             if let Some(shift) = &mut self.shift {

*** result: Success
