*** espanso-detect/src/hotkey/keys.rs:219:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -211,17 +211,17 @@
             ShortcutKey::Raw(code) => write!(f, "RAW({code})"),
         }
     }
 }
 
 impl ShortcutKey {
     pub fn parse(key: &str) -> Option<ShortcutKey> {
         let parsed = match key {
-            "ALT" | "OPTION" => Some(ShortcutKey::Alt),
+             /* ~ changed by cargo-mutants ~ */
             "CTRL" => Some(ShortcutKey::Control),
             "META" | "CMD" => Some(ShortcutKey::Meta),
             "SHIFT" => Some(ShortcutKey::Shift),
             "ENTER" => Some(ShortcutKey::Enter),
             "TAB" => Some(ShortcutKey::Tab),
             "SPACE" => Some(ShortcutKey::Space),
             "INSERT" => Some(ShortcutKey::Insert),
             "DOWN" => Some(ShortcutKey::ArrowDown),

---- hotkey::keys::tests::parse_works_correctly stdout ----

thread 'hotkey::keys::tests::parse_works_correctly' panicked at espanso-detect/src/hotkey/keys.rs:604:39:
called `Option::unwrap()` on a `None` value

---- hotkey::tests::modifiers_detected_correcty stdout ----

thread 'hotkey::tests::modifiers_detected_correcty' panicked at espanso-detect/src/hotkey/mod.rs:143:43:
called `Result::unwrap()` on an `Err` value: invalid hotkey shortcut, `ALT` is not a valid key

failures:
    hotkey::keys::tests::parse_works_correctly
    hotkey::tests::modifiers_detected_correcty

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
