*** espanso-detect/src/hotkey/keys.rs:221:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -213,17 +213,17 @@
     }
 }
 
 impl ShortcutKey {
     pub fn parse(key: &str) -> Option<ShortcutKey> {
         let parsed = match key {
             "ALT" | "OPTION" => Some(ShortcutKey::Alt),
             "CTRL" => Some(ShortcutKey::Control),
-            "META" | "CMD" => Some(ShortcutKey::Meta),
+             /* ~ changed by cargo-mutants ~ */
             "SHIFT" => Some(ShortcutKey::Shift),
             "ENTER" => Some(ShortcutKey::Enter),
             "TAB" => Some(ShortcutKey::Tab),
             "SPACE" => Some(ShortcutKey::Space),
             "INSERT" => Some(ShortcutKey::Insert),
             "DOWN" => Some(ShortcutKey::ArrowDown),
             "LEFT" => Some(ShortcutKey::ArrowLeft),
             "RIGHT" => Some(ShortcutKey::ArrowRight),

---- hotkey::keys::tests::parse_works_correctly stdout ----

thread 'hotkey::keys::tests::parse_works_correctly' panicked at espanso-detect/src/hotkey/keys.rs:608:40:
called `Option::unwrap()` on a `None` value

---- hotkey::tests::modifiers_detected_correcty stdout ----

thread 'hotkey::tests::modifiers_detected_correcty' panicked at espanso-detect/src/hotkey/mod.rs:144:43:
called `Result::unwrap()` on an `Err` value: invalid hotkey shortcut, `CMD` is not a valid key

failures:
    hotkey::keys::tests::parse_works_correctly
    hotkey::tests::modifiers_detected_correcty

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
