*** espanso-detect/src/hotkey/keys.rs:222:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -214,17 +214,17 @@
 }
 
 impl ShortcutKey {
     pub fn parse(key: &str) -> Option<ShortcutKey> {
         let parsed = match key {
             "ALT" | "OPTION" => Some(ShortcutKey::Alt),
             "CTRL" => Some(ShortcutKey::Control),
             "META" | "CMD" => Some(ShortcutKey::Meta),
-            "SHIFT" => Some(ShortcutKey::Shift),
+             /* ~ changed by cargo-mutants ~ */
             "ENTER" => Some(ShortcutKey::Enter),
             "TAB" => Some(ShortcutKey::Tab),
             "SPACE" => Some(ShortcutKey::Space),
             "INSERT" => Some(ShortcutKey::Insert),
             "DOWN" => Some(ShortcutKey::ArrowDown),
             "LEFT" => Some(ShortcutKey::ArrowLeft),
             "RIGHT" => Some(ShortcutKey::ArrowRight),
             "UP" => Some(ShortcutKey::ArrowUp),

---- hotkey::tests::parse_correctly stdout ----

thread 'hotkey::tests::parse_correctly' panicked at espanso-detect/src/hotkey/mod.rs:130:48:
called `Result::unwrap()` on an `Err` value: invalid hotkey shortcut, `SHIFT` is not a valid key

---- hotkey::tests::modifiers_detected_correcty stdout ----

thread 'hotkey::tests::modifiers_detected_correcty' panicked at espanso-detect/src/hotkey/mod.rs:145:44:
called `Result::unwrap()` on an `Err` value: invalid hotkey shortcut, `SHIFT` is not a valid key

failures:
    hotkey::tests::modifiers_detected_correcty
    hotkey::tests::parse_correctly

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
