*** espanso-detect/src/hotkey/keys.rs:226:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -218,17 +218,17 @@
         let parsed = match key {
             "ALT" | "OPTION" => Some(ShortcutKey::Alt),
             "CTRL" => Some(ShortcutKey::Control),
             "META" | "CMD" => Some(ShortcutKey::Meta),
             "SHIFT" => Some(ShortcutKey::Shift),
             "ENTER" => Some(ShortcutKey::Enter),
             "TAB" => Some(ShortcutKey::Tab),
             "SPACE" => Some(ShortcutKey::Space),
-            "INSERT" => Some(ShortcutKey::Insert),
+             /* ~ changed by cargo-mutants ~ */
             "DOWN" => Some(ShortcutKey::ArrowDown),
             "LEFT" => Some(ShortcutKey::ArrowLeft),
             "RIGHT" => Some(ShortcutKey::ArrowRight),
             "UP" => Some(ShortcutKey::ArrowUp),
             "END" => Some(ShortcutKey::End),
             "HOME" => Some(ShortcutKey::Home),
             "PAGEDOWN" => Some(ShortcutKey::PageDown),
             "PAGEUP" => Some(ShortcutKey::PageUp),

*** result: Success
