*** espanso-detect/src/hotkey/keys.rs:230:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -222,17 +222,17 @@
             "SHIFT" => Some(ShortcutKey::Shift),
             "ENTER" => Some(ShortcutKey::Enter),
             "TAB" => Some(ShortcutKey::Tab),
             "SPACE" => Some(ShortcutKey::Space),
             "INSERT" => Some(ShortcutKey::Insert),
             "DOWN" => Some(ShortcutKey::ArrowDown),
             "LEFT" => Some(ShortcutKey::ArrowLeft),
             "RIGHT" => Some(ShortcutKey::ArrowRight),
-            "UP" => Some(ShortcutKey::ArrowUp),
+             /* ~ changed by cargo-mutants ~ */
             "END" => Some(ShortcutKey::End),
             "HOME" => Some(ShortcutKey::Home),
             "PAGEDOWN" => Some(ShortcutKey::PageDown),
             "PAGEUP" => Some(ShortcutKey::PageUp),
             "F1" => Some(ShortcutKey::F1),
             "F2" => Some(ShortcutKey::F2),
             "F3" => Some(ShortcutKey::F3),
             "F4" => Some(ShortcutKey::F4),

*** result: Success
