*** espanso-detect/src/hotkey/keys.rs:231:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -223,17 +223,17 @@
             "ENTER" => Some(ShortcutKey::Enter),
             "TAB" => Some(ShortcutKey::Tab),
             "SPACE" => Some(ShortcutKey::Space),
             "INSERT" => Some(ShortcutKey::Insert),
             "DOWN" => Some(ShortcutKey::ArrowDown),
             "LEFT" => Some(ShortcutKey::ArrowLeft),
             "RIGHT" => Some(ShortcutKey::ArrowRight),
             "UP" => Some(ShortcutKey::ArrowUp),
-            "END" => Some(ShortcutKey::End),
+             /* ~ changed by cargo-mutants ~ */
             "HOME" => Some(ShortcutKey::Home),
             "PAGEDOWN" => Some(ShortcutKey::PageDown),
             "PAGEUP" => Some(ShortcutKey::PageUp),
             "F1" => Some(ShortcutKey::F1),
             "F2" => Some(ShortcutKey::F2),
             "F3" => Some(ShortcutKey::F3),
             "F4" => Some(ShortcutKey::F4),
             "F5" => Some(ShortcutKey::F5),

*** result: Success
