*** espanso-detect/src/hotkey/keys.rs:237:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -229,17 +229,17 @@
             "RIGHT" => Some(ShortcutKey::ArrowRight),
             "UP" => Some(ShortcutKey::ArrowUp),
             "END" => Some(ShortcutKey::End),
             "HOME" => Some(ShortcutKey::Home),
             "PAGEDOWN" => Some(ShortcutKey::PageDown),
             "PAGEUP" => Some(ShortcutKey::PageUp),
             "F1" => Some(ShortcutKey::F1),
             "F2" => Some(ShortcutKey::F2),
-            "F3" => Some(ShortcutKey::F3),
+             /* ~ changed by cargo-mutants ~ */
             "F4" => Some(ShortcutKey::F4),
             "F5" => Some(ShortcutKey::F5),
             "F6" => Some(ShortcutKey::F6),
             "F7" => Some(ShortcutKey::F7),
             "F8" => Some(ShortcutKey::F8),
             "F9" => Some(ShortcutKey::F9),
             "F10" => Some(ShortcutKey::F10),
             "F11" => Some(ShortcutKey::F11),

*** result: Success
