*** espanso-detect/src/hotkey/keys.rs:241:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -233,17 +233,17 @@
             "PAGEDOWN" => Some(ShortcutKey::PageDown),
             "PAGEUP" => Some(ShortcutKey::PageUp),
             "F1" => Some(ShortcutKey::F1),
             "F2" => Some(ShortcutKey::F2),
             "F3" => Some(ShortcutKey::F3),
             "F4" => Some(ShortcutKey::F4),
             "F5" => Some(ShortcutKey::F5),
             "F6" => Some(ShortcutKey::F6),
-            "F7" => Some(ShortcutKey::F7),
+             /* ~ changed by cargo-mutants ~ */
             "F8" => Some(ShortcutKey::F8),
             "F9" => Some(ShortcutKey::F9),
             "F10" => Some(ShortcutKey::F10),
             "F11" => Some(ShortcutKey::F11),
             "F12" => Some(ShortcutKey::F12),
             "F13" => Some(ShortcutKey::F13),
             "F14" => Some(ShortcutKey::F14),
             "F15" => Some(ShortcutKey::F15),

*** result: Success
