*** espanso-detect/src/hotkey/keys.rs:243:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -235,17 +235,17 @@
             "F1" => Some(ShortcutKey::F1),
             "F2" => Some(ShortcutKey::F2),
             "F3" => Some(ShortcutKey::F3),
             "F4" => Some(ShortcutKey::F4),
             "F5" => Some(ShortcutKey::F5),
             "F6" => Some(ShortcutKey::F6),
             "F7" => Some(ShortcutKey::F7),
             "F8" => Some(ShortcutKey::F8),
-            "F9" => Some(ShortcutKey::F9),
+             /* ~ changed by cargo-mutants ~ */
             "F10" => Some(ShortcutKey::F10),
             "F11" => Some(ShortcutKey::F11),
             "F12" => Some(ShortcutKey::F12),
             "F13" => Some(ShortcutKey::F13),
             "F14" => Some(ShortcutKey::F14),
             "F15" => Some(ShortcutKey::F15),
             "F16" => Some(ShortcutKey::F16),
             "F17" => Some(ShortcutKey::F17),

*** result: Success
