*** espanso-detect/src/hotkey/keys.rs:252:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -244,17 +244,17 @@
             "F10" => Some(ShortcutKey::F10),
             "F11" => Some(ShortcutKey::F11),
             "F12" => Some(ShortcutKey::F12),
             "F13" => Some(ShortcutKey::F13),
             "F14" => Some(ShortcutKey::F14),
             "F15" => Some(ShortcutKey::F15),
             "F16" => Some(ShortcutKey::F16),
             "F17" => Some(ShortcutKey::F17),
-            "F18" => Some(ShortcutKey::F18),
+             /* ~ changed by cargo-mutants ~ */
             "F19" => Some(ShortcutKey::F19),
             "F20" => Some(ShortcutKey::F20),
             "A" => Some(ShortcutKey::A),
             "B" => Some(ShortcutKey::B),
             "C" => Some(ShortcutKey::C),
             "D" => Some(ShortcutKey::D),
             "E" => Some(ShortcutKey::E),
             "F" => Some(ShortcutKey::F),

*** result: Success
