*** espanso-detect/src/hotkey/keys.rs:264:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -256,17 +256,17 @@
             "B" => Some(ShortcutKey::B),
             "C" => Some(ShortcutKey::C),
             "D" => Some(ShortcutKey::D),
             "E" => Some(ShortcutKey::E),
             "F" => Some(ShortcutKey::F),
             "G" => Some(ShortcutKey::G),
             "H" => Some(ShortcutKey::H),
             "I" => Some(ShortcutKey::I),
-            "J" => Some(ShortcutKey::J),
+             /* ~ changed by cargo-mutants ~ */
             "K" => Some(ShortcutKey::K),
             "L" => Some(ShortcutKey::L),
             "M" => Some(ShortcutKey::M),
             "N" => Some(ShortcutKey::N),
             "O" => Some(ShortcutKey::O),
             "P" => Some(ShortcutKey::P),
             "Q" => Some(ShortcutKey::Q),
             "R" => Some(ShortcutKey::R),

*** result: Success
