*** espanso-detect/src/hotkey/keys.rs:265:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -257,17 +257,17 @@
             "C" => Some(ShortcutKey::C),
             "D" => Some(ShortcutKey::D),
             "E" => Some(ShortcutKey::E),
             "F" => Some(ShortcutKey::F),
             "G" => Some(ShortcutKey::G),
             "H" => Some(ShortcutKey::H),
             "I" => Some(ShortcutKey::I),
             "J" => Some(ShortcutKey::J),
-            "K" => Some(ShortcutKey::K),
+             /* ~ changed by cargo-mutants ~ */
             "L" => Some(ShortcutKey::L),
             "M" => Some(ShortcutKey::M),
             "N" => Some(ShortcutKey::N),
             "O" => Some(ShortcutKey::O),
             "P" => Some(ShortcutKey::P),
             "Q" => Some(ShortcutKey::Q),
             "R" => Some(ShortcutKey::R),
             "S" => Some(ShortcutKey::S),

*** result: Success
