*** espanso-detect/src/hotkey/keys.rs:267:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -259,17 +259,17 @@
             "E" => Some(ShortcutKey::E),
             "F" => Some(ShortcutKey::F),
             "G" => Some(ShortcutKey::G),
             "H" => Some(ShortcutKey::H),
             "I" => Some(ShortcutKey::I),
             "J" => Some(ShortcutKey::J),
             "K" => Some(ShortcutKey::K),
             "L" => Some(ShortcutKey::L),
-            "M" => Some(ShortcutKey::M),
+             /* ~ changed by cargo-mutants ~ */
             "N" => Some(ShortcutKey::N),
             "O" => Some(ShortcutKey::O),
             "P" => Some(ShortcutKey::P),
             "Q" => Some(ShortcutKey::Q),
             "R" => Some(ShortcutKey::R),
             "S" => Some(ShortcutKey::S),
             "T" => Some(ShortcutKey::T),
             "U" => Some(ShortcutKey::U),

*** result: Success
