*** espanso-detect/src/hotkey/keys.rs:269:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -261,17 +261,17 @@
             "G" => Some(ShortcutKey::G),
             "H" => Some(ShortcutKey::H),
             "I" => Some(ShortcutKey::I),
             "J" => Some(ShortcutKey::J),
             "K" => Some(ShortcutKey::K),
             "L" => Some(ShortcutKey::L),
             "M" => Some(ShortcutKey::M),
             "N" => Some(ShortcutKey::N),
-            "O" => Some(ShortcutKey::O),
+             /* ~ changed by cargo-mutants ~ */
             "P" => Some(ShortcutKey::P),
             "Q" => Some(ShortcutKey::Q),
             "R" => Some(ShortcutKey::R),
             "S" => Some(ShortcutKey::S),
             "T" => Some(ShortcutKey::T),
             "U" => Some(ShortcutKey::U),
             "V" => Some(ShortcutKey::V),
             "W" => Some(ShortcutKey::W),

*** result: Success
