*** espanso-detect/src/hotkey/keys.rs:270:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -262,17 +262,17 @@
             "H" => Some(ShortcutKey::H),
             "I" => Some(ShortcutKey::I),
             "J" => Some(ShortcutKey::J),
             "K" => Some(ShortcutKey::K),
             "L" => Some(ShortcutKey::L),
             "M" => Some(ShortcutKey::M),
             "N" => Some(ShortcutKey::N),
             "O" => Some(ShortcutKey::O),
-            "P" => Some(ShortcutKey::P),
+             /* ~ changed by cargo-mutants ~ */
             "Q" => Some(ShortcutKey::Q),
             "R" => Some(ShortcutKey::R),
             "S" => Some(ShortcutKey::S),
             "T" => Some(ShortcutKey::T),
             "U" => Some(ShortcutKey::U),
             "V" => Some(ShortcutKey::V),
             "W" => Some(ShortcutKey::W),
             "X" => Some(ShortcutKey::X),

*** result: Success
