*** espanso-detect/src/hotkey/keys.rs:274:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -266,17 +266,17 @@
             "L" => Some(ShortcutKey::L),
             "M" => Some(ShortcutKey::M),
             "N" => Some(ShortcutKey::N),
             "O" => Some(ShortcutKey::O),
             "P" => Some(ShortcutKey::P),
             "Q" => Some(ShortcutKey::Q),
             "R" => Some(ShortcutKey::R),
             "S" => Some(ShortcutKey::S),
-            "T" => Some(ShortcutKey::T),
+             /* ~ changed by cargo-mutants ~ */
             "U" => Some(ShortcutKey::U),
             "V" => Some(ShortcutKey::V),
             "W" => Some(ShortcutKey::W),
             "X" => Some(ShortcutKey::X),
             "Y" => Some(ShortcutKey::Y),
             "Z" => Some(ShortcutKey::Z),
             "0" => Some(ShortcutKey::N0),
             "1" => Some(ShortcutKey::N1),

*** result: Success
