*** espanso-detect/src/hotkey/keys.rs:275:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -267,17 +267,17 @@
             "M" => Some(ShortcutKey::M),
             "N" => Some(ShortcutKey::N),
             "O" => Some(ShortcutKey::O),
             "P" => Some(ShortcutKey::P),
             "Q" => Some(ShortcutKey::Q),
             "R" => Some(ShortcutKey::R),
             "S" => Some(ShortcutKey::S),
             "T" => Some(ShortcutKey::T),
-            "U" => Some(ShortcutKey::U),
+             /* ~ changed by cargo-mutants ~ */
             "V" => Some(ShortcutKey::V),
             "W" => Some(ShortcutKey::W),
             "X" => Some(ShortcutKey::X),
             "Y" => Some(ShortcutKey::Y),
             "Z" => Some(ShortcutKey::Z),
             "0" => Some(ShortcutKey::N0),
             "1" => Some(ShortcutKey::N1),
             "2" => Some(ShortcutKey::N2),

*** result: Success
