*** espanso-detect/src/hotkey/keys.rs:276:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -268,17 +268,17 @@
             "N" => Some(ShortcutKey::N),
             "O" => Some(ShortcutKey::O),
             "P" => Some(ShortcutKey::P),
             "Q" => Some(ShortcutKey::Q),
             "R" => Some(ShortcutKey::R),
             "S" => Some(ShortcutKey::S),
             "T" => Some(ShortcutKey::T),
             "U" => Some(ShortcutKey::U),
-            "V" => Some(ShortcutKey::V),
+             /* ~ changed by cargo-mutants ~ */
             "W" => Some(ShortcutKey::W),
             "X" => Some(ShortcutKey::X),
             "Y" => Some(ShortcutKey::Y),
             "Z" => Some(ShortcutKey::Z),
             "0" => Some(ShortcutKey::N0),
             "1" => Some(ShortcutKey::N1),
             "2" => Some(ShortcutKey::N2),
             "3" => Some(ShortcutKey::N3),

---- hotkey::tests::modifiers_detected_correcty stdout ----

thread 'hotkey::tests::modifiers_detected_correcty' panicked at espanso-detect/src/hotkey/mod.rs:142:42:
called `Result::unwrap()` on an `Err` value: invalid hotkey shortcut, `V` is not a valid key

---- hotkey::tests::parse_correctly stdout ----

thread 'hotkey::tests::parse_correctly' panicked at espanso-detect/src/hotkey/mod.rs:122:38:
called `Result::unwrap()` on an `Err` value: invalid hotkey shortcut, `V` is not a valid key

failures:
    hotkey::tests::modifiers_detected_correcty
    hotkey::tests::parse_correctly

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
