*** espanso-detect/src/hotkey/keys.rs:281:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -273,17 +273,17 @@
             "S" => Some(ShortcutKey::S),
             "T" => Some(ShortcutKey::T),
             "U" => Some(ShortcutKey::U),
             "V" => Some(ShortcutKey::V),
             "W" => Some(ShortcutKey::W),
             "X" => Some(ShortcutKey::X),
             "Y" => Some(ShortcutKey::Y),
             "Z" => Some(ShortcutKey::Z),
-            "0" => Some(ShortcutKey::N0),
+             /* ~ changed by cargo-mutants ~ */
             "1" => Some(ShortcutKey::N1),
             "2" => Some(ShortcutKey::N2),
             "3" => Some(ShortcutKey::N3),
             "4" => Some(ShortcutKey::N4),
             "5" => Some(ShortcutKey::N5),
             "6" => Some(ShortcutKey::N6),
             "7" => Some(ShortcutKey::N7),
             "8" => Some(ShortcutKey::N8),

*** result: Success
