*** espanso-detect/src/hotkey/keys.rs:287:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -279,17 +279,17 @@
             "Y" => Some(ShortcutKey::Y),
             "Z" => Some(ShortcutKey::Z),
             "0" => Some(ShortcutKey::N0),
             "1" => Some(ShortcutKey::N1),
             "2" => Some(ShortcutKey::N2),
             "3" => Some(ShortcutKey::N3),
             "4" => Some(ShortcutKey::N4),
             "5" => Some(ShortcutKey::N5),
-            "6" => Some(ShortcutKey::N6),
+             /* ~ changed by cargo-mutants ~ */
             "7" => Some(ShortcutKey::N7),
             "8" => Some(ShortcutKey::N8),
             "9" => Some(ShortcutKey::N9),
             "NUMPAD0" => Some(ShortcutKey::Numpad0),
             "NUMPAD1" => Some(ShortcutKey::Numpad1),
             "NUMPAD2" => Some(ShortcutKey::Numpad2),
             "NUMPAD3" => Some(ShortcutKey::Numpad3),
             "NUMPAD4" => Some(ShortcutKey::Numpad4),

*** result: Success
