*** espanso-detect/src/hotkey/keys.rs:293:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -285,17 +285,17 @@
             "4" => Some(ShortcutKey::N4),
             "5" => Some(ShortcutKey::N5),
             "6" => Some(ShortcutKey::N6),
             "7" => Some(ShortcutKey::N7),
             "8" => Some(ShortcutKey::N8),
             "9" => Some(ShortcutKey::N9),
             "NUMPAD0" => Some(ShortcutKey::Numpad0),
             "NUMPAD1" => Some(ShortcutKey::Numpad1),
-            "NUMPAD2" => Some(ShortcutKey::Numpad2),
+             /* ~ changed by cargo-mutants ~ */
             "NUMPAD3" => Some(ShortcutKey::Numpad3),
             "NUMPAD4" => Some(ShortcutKey::Numpad4),
             "NUMPAD5" => Some(ShortcutKey::Numpad5),
             "NUMPAD6" => Some(ShortcutKey::Numpad6),
             "NUMPAD7" => Some(ShortcutKey::Numpad7),
             "NUMPAD8" => Some(ShortcutKey::Numpad8),
             "NUMPAD9" => Some(ShortcutKey::Numpad9),
             _ => None,

*** result: Success
