*** espanso-detect/src/hotkey/keys.rs:300:13: delete match arm

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ delete match arm
@@ -292,17 +292,17 @@
             "NUMPAD1" => Some(ShortcutKey::Numpad1),
             "NUMPAD2" => Some(ShortcutKey::Numpad2),
             "NUMPAD3" => Some(ShortcutKey::Numpad3),
             "NUMPAD4" => Some(ShortcutKey::Numpad4),
             "NUMPAD5" => Some(ShortcutKey::Numpad5),
             "NUMPAD6" => Some(ShortcutKey::Numpad6),
             "NUMPAD7" => Some(ShortcutKey::Numpad7),
             "NUMPAD8" => Some(ShortcutKey::Numpad8),
-            "NUMPAD9" => Some(ShortcutKey::Numpad9),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         };
 
         if parsed.is_none() {
             // Attempt to parse raw ShortcutKeys
             if RAW_PARSER.is_match(key) {
                 if let Some(caps) = RAW_PARSER.captures(key) {
                     let code_str = caps.get(1).map_or("", |m| m.as_str());

*** result: Success
