*** espanso-detect/src/hotkey/keys.rs:509:9: replace ShortcutKey::to_code -> Option<u32> with Some(0)

*** mutation diff:
--- espanso-detect/src/hotkey/keys.rs
+++ replace ShortcutKey::to_code -> Option<u32> with Some(0)
@@ -501,101 +501,17 @@
     }
 
     // Linux mappings
     // NOTE: on linux, this method returns the KeySym and not the KeyCode
     //       which should be obtained in other ways depending on the backend.
     //       (X11 or Wayland)
     #[cfg(target_os = "linux")]
     pub fn to_code(&self) -> Option<u32> {
-        match self {
-            ShortcutKey::Alt => Some(0xFFE9),
-            ShortcutKey::Control => Some(0xFFE3),
-            ShortcutKey::Meta => Some(0xFFEB),
-            ShortcutKey::Shift => Some(0xFFE1),
-            ShortcutKey::Enter => Some(0xFF0D),
-            ShortcutKey::Tab => Some(0xFF09),
-            ShortcutKey::Space => Some(0x20),
-            ShortcutKey::ArrowDown => Some(0xFF54),
-            ShortcutKey::ArrowLeft => Some(0xFF51),
-            ShortcutKey::ArrowRight => Some(0xFF53),
-            ShortcutKey::ArrowUp => Some(0xFF52),
-            ShortcutKey::End => Some(0xFF57),
-            ShortcutKey::Home => Some(0xFF50),
-            ShortcutKey::PageDown => Some(0xFF56),
-            ShortcutKey::PageUp => Some(0xFF55),
-            ShortcutKey::Insert => Some(0xff63),
-            ShortcutKey::F1 => Some(0xFFBE),
-            ShortcutKey::F2 => Some(0xFFBF),
-            ShortcutKey::F3 => Some(0xFFC0),
-            ShortcutKey::F4 => Some(0xFFC1),
-            ShortcutKey::F5 => Some(0xFFC2),
-            ShortcutKey::F6 => Some(0xFFC3),
-            ShortcutKey::F7 => Some(0xFFC4),
-            ShortcutKey::F8 => Some(0xFFC5),
-            ShortcutKey::F9 => Some(0xFFC6),
-            ShortcutKey::F10 => Some(0xFFC7),
-            ShortcutKey::F11 => Some(0xFFC8),
-            ShortcutKey::F12 => Some(0xFFC9),
-            ShortcutKey::F13 => Some(0xFFCA),
-            ShortcutKey::F14 => Some(0xFFCB),
-            ShortcutKey::F15 => Some(0xFFCC),
-            ShortcutKey::F16 => Some(0xFFCD),
-            ShortcutKey::F17 => Some(0xFFCE),
-            ShortcutKey::F18 => Some(0xFFCF),
-            ShortcutKey::F19 => Some(0xFFD0),
-            ShortcutKey::F20 => Some(0xFFD1),
-            ShortcutKey::A => Some(0x0061),
-            ShortcutKey::B => Some(0x0062),
-            ShortcutKey::C => Some(0x0063),
-            ShortcutKey::D => Some(0x0064),
-            ShortcutKey::E => Some(0x0065),
-            ShortcutKey::F => Some(0x0066),
-            ShortcutKey::G => Some(0x0067),
-            ShortcutKey::H => Some(0x0068),
-            ShortcutKey::I => Some(0x0069),
-            ShortcutKey::J => Some(0x006a),
-            ShortcutKey::K => Some(0x006b),
-            ShortcutKey::L => Some(0x006c),
-            ShortcutKey::M => Some(0x006d),
-            ShortcutKey::N => Some(0x006e),
-            ShortcutKey::O => Some(0x006f),
-            ShortcutKey::P => Some(0x0070),
-            ShortcutKey::Q => Some(0x0071),
-            ShortcutKey::R => Some(0x0072),
-            ShortcutKey::S => Some(0x0073),
-            ShortcutKey::T => Some(0x0074),
-            ShortcutKey::U => Some(0x0075),
-            ShortcutKey::V => Some(0x0076),
-            ShortcutKey::W => Some(0x0077),
-            ShortcutKey::X => Some(0x0078),
-            ShortcutKey::Y => Some(0x0079),
-            ShortcutKey::Z => Some(0x007a),
-            ShortcutKey::N0 => Some(0x0030),
-            ShortcutKey::N1 => Some(0x0031),
-            ShortcutKey::N2 => Some(0x0032),
-            ShortcutKey::N3 => Some(0x0033),
-            ShortcutKey::N4 => Some(0x0034),
-            ShortcutKey::N5 => Some(0x0035),
-            ShortcutKey::N6 => Some(0x0036),
-            ShortcutKey::N7 => Some(0x0037),
-            ShortcutKey::N8 => Some(0x0038),
-            ShortcutKey::N9 => Some(0x0039),
-            ShortcutKey::Numpad0 => Some(0xffb0),
-            ShortcutKey::Numpad1 => Some(0xffb1),
-            ShortcutKey::Numpad2 => Some(0xffb2),
-            ShortcutKey::Numpad3 => Some(0xffb3),
-            ShortcutKey::Numpad4 => Some(0xffb4),
-            ShortcutKey::Numpad5 => Some(0xffb5),
-            ShortcutKey::Numpad6 => Some(0xffb6),
-            ShortcutKey::Numpad7 => Some(0xffb7),
-            ShortcutKey::Numpad8 => Some(0xffb8),
-            ShortcutKey::Numpad9 => Some(0xffb9),
-            ShortcutKey::Raw(code) => Some(*code),
-        }
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

*** result: Success
