*** espanso-detect/src/hotkey/mod.rs:78:9: replace HotKey::has_ctrl -> bool with true

*** mutation diff:
--- espanso-detect/src/hotkey/mod.rs
+++ replace HotKey::has_ctrl -> bool with true
@@ -70,17 +70,17 @@
             id,
             modifiers,
             key: main_key.unwrap(),
         })
     }
 
     #[allow(dead_code)]
     pub(crate) fn has_ctrl(&self) -> bool {
-        self.modifiers.contains(&ShortcutKey::Control)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(dead_code)]
     pub(crate) fn has_meta(&self) -> bool {
         self.modifiers.contains(&ShortcutKey::Meta)
     }
 
     #[allow(dead_code)]

---- hotkey::tests::modifiers_detected_correcty stdout ----

thread 'hotkey::tests::modifiers_detected_correcty' panicked at espanso-detect/src/hotkey/mod.rs:147:9:
assertion failed: !HotKey::new(1, "SHIFT+ V").unwrap().has_ctrl()

failures:
    hotkey::tests::modifiers_detected_correcty

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
