*** espanso-detect/src/hotkey/mod.rs:83:9: replace HotKey::has_meta -> bool with true

*** mutation diff:
--- espanso-detect/src/hotkey/mod.rs
+++ replace HotKey::has_meta -> bool with true
@@ -75,17 +75,17 @@
 
     #[allow(dead_code)]
     pub(crate) fn has_ctrl(&self) -> bool {
         self.modifiers.contains(&ShortcutKey::Control)
     }
 
     #[allow(dead_code)]
     pub(crate) fn has_meta(&self) -> bool {
-        self.modifiers.contains(&ShortcutKey::Meta)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(dead_code)]
     pub(crate) fn has_alt(&self) -> bool {
         self.modifiers.contains(&ShortcutKey::Alt)
     }
 
     #[allow(dead_code)]

---- hotkey::tests::modifiers_detected_correcty stdout ----

thread 'hotkey::tests::modifiers_detected_correcty' panicked at espanso-detect/src/hotkey/mod.rs:149:9:
assertion failed: !HotKey::new(1, "SHIFT+ V").unwrap().has_meta()

failures:
    hotkey::tests::modifiers_detected_correcty

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
