*** espanso-detect/src/hotkey/mod.rs:88:9: replace HotKey::has_alt -> bool with true

*** mutation diff:
--- espanso-detect/src/hotkey/mod.rs
+++ replace HotKey::has_alt -> bool with true
@@ -80,17 +80,17 @@
 
     #[allow(dead_code)]
     pub(crate) fn has_meta(&self) -> bool {
         self.modifiers.contains(&ShortcutKey::Meta)
     }
 
     #[allow(dead_code)]
     pub(crate) fn has_alt(&self) -> bool {
-        self.modifiers.contains(&ShortcutKey::Alt)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(dead_code)]
     pub(crate) fn has_shift(&self) -> bool {
         self.modifiers.contains(&ShortcutKey::Shift)
     }
 }

---- hotkey::tests::modifiers_detected_correcty stdout ----

thread 'hotkey::tests::modifiers_detected_correcty' panicked at espanso-detect/src/hotkey/mod.rs:148:9:
assertion failed: !HotKey::new(1, "SHIFT+ V").unwrap().has_alt()

failures:
    hotkey::tests::modifiers_detected_correcty

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
