*** espanso-detect/src/hotkey/mod.rs:93:9: replace HotKey::has_shift -> bool with false

*** mutation diff:
--- espanso-detect/src/hotkey/mod.rs
+++ replace HotKey::has_shift -> bool with false
@@ -85,17 +85,17 @@
 
     #[allow(dead_code)]
     pub(crate) fn has_alt(&self) -> bool {
         self.modifiers.contains(&ShortcutKey::Alt)
     }
 
     #[allow(dead_code)]
     pub(crate) fn has_shift(&self) -> bool {
-        self.modifiers.contains(&ShortcutKey::Shift)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Display for HotKey {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         let str_modifiers: Vec<String> = self.modifiers.iter().map(ToString::to_string).collect();
         let modifiers = str_modifiers.join("+");
         write!(f, "{}+{}", &modifiers, &self.key)

---- hotkey::tests::modifiers_detected_correcty stdout ----

thread 'hotkey::tests::modifiers_detected_correcty' panicked at espanso-detect/src/hotkey/mod.rs:145:9:
assertion failed: HotKey::new(1, "SHIFT+ V").unwrap().has_shift()

failures:
    hotkey::tests::modifiers_detected_correcty

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
