*** espanso-detect/src/layout/mod.rs:35:5: replace get_active_layout -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- espanso-detect/src/layout/mod.rs
+++ replace get_active_layout -> Option<String> with Some("xyzzy".into())
@@ -27,17 +27,17 @@
 
 #[cfg(target_os = "linux")]
 #[cfg(feature = "wayland")]
 mod wayland;
 
 #[cfg(target_os = "linux")]
 #[cfg(not(feature = "wayland"))]
 pub fn get_active_layout() -> Option<String> {
-    x11::get_active_layout()
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "linux")]
 #[cfg(feature = "wayland")]
 pub fn get_active_layout() -> Option<String> {
     if gnome::is_gnome() {
         gnome::get_active_layout()
     } else {

*** result: Success
