*** espanso-detect/src/layout/mod.rs:56:5: replace get_active_layout -> Option<String> with Some(String::new())

*** mutation diff:
--- espanso-detect/src/layout/mod.rs
+++ replace get_active_layout -> Option<String> with Some(String::new())
@@ -48,10 +48,10 @@
         );
         None
     }
 }
 
 #[cfg(not(target_os = "linux"))]
 pub fn get_active_layout() -> Option<String> {
     // Not available on Windows and macOS yet
-    None
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
