*** espanso-detect/src/layout/wayland.rs:14:5: replace get_compositor_pid -> i32 with 0

*** mutation diff:
--- espanso-detect/src/layout/wayland.rs
+++ replace get_compositor_pid -> i32 with 0
@@ -6,21 +6,17 @@
 use wayland_client::Proxy;
 
 fn pid_from_wayland_display_fd(fd: BorrowedFd) -> i32 {
     let soc_peer_process = socket::getsockopt(&fd, socket::sockopt::PeerCredentials).unwrap();
     soc_peer_process.pid()
 }
 
 fn get_compositor_pid() -> i32 {
-    let wl_conn = Connection::connect_to_env().unwrap();
-    let wl_display = wl_conn.display();
-    let wl_display_backend = wl_display.backend().upgrade().unwrap();
-
-    pid_from_wayland_display_fd(wl_display_backend.poll_fd())
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn process_name_from_pid(pid: i32) -> String {
     let path = format!("/proc/{pid}/comm");
     let mut file = File::open(path).unwrap();
     let mut buf = String::new();
     file.read_to_string(&mut buf).unwrap();
     buf

*** result: Success
