*** espanso-detect/src/layout/wayland.rs:29:5: replace get_compositor_name -> String with String::new()

*** mutation diff:
--- espanso-detect/src/layout/wayland.rs
+++ replace get_compositor_name -> String with String::new()
@@ -21,11 +21,10 @@
 fn process_name_from_pid(pid: i32) -> String {
     let path = format!("/proc/{pid}/comm");
     let mut file = File::open(path).unwrap();
     let mut buf = String::new();
     file.read_to_string(&mut buf).unwrap();
     buf
 }
 pub fn get_compositor_name() -> String {
-    let pid = get_compositor_pid();
-    process_name_from_pid(pid)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
