*** espanso-detect/src/layout/x11.rs:25:5: replace get_active_layout -> Option<String> with None

*** mutation diff:
--- espanso-detect/src/layout/x11.rs
+++ replace get_active_layout -> Option<String> with None
@@ -17,24 +17,10 @@
  * along with espanso.  If not, see <https://www.gnu.org/licenses/>.
  */
 
 use std::process::Command;
 
 use log::error;
 
 pub fn get_active_layout() -> Option<String> {
-    match Command::new("setxkbmap").arg("-query").output() {
-        Ok(output) => {
-            let output_str = String::from_utf8_lossy(&output.stdout);
-            let layout_line = output_str.lines().find(|line| line.contains("layout:"))?;
-            let layout_raw: Vec<&str> = layout_line.split("layout:").collect();
-            Some(layout_raw.get(1)?.trim().to_string())
-        }
-        Err(err) => {
-            error!(
-                "unable to retrieve current keyboard layout with 'setxkbmap': {}",
-                err
-            );
-            None
-        }
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
