*** espanso-detect/src/lib.rs:100:5: replace get_source -> Result<Box<dyn Source>> with Ok(Box::new(Default::default()))

*** mutation diff:
--- espanso-detect/src/lib.rs
+++ replace get_source -> Result<Box<dyn Source>> with Ok(Box::new(Default::default()))
@@ -92,22 +92,17 @@
             win32_exclude_orphan_events: true,
             win32_keyboard_layout_cache_interval: 2000,
         }
     }
 }
 
 #[cfg(target_os = "windows")]
 pub fn get_source(options: SourceCreationOptions) -> Result<Box<dyn Source>> {
-    info!("using Win32Source");
-    Ok(Box::new(win32::Win32Source::new(
-        &options.hotkeys,
-        options.win32_exclude_orphan_events,
-        options.win32_keyboard_layout_cache_interval,
-    )))
+    Ok(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "macos")]
 pub fn get_source(options: SourceCreationOptions) -> Result<Box<dyn Source>> {
     info!("using CocoaSource");
     Ok(Box::new(mac::CocoaSource::new(&options.hotkeys)))
 }

*** result: Success
