*** espanso-detect/src/lib.rs:117:5: replace get_source -> Result<Box<dyn Source>> with Ok(Box::new(Default::default()))

*** mutation diff:
--- espanso-detect/src/lib.rs
+++ replace get_source -> Result<Box<dyn Source>> with Ok(Box::new(Default::default()))
@@ -109,23 +109,17 @@
 pub fn get_source(options: SourceCreationOptions) -> Result<Box<dyn Source>> {
     info!("using CocoaSource");
     Ok(Box::new(mac::CocoaSource::new(&options.hotkeys)))
 }
 
 #[cfg(target_os = "linux")]
 #[cfg(not(feature = "wayland"))]
 pub fn get_source(options: SourceCreationOptions) -> Result<Box<dyn Source>> {
-    if options.use_evdev {
-        info!("using EVDEVSource");
-        Ok(Box::new(evdev::EVDEVSource::new(options)))
-    } else {
-        info!("using X11Source");
-        Ok(Box::new(x11::X11Source::new(&options.hotkeys)))
-    }
+    Ok(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "linux")]
 #[cfg(feature = "wayland")]
 pub fn get_source(options: SourceCreationOptions) -> Result<Box<dyn Source>> {
     info!("using EVDEVSource");
     Ok(Box::new(evdev::EVDEVSource::new(options)))
 }

*** result: Success
