*** espanso-detect/src/mac/mod.rs:144:65: replace == with != in native_callback

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ replace == with != in native_callback
@@ -136,17 +136,17 @@
     let mut compensating_events = Vec::new();
     if raw_event.event_type == INPUT_EVENT_TYPE_KEYBOARD {
         let (key_code, _) = key_code_to_key(raw_event.key_code);
         let mut current_mod_state = MODIFIER_STATE
             .lock()
             .expect("unable to acquire modifier state in cocoa detector");
 
         if let Key::Alt = &key_code {
-            current_mod_state.is_option_down = raw_event.status == INPUT_STATUS_PRESSED;
+            current_mod_state.is_option_down = raw_event.status != /* ~ changed by cargo-mutants ~ */ INPUT_STATUS_PRESSED;
         } else if let Key::Meta = &key_code {
             current_mod_state.is_command_down = raw_event.status == INPUT_STATUS_PRESSED;
         } else if let Key::Shift = &key_code {
             current_mod_state.is_shift_down = raw_event.status == INPUT_STATUS_PRESSED;
         } else if let Key::Control = &key_code {
             current_mod_state.is_ctrl_down = raw_event.status == INPUT_STATUS_PRESSED;
         } else {
             if current_mod_state.is_command_down && raw_event.is_command_pressed == 0 {

*** result: Success
