*** espanso-detect/src/mac/mod.rs:164:80: replace == with != in native_callback

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ replace == with != in native_callback
@@ -156,17 +156,17 @@
             if current_mod_state.is_ctrl_down && raw_event.is_control_pressed == 0 {
                 compensating_events.push((Key::Control, 0x3B));
                 current_mod_state.is_ctrl_down = false;
             }
             if current_mod_state.is_shift_down && raw_event.is_shift_pressed == 0 {
                 compensating_events.push((Key::Shift, 0x38));
                 current_mod_state.is_shift_down = false;
             }
-            if current_mod_state.is_option_down && raw_event.is_option_pressed == 0 {
+            if current_mod_state.is_option_down && raw_event.is_option_pressed != /* ~ changed by cargo-mutants ~ */ 0 {
                 compensating_events.push((Key::Alt, 0x3A));
                 current_mod_state.is_option_down = false;
             }
         }
     }
 
     if !compensating_events.is_empty() {
         warn!(

*** result: Success
