*** espanso-detect/src/mac/mod.rs:171:8: delete ! in native_callback

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ delete ! in native_callback
@@ -163,17 +163,17 @@
             }
             if current_mod_state.is_option_down && raw_event.is_option_pressed == 0 {
                 compensating_events.push((Key::Alt, 0x3A));
                 current_mod_state.is_option_down = false;
             }
         }
     }
 
-    if !compensating_events.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */compensating_events.is_empty() {
         warn!(
             "detected inconsistent modifier state for keys {:?}, sending compensating events...",
             compensating_events
         );
     }
 
     if let Some(sender) = lock.as_ref() {
         for (key, code) in compensating_events {

*** result: Success
