*** espanso-detect/src/mac/mod.rs:301:19: replace |= with ^= in convert_hotkey_to_raw

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ replace |= with ^= in convert_hotkey_to_raw
@@ -293,17 +293,17 @@
 }
 
 fn convert_hotkey_to_raw(hk: &HotKey) -> Option<RawHotKey> {
     let key_code = hk.key.to_code()?;
     let code: Result<u16, _> = key_code.try_into();
     if let Ok(code) = code {
         let mut flags = 0;
         if hk.has_ctrl() {
-            flags |= 1 << 12;
+            flags ^= /* ~ changed by cargo-mutants ~ */ 1 << 12;
         }
         if hk.has_alt() {
             flags |= 1 << 11;
         }
         if hk.has_meta() {
             flags |= 1 << 8;
         }
         if hk.has_shift() {

*** result: Success
