*** espanso-detect/src/mac/mod.rs:310:19: replace |= with ^= in convert_hotkey_to_raw

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ replace |= with ^= in convert_hotkey_to_raw
@@ -302,17 +302,17 @@
         }
         if hk.has_alt() {
             flags |= 1 << 11;
         }
         if hk.has_meta() {
             flags |= 1 << 8;
         }
         if hk.has_shift() {
-            flags |= 1 << 9;
+            flags ^= /* ~ changed by cargo-mutants ~ */ 1 << 9;
         }
 
         Some(RawHotKey {
             id: hk.id,
             code,
             flags,
         })
     } else {

*** result: Success
