*** espanso-detect/src/mac/mod.rs:333:13: delete match arm

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ delete match arm
@@ -325,17 +325,17 @@
 pub enum CocoaSourceError {
     #[error("unknown error")]
     Unknown(),
 }
 
 impl From<RawInputEvent> for Option<InputEvent> {
     fn from(raw: RawInputEvent) -> Option<InputEvent> {
         let status = match raw.status {
-            INPUT_STATUS_RELEASED => Released,
+             /* ~ changed by cargo-mutants ~ */
             INPUT_STATUS_PRESSED => Pressed,
             _ => Pressed,
         };
 
         match raw.event_type {
             // Keyboard events
             INPUT_EVENT_TYPE_KEYBOARD => {
                 let (key, variant) = key_code_to_key(raw.key_code);

---- mac::tests::raw_to_input_event_mouse_works_correctly stdout ----

thread 'mac::tests::raw_to_input_event_mouse_works_correctly' panicked at espanso-detect/src/mac/mod.rs:541:9:
assertion `left == right` failed
  left: Mouse(MouseEvent { button: Right, status: Pressed })
 right: Mouse(MouseEvent { button: Right, status: Released })

---- mac::tests::raw_to_input_event_keyboard_works_correctly stdout ----

thread 'mac::tests::raw_to_input_event_keyboard_works_correctly' panicked at espanso-detect/src/mac/mod.rs:521:9:
assertion `left == right` failed
  left: Keyboard(KeyboardEvent { key: Other(40), value: Some("k"), status: Pressed, variant: None, code: 40 })
 right: Keyboard(KeyboardEvent { key: Other(40), value: Some("k"), status: Released, variant: None, code: 40 })

failures:
    mac::tests::raw_to_input_event_keyboard_works_correctly
    mac::tests::raw_to_input_event_mouse_works_correctly

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
