*** espanso-detect/src/mac/mod.rs:350:47: replace > with == in <impl From<RawInputEvent> for Option<InputEvent>>::from

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ replace > with == in <impl From<RawInputEvent> for Option<InputEvent>>::from
@@ -342,17 +342,17 @@
 
                 // When a global keyboard shortcut is relased, the callback returns an event with keycode 0
                 // and status 0.
                 // We need to handle it for this reason: https://github.com/espanso/espanso/issues/791
                 if raw.key_code == 0 && raw.status == 0 {
                     return Some(InputEvent::AllModifiersReleased);
                 }
 
-                let value = if raw.buffer_len > 0 {
+                let value = if raw.buffer_len == /* ~ changed by cargo-mutants ~ */ 0 {
                     let raw_string_result =
                         CStr::from_bytes_with_nul(&raw.buffer[..((raw.buffer_len + 1) as usize)]);
                     match raw_string_result {
                         Ok(c_string) => {
                             let string_result = c_string.to_str();
                             match string_result {
                                 Ok(value) => Some(value.to_string()),
                                 Err(err) => {

---- mac::tests::raw_to_input_event_keyboard_works_correctly stdout ----

thread 'mac::tests::raw_to_input_event_keyboard_works_correctly' panicked at espanso-detect/src/mac/mod.rs:521:9:
assertion `left == right` failed
  left: Keyboard(KeyboardEvent { key: Other(40), value: None, status: Released, variant: None, code: 40 })
 right: Keyboard(KeyboardEvent { key: Other(40), value: Some("k"), status: Released, variant: None, code: 40 })

failures:
    mac::tests::raw_to_input_event_keyboard_works_correctly

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
