*** espanso-detect/src/mac/mod.rs:409:9: delete match arm

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ delete match arm
@@ -401,17 +401,17 @@
     }
 }
 
 // Mappings from: https://developer.mozilla.org/en-US/docs/Web/API/KeyboardEvent/key/Key_Values
 fn key_code_to_key(key_code: i32) -> (Key, Option<Variant>) {
     match key_code {
         // Modifiers
         0x3A => (Alt, Some(Left)),
-        0x3D => (Alt, Some(Right)),
+         /* ~ changed by cargo-mutants ~ */
         0x39 => (CapsLock, None), // TODO
         0x3B => (Control, Some(Left)),
         0x3E => (Control, Some(Right)),
         0x37 => (Meta, Some(Left)),
         0x36 => (Meta, Some(Right)),
         0x38 => (Shift, Some(Left)),
         0x3C => (Shift, Some(Right)),

*** result: Success
