*** espanso-detect/src/mac/mod.rs:413:9: delete match arm

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ delete match arm
@@ -405,17 +405,17 @@
 fn key_code_to_key(key_code: i32) -> (Key, Option<Variant>) {
     match key_code {
         // Modifiers
         0x3A => (Alt, Some(Left)),
         0x3D => (Alt, Some(Right)),
         0x39 => (CapsLock, None), // TODO
         0x3B => (Control, Some(Left)),
         0x3E => (Control, Some(Right)),
-        0x37 => (Meta, Some(Left)),
+         /* ~ changed by cargo-mutants ~ */
         0x36 => (Meta, Some(Right)),
         0x38 => (Shift, Some(Left)),
         0x3C => (Shift, Some(Right)),
 
         // Whitespace
         0x24 => (Enter, None),
         0x30 => (Tab, None),
         0x31 => (Space, None),

*** result: Success
