*** espanso-detect/src/mac/mod.rs:416:9: delete match arm

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ delete match arm
@@ -408,17 +408,17 @@
         0x3A => (Alt, Some(Left)),
         0x3D => (Alt, Some(Right)),
         0x39 => (CapsLock, None), // TODO
         0x3B => (Control, Some(Left)),
         0x3E => (Control, Some(Right)),
         0x37 => (Meta, Some(Left)),
         0x36 => (Meta, Some(Right)),
         0x38 => (Shift, Some(Left)),
-        0x3C => (Shift, Some(Right)),
+         /* ~ changed by cargo-mutants ~ */
 
         // Whitespace
         0x24 => (Enter, None),
         0x30 => (Tab, None),
         0x31 => (Space, None),
 
         // Navigation
         0x7D => (ArrowDown, None),

*** result: Success
