*** espanso-detect/src/mac/mod.rs:424:9: delete match arm

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ delete match arm
@@ -416,17 +416,17 @@
         0x3C => (Shift, Some(Right)),
 
         // Whitespace
         0x24 => (Enter, None),
         0x30 => (Tab, None),
         0x31 => (Space, None),
 
         // Navigation
-        0x7D => (ArrowDown, None),
+         /* ~ changed by cargo-mutants ~ */
         0x7B => (ArrowLeft, None),
         0x7C => (ArrowRight, None),
         0x7E => (ArrowUp, None),
         0x77 => (End, None),
         0x73 => (Home, None),
         0x79 => (PageDown, None),
         0x74 => (PageUp, None),

*** result: Success
