*** espanso-detect/src/mac/mod.rs:437:9: delete match arm

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ delete match arm
@@ -429,17 +429,17 @@
         0x73 => (Home, None),
         0x79 => (PageDown, None),
         0x74 => (PageUp, None),
 
         // UI
         0x35 => (Escape, None),
 
         // Editing keys
-        0x33 => (Backspace, None),
+         /* ~ changed by cargo-mutants ~ */
 
         // Function keys
         0x7A => (F1, None),
         0x78 => (F2, None),
         0x63 => (F3, None),
         0x76 => (F4, None),
         0x60 => (F5, None),
         0x61 => (F6, None),

*** result: Success
