*** espanso-detect/src/mac/mod.rs:453:9: delete match arm

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ delete match arm
@@ -445,17 +445,17 @@
         0x61 => (F6, None),
         0x62 => (F7, None),
         0x64 => (F8, None),
         0x65 => (F9, None),
         0x6D => (F10, None),
         0x67 => (F11, None),
         0x6F => (F12, None),
         0x69 => (F13, None),
-        0x6B => (F14, None),
+         /* ~ changed by cargo-mutants ~ */
         0x71 => (F15, None),
         0x6A => (F16, None),
         0x40 => (F17, None),
         0x4F => (F18, None),
         0x50 => (F19, None),
         0x5A => (F20, None),
 
         // Numpad

*** result: Success
