*** espanso-detect/src/mac/mod.rs:459:9: delete match arm

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ delete match arm
@@ -451,17 +451,17 @@
         0x6F => (F12, None),
         0x69 => (F13, None),
         0x6B => (F14, None),
         0x71 => (F15, None),
         0x6A => (F16, None),
         0x40 => (F17, None),
         0x4F => (F18, None),
         0x50 => (F19, None),
-        0x5A => (F20, None),
+         /* ~ changed by cargo-mutants ~ */
 
         // Numpad
         0x52 => (Numpad0, None),
         0x53 => (Numpad1, None),
         0x54 => (Numpad2, None),
         0x55 => (Numpad3, None),
         0x56 => (Numpad4, None),
         0x57 => (Numpad5, None),

*** result: Success
