*** espanso-detect/src/mac/mod.rs:463:9: delete match arm

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ delete match arm
@@ -455,17 +455,17 @@
         0x6A => (F16, None),
         0x40 => (F17, None),
         0x4F => (F18, None),
         0x50 => (F19, None),
         0x5A => (F20, None),
 
         // Numpad
         0x52 => (Numpad0, None),
-        0x53 => (Numpad1, None),
+         /* ~ changed by cargo-mutants ~ */
         0x54 => (Numpad2, None),
         0x55 => (Numpad3, None),
         0x56 => (Numpad4, None),
         0x57 => (Numpad5, None),
         0x58 => (Numpad6, None),
         0x59 => (Numpad7, None),
         0x5B => (Numpad8, None),
         0x5C => (Numpad9, None),

*** result: Success
