*** espanso-detect/src/mac/mod.rs:468:9: delete match arm

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ delete match arm
@@ -460,17 +460,17 @@
 
         // Numpad
         0x52 => (Numpad0, None),
         0x53 => (Numpad1, None),
         0x54 => (Numpad2, None),
         0x55 => (Numpad3, None),
         0x56 => (Numpad4, None),
         0x57 => (Numpad5, None),
-        0x58 => (Numpad6, None),
+         /* ~ changed by cargo-mutants ~ */
         0x59 => (Numpad7, None),
         0x5B => (Numpad8, None),
         0x5C => (Numpad9, None),
 
         // Other keys, includes the raw code provided by the operating system
         _ => (Other(key_code), None),
     }
 }

*** result: Success
