*** espanso-detect/src/mac/mod.rs:479:5: replace raw_to_mouse_button -> Option<MouseButton> with None

*** mutation diff:
--- espanso-detect/src/mac/mod.rs
+++ replace raw_to_mouse_button -> Option<MouseButton> with None
@@ -471,22 +471,17 @@
         0x5C => (Numpad9, None),
 
         // Other keys, includes the raw code provided by the operating system
         _ => (Other(key_code), None),
     }
 }
 
 fn raw_to_mouse_button(raw: i32) -> Option<MouseButton> {
-    match raw {
-        INPUT_MOUSE_LEFT_BUTTON => Some(MouseButton::Left),
-        INPUT_MOUSE_RIGHT_BUTTON => Some(MouseButton::Right),
-        INPUT_MOUSE_MIDDLE_BUTTON => Some(MouseButton::Middle),
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use std::ffi::CString;
 
     use super::*;

---- mac::tests::raw_to_input_event_mouse_works_correctly stdout ----

thread 'mac::tests::raw_to_input_event_mouse_works_correctly' panicked at espanso-detect/src/mac/mod.rs:537:20:
called `Option::unwrap()` on a `None` value

failures:
    mac::tests::raw_to_input_event_mouse_works_correctly

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
