*** espanso-detect/src/win32/mod.rs:239:19: replace != with == in <impl Drop for Win32Source>::drop

*** mutation diff:
--- espanso-detect/src/win32/mod.rs
+++ replace != with == in <impl Drop for Win32Source>::drop
@@ -231,17 +231,17 @@
     fn drop(&mut self) {
         if self.handle.is_null() {
             error!("Win32Source destruction cannot be performed, handle is null");
             return;
         }
 
         let result = unsafe { detect_destroy(self.handle) };
 
-        if result != 0 {
+        if result == /* ~ changed by cargo-mutants ~ */ 0 {
             error!("Win32Source destruction returned non-zero code");
         }
     }
 }
 
 fn convert_hotkey_to_raw(hk: &HotKey) -> Option<RawHotKey> {
     let key_code = hk.key.to_code()?;
     let mut flags = 0x4000; // NOREPEAT flags

*** result: Success
