*** espanso-detect/src/win32/mod.rs:296:21: delete match arm

*** mutation diff:
--- espanso-detect/src/win32/mod.rs
+++ delete match arm
@@ -288,17 +288,17 @@
         match raw.event_type {
             // Keyboard events
             INPUT_EVENT_TYPE_KEYBOARD => {
                 let (key, variant_hint) = key_code_to_key(raw.key_code);
 
                 // If the raw event does not include an explicit variant, use the hint provided by the key code
                 let variant = match raw.variant {
                     INPUT_LEFT_VARIANT => Some(Left),
-                    INPUT_RIGHT_VARIANT => Some(Right),
+                     /* ~ changed by cargo-mutants ~ */
                     _ => variant_hint,
                 };
 
                 let value = if raw.buffer_len > 0 {
                     let raw_string_result = U16CStr::from_slice_with_nul(&raw.buffer);
                     match raw_string_result {
                         Ok(c_string) => {
                             let string_result = c_string.to_string();

*** result: Success
