*** espanso-detect/src/win32/mod.rs:342:13: delete match arm

*** mutation diff:
--- espanso-detect/src/win32/mod.rs
+++ delete match arm
@@ -334,21 +334,17 @@
             INPUT_EVENT_TYPE_MOUSE => {
                 let button = raw_to_mouse_button(raw.key_code);
 
                 if let Some(button) = button {
                     return Some(InputEvent::Mouse(MouseEvent { button, status }));
                 }
             }
             // Hotkey events
-            INPUT_EVENT_TYPE_HOTKEY => {
-                return Some(InputEvent::HotKey(HotKeyEvent {
-                    hotkey_id: raw.key_code,
-                }))
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {}
         }
 
         None
     }
 }
 
 // Mappings from: https://developer.mozilla.org/en-US/docs/Web/API/KeyboardEvent/key/Key_Values

*** result: Success
