*** espanso-detect/src/win32/mod.rs:356:5: replace key_code_to_key -> (Key, Option<Variant>) with (Default::default(), None)

*** mutation diff:
--- espanso-detect/src/win32/mod.rs
+++ replace key_code_to_key -> (Key, Option<Variant>) with (Default::default(), None)
@@ -348,90 +348,17 @@
         }
 
         None
     }
 }
 
 // Mappings from: https://developer.mozilla.org/en-US/docs/Web/API/KeyboardEvent/key/Key_Values
 fn key_code_to_key(key_code: i32) -> (Key, Option<Variant>) {
-    match key_code {
-        // Modifiers
-        0x12 => (Alt, None),
-        0xA4 => (Alt, Some(Left)),
-        0xA5 => (Alt, Some(Right)),
-        0x14 => (CapsLock, None),
-        0x11 => (Control, None),
-        0xA2 => (Control, Some(Left)),
-        0xA3 => (Control, Some(Right)),
-        0x5B => (Meta, Some(Left)),
-        0x5C => (Meta, Some(Right)),
-        0x90 => (NumLock, None),
-        0x10 => (Shift, None),
-        0xA0 => (Shift, Some(Left)),
-        0xA1 => (Shift, Some(Right)),
-
-        // Whitespace
-        0x0D => (Enter, None),
-        0x09 => (Tab, None),
-        0x20 => (Space, None),
-
-        // Navigation
-        0x28 => (ArrowDown, None),
-        0x25 => (ArrowLeft, None),
-        0x27 => (ArrowRight, None),
-        0x26 => (ArrowUp, None),
-        0x23 => (End, None),
-        0x24 => (Home, None),
-        0x22 => (PageDown, None),
-        0x21 => (PageUp, None),
-
-        // UI
-        0x1B => (Escape, None),
-
-        // Editing keys
-        0x08 => (Backspace, None),
-
-        // Function keys
-        0x70 => (F1, None),
-        0x71 => (F2, None),
-        0x72 => (F3, None),
-        0x73 => (F4, None),
-        0x74 => (F5, None),
-        0x75 => (F6, None),
-        0x76 => (F7, None),
-        0x77 => (F8, None),
-        0x78 => (F9, None),
-        0x79 => (F10, None),
-        0x7A => (F11, None),
-        0x7B => (F12, None),
-        0x7C => (F13, None),
-        0x7D => (F14, None),
-        0x7E => (F15, None),
-        0x7F => (F16, None),
-        0x80 => (F17, None),
-        0x81 => (F18, None),
-        0x82 => (F19, None),
-        0x83 => (F20, None),
-
-        // Numpad
-        0x60 => (Numpad0, None),
-        0x61 => (Numpad1, None),
-        0x62 => (Numpad2, None),
-        0x63 => (Numpad3, None),
-        0x64 => (Numpad4, None),
-        0x65 => (Numpad5, None),
-        0x66 => (Numpad6, None),
-        0x67 => (Numpad7, None),
-        0x68 => (Numpad8, None),
-        0x69 => (Numpad9, None),
-
-        // Other keys, includes the raw code provided by the operating system
-        _ => (Other(key_code), None),
-    }
+    (Default::default(), None) /* ~ changed by cargo-mutants ~ */
 }
 
 fn raw_to_mouse_button(raw: i32) -> Option<MouseButton> {
     match raw {
         INPUT_MOUSE_LEFT_BUTTON => Some(MouseButton::Left),
         INPUT_MOUSE_RIGHT_BUTTON => Some(MouseButton::Right),
         INPUT_MOUSE_MIDDLE_BUTTON => Some(MouseButton::Middle),
         INPUT_MOUSE_BUTTON_1 => Some(MouseButton::Button1),

*** result: Success
