*** espanso-detect/src/win32/mod.rs:359:9: delete match arm

*** mutation diff:
--- espanso-detect/src/win32/mod.rs
+++ delete match arm
@@ -351,17 +351,17 @@
     }
 }
 
 // Mappings from: https://developer.mozilla.org/en-US/docs/Web/API/KeyboardEvent/key/Key_Values
 fn key_code_to_key(key_code: i32) -> (Key, Option<Variant>) {
     match key_code {
         // Modifiers
         0x12 => (Alt, None),
-        0xA4 => (Alt, Some(Left)),
+         /* ~ changed by cargo-mutants ~ */
         0xA5 => (Alt, Some(Right)),
         0x14 => (CapsLock, None),
         0x11 => (Control, None),
         0xA2 => (Control, Some(Left)),
         0xA3 => (Control, Some(Right)),
         0x5B => (Meta, Some(Left)),
         0x5C => (Meta, Some(Right)),
         0x90 => (NumLock, None),

*** result: Success
