*** espanso-detect/src/win32/mod.rs:373:9: delete match arm

*** mutation diff:
--- espanso-detect/src/win32/mod.rs
+++ delete match arm
@@ -365,17 +365,17 @@
         0x5B => (Meta, Some(Left)),
         0x5C => (Meta, Some(Right)),
         0x90 => (NumLock, None),
         0x10 => (Shift, None),
         0xA0 => (Shift, Some(Left)),
         0xA1 => (Shift, Some(Right)),
 
         // Whitespace
-        0x0D => (Enter, None),
+         /* ~ changed by cargo-mutants ~ */
         0x09 => (Tab, None),
         0x20 => (Space, None),
 
         // Navigation
         0x28 => (ArrowDown, None),
         0x25 => (ArrowLeft, None),
         0x27 => (ArrowRight, None),
         0x26 => (ArrowUp, None),

*** result: Success
