*** espanso-detect/src/win32/mod.rs:375:9: delete match arm

*** mutation diff:
--- espanso-detect/src/win32/mod.rs
+++ delete match arm
@@ -367,17 +367,17 @@
         0x90 => (NumLock, None),
         0x10 => (Shift, None),
         0xA0 => (Shift, Some(Left)),
         0xA1 => (Shift, Some(Right)),
 
         // Whitespace
         0x0D => (Enter, None),
         0x09 => (Tab, None),
-        0x20 => (Space, None),
+         /* ~ changed by cargo-mutants ~ */
 
         // Navigation
         0x28 => (ArrowDown, None),
         0x25 => (ArrowLeft, None),
         0x27 => (ArrowRight, None),
         0x26 => (ArrowUp, None),
         0x23 => (End, None),
         0x24 => (Home, None),

*** result: Success
