*** espanso-detect/src/win32/mod.rs:381:9: delete match arm

*** mutation diff:
--- espanso-detect/src/win32/mod.rs
+++ delete match arm
@@ -373,17 +373,17 @@
         0x0D => (Enter, None),
         0x09 => (Tab, None),
         0x20 => (Space, None),
 
         // Navigation
         0x28 => (ArrowDown, None),
         0x25 => (ArrowLeft, None),
         0x27 => (ArrowRight, None),
-        0x26 => (ArrowUp, None),
+         /* ~ changed by cargo-mutants ~ */
         0x23 => (End, None),
         0x24 => (Home, None),
         0x22 => (PageDown, None),
         0x21 => (PageUp, None),
 
         // UI
         0x1B => (Escape, None),

*** result: Success
