*** espanso-detect/src/win32/mod.rs:385:9: delete match arm

*** mutation diff:
--- espanso-detect/src/win32/mod.rs
+++ delete match arm
@@ -377,17 +377,17 @@
         // Navigation
         0x28 => (ArrowDown, None),
         0x25 => (ArrowLeft, None),
         0x27 => (ArrowRight, None),
         0x26 => (ArrowUp, None),
         0x23 => (End, None),
         0x24 => (Home, None),
         0x22 => (PageDown, None),
-        0x21 => (PageUp, None),
+         /* ~ changed by cargo-mutants ~ */
 
         // UI
         0x1B => (Escape, None),
 
         // Editing keys
         0x08 => (Backspace, None),
 
         // Function keys

*** result: Success
