*** espanso-detect/src/win32/mod.rs:396:9: delete match arm

*** mutation diff:
--- espanso-detect/src/win32/mod.rs
+++ delete match arm
@@ -388,17 +388,17 @@
         0x1B => (Escape, None),
 
         // Editing keys
         0x08 => (Backspace, None),
 
         // Function keys
         0x70 => (F1, None),
         0x71 => (F2, None),
-        0x72 => (F3, None),
+         /* ~ changed by cargo-mutants ~ */
         0x73 => (F4, None),
         0x74 => (F5, None),
         0x75 => (F6, None),
         0x76 => (F7, None),
         0x77 => (F8, None),
         0x78 => (F9, None),
         0x79 => (F10, None),
         0x7A => (F11, None),

*** result: Success
