*** espanso-detect/src/win32/mod.rs:411:9: delete match arm

*** mutation diff:
--- espanso-detect/src/win32/mod.rs
+++ delete match arm
@@ -403,17 +403,17 @@
         0x79 => (F10, None),
         0x7A => (F11, None),
         0x7B => (F12, None),
         0x7C => (F13, None),
         0x7D => (F14, None),
         0x7E => (F15, None),
         0x7F => (F16, None),
         0x80 => (F17, None),
-        0x81 => (F18, None),
+         /* ~ changed by cargo-mutants ~ */
         0x82 => (F19, None),
         0x83 => (F20, None),
 
         // Numpad
         0x60 => (Numpad0, None),
         0x61 => (Numpad1, None),
         0x62 => (Numpad2, None),
         0x63 => (Numpad3, None),

*** result: Success
