*** espanso-detect/src/win32/mod.rs:433:5: replace raw_to_mouse_button -> Option<MouseButton> with Some(Default::default())

*** mutation diff:
--- espanso-detect/src/win32/mod.rs
+++ replace raw_to_mouse_button -> Option<MouseButton> with Some(Default::default())
@@ -425,27 +425,17 @@
         0x69 => (Numpad9, None),
 
         // Other keys, includes the raw code provided by the operating system
         _ => (Other(key_code), None),
     }
 }
 
 fn raw_to_mouse_button(raw: i32) -> Option<MouseButton> {
-    match raw {
-        INPUT_MOUSE_LEFT_BUTTON => Some(MouseButton::Left),
-        INPUT_MOUSE_RIGHT_BUTTON => Some(MouseButton::Right),
-        INPUT_MOUSE_MIDDLE_BUTTON => Some(MouseButton::Middle),
-        INPUT_MOUSE_BUTTON_1 => Some(MouseButton::Button1),
-        INPUT_MOUSE_BUTTON_2 => Some(MouseButton::Button2),
-        INPUT_MOUSE_BUTTON_3 => Some(MouseButton::Button3),
-        INPUT_MOUSE_BUTTON_4 => Some(MouseButton::Button4),
-        INPUT_MOUSE_BUTTON_5 => Some(MouseButton::Button5),
-        _ => None,
-    }
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn default_raw_input_event() -> RawInputEvent {
         RawInputEvent {

*** result: Success
