*** espanso-detect/src/win32/mod.rs:441:9: delete match arm

*** mutation diff:
--- espanso-detect/src/win32/mod.rs
+++ delete match arm
@@ -433,17 +433,17 @@
     match raw {
         INPUT_MOUSE_LEFT_BUTTON => Some(MouseButton::Left),
         INPUT_MOUSE_RIGHT_BUTTON => Some(MouseButton::Right),
         INPUT_MOUSE_MIDDLE_BUTTON => Some(MouseButton::Middle),
         INPUT_MOUSE_BUTTON_1 => Some(MouseButton::Button1),
         INPUT_MOUSE_BUTTON_2 => Some(MouseButton::Button2),
         INPUT_MOUSE_BUTTON_3 => Some(MouseButton::Button3),
         INPUT_MOUSE_BUTTON_4 => Some(MouseButton::Button4),
-        INPUT_MOUSE_BUTTON_5 => Some(MouseButton::Button5),
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

*** result: Success
