*** espanso-detect/src/x11/mod.rs:164:17: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -156,19 +156,17 @@
         let handle =
             unsafe { detect_initialize(std::ptr::from_ref::<X11Source>(self), &mut error_code) };
 
         if handle.is_null() {
             let error = match error_code {
                 -1 => X11SourceError::DisplayFailure(),
                 -2 => X11SourceError::XRecordMissing(),
                 -3 => X11SourceError::XKeyboardMissing(),
-                -4 => {
-                    X11SourceError::FailedRegistration("cannot initialize record range".to_owned())
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 -5 => X11SourceError::FailedRegistration(
                     "cannot initialize XRecord context".to_owned(),
                 ),
                 -6 => {
                     X11SourceError::FailedRegistration("cannot enable XRecord context".to_owned())
                 }
                 _ => X11SourceError::Unknown(),
             };

*** result: Success
