*** espanso-detect/src/x11/mod.rs:170:17: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -162,19 +162,17 @@
                 -2 => X11SourceError::XRecordMissing(),
                 -3 => X11SourceError::XKeyboardMissing(),
                 -4 => {
                     X11SourceError::FailedRegistration("cannot initialize record range".to_owned())
                 }
                 -5 => X11SourceError::FailedRegistration(
                     "cannot initialize XRecord context".to_owned(),
                 ),
-                -6 => {
-                    X11SourceError::FailedRegistration("cannot enable XRecord context".to_owned())
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => X11SourceError::Unknown(),
             };
             return Err(error.into());
         }
 
         let mod_indexes = unsafe { detect_get_modifier_indexes(handle) };
         self.valid_modifiers_mask |= 1 << mod_indexes.ctrl;
         self.valid_modifiers_mask |= 1 << mod_indexes.alt;

*** result: Success
