*** espanso-detect/src/x11/mod.rs:298:9: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -290,17 +290,17 @@
 
 fn convert_raw_input_event_to_input_event(
     raw: RawInputEvent,
     raw_hotkey_mapping: &HashMap<(i32, u32), i32>,
     valid_modifiers_mask: u32,
 ) -> Option<InputEvent> {
     let status = match raw.status {
         INPUT_STATUS_RELEASED => Released,
-        INPUT_STATUS_PRESSED => Pressed,
+         /* ~ changed by cargo-mutants ~ */
         _ => Pressed,
     };
 
     match raw.event_type {
         // Keyboard events
         INPUT_EVENT_TYPE_KEYBOARD => {
             let (key, variant) = key_sym_to_key(raw.key_sym);
             let value = if raw.buffer_len > 0 {

*** result: Success
