*** espanso-detect/src/x11/mod.rs:364:5: replace key_sym_to_key -> (Key, Option<Variant>) with (Default::default(), Some(Default::default()))

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ replace key_sym_to_key -> (Key, Option<Variant>) with (Default::default(), Some(Default::default()))
@@ -356,87 +356,17 @@
     }
 
     None
 }
 
 // Mappings from: https://developer.mozilla.org/en-US/docs/Web/API/KeyboardEvent/key/Key_Values
 // TODO: might need to add also the variants
 fn key_sym_to_key(key_sym: i32) -> (Key, Option<Variant>) {
-    match key_sym {
-        // Modifiers
-        0xFFE9 => (Alt, Some(Left)),
-        0xFFEA => (Alt, Some(Right)),
-        0xFFE5 => (CapsLock, None),
-        0xFFE3 => (Control, Some(Left)),
-        0xFFE4 => (Control, Some(Right)),
-        0xFFE7 | 0xFFEB => (Meta, Some(Left)),
-        0xFFE8 | 0xFFEC => (Meta, Some(Right)),
-        0xFF7F => (NumLock, None),
-        0xFFE1 => (Shift, Some(Left)),
-        0xFFE2 => (Shift, Some(Right)),
-
-        // Whitespace
-        0xFF0D => (Enter, None),
-        0xFF09 => (Tab, None),
-        0x20 => (Space, None),
-
-        // Navigation
-        0xFF54 => (ArrowDown, None),
-        0xFF51 => (ArrowLeft, None),
-        0xFF53 => (ArrowRight, None),
-        0xFF52 => (ArrowUp, None),
-        0xFF57 => (End, None),
-        0xFF50 => (Home, None),
-        0xFF56 => (PageDown, None),
-        0xFF55 => (PageUp, None),
-
-        // UI keys
-        0xFF1B => (Escape, None),
-
-        // Editing keys
-        0xFF08 => (Backspace, None),
-
-        // Function keys
-        0xFFBE => (F1, None),
-        0xFFBF => (F2, None),
-        0xFFC0 => (F3, None),
-        0xFFC1 => (F4, None),
-        0xFFC2 => (F5, None),
-        0xFFC3 => (F6, None),
-        0xFFC4 => (F7, None),
-        0xFFC5 => (F8, None),
-        0xFFC6 => (F9, None),
-        0xFFC7 => (F10, None),
-        0xFFC8 => (F11, None),
-        0xFFC9 => (F12, None),
-        0xFFCA => (F13, None),
-        0xFFCB => (F14, None),
-        0xFFCC => (F15, None),
-        0xFFCD => (F16, None),
-        0xFFCE => (F17, None),
-        0xFFCF => (F18, None),
-        0xFFD0 => (F19, None),
-        0xFFD1 => (F20, None),
-
-        // Numpad
-        0xFFB0 => (Numpad0, None),
-        0xFFB1 => (Numpad1, None),
-        0xFFB2 => (Numpad2, None),
-        0xFFB3 => (Numpad3, None),
-        0xFFB4 => (Numpad4, None),
-        0xFFB5 => (Numpad5, None),
-        0xFFB6 => (Numpad6, None),
-        0xFFB7 => (Numpad7, None),
-        0xFFB8 => (Numpad8, None),
-        0xFFB9 => (Numpad9, None),
-
-        // Other keys, includes the raw code provided by the operating system
-        _ => (Other(key_sym), None),
-    }
+    (Default::default(), Some(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 fn raw_to_mouse_button(raw: i32) -> Option<MouseButton> {
     match raw {
         INPUT_MOUSE_LEFT_BUTTON => Some(MouseButton::Left),
         INPUT_MOUSE_RIGHT_BUTTON => Some(MouseButton::Right),
         INPUT_MOUSE_MIDDLE_BUTTON => Some(MouseButton::Middle),
         INPUT_MOUSE_BUTTON_1 => Some(MouseButton::Button1),

*** result: Success
