*** espanso-detect/src/x11/mod.rs:371:9: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -363,17 +363,17 @@
 fn key_sym_to_key(key_sym: i32) -> (Key, Option<Variant>) {
     match key_sym {
         // Modifiers
         0xFFE9 => (Alt, Some(Left)),
         0xFFEA => (Alt, Some(Right)),
         0xFFE5 => (CapsLock, None),
         0xFFE3 => (Control, Some(Left)),
         0xFFE4 => (Control, Some(Right)),
-        0xFFE7 | 0xFFEB => (Meta, Some(Left)),
+         /* ~ changed by cargo-mutants ~ */
         0xFFE8 | 0xFFEC => (Meta, Some(Right)),
         0xFF7F => (NumLock, None),
         0xFFE1 => (Shift, Some(Left)),
         0xFFE2 => (Shift, Some(Right)),
 
         // Whitespace
         0xFF0D => (Enter, None),
         0xFF09 => (Tab, None),

*** result: Success
