*** espanso-detect/src/x11/mod.rs:383:9: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -375,17 +375,17 @@
         0xFFE2 => (Shift, Some(Right)),
 
         // Whitespace
         0xFF0D => (Enter, None),
         0xFF09 => (Tab, None),
         0x20 => (Space, None),
 
         // Navigation
-        0xFF54 => (ArrowDown, None),
+         /* ~ changed by cargo-mutants ~ */
         0xFF51 => (ArrowLeft, None),
         0xFF53 => (ArrowRight, None),
         0xFF52 => (ArrowUp, None),
         0xFF57 => (End, None),
         0xFF50 => (Home, None),
         0xFF56 => (PageDown, None),
         0xFF55 => (PageUp, None),

*** result: Success
