*** espanso-detect/src/x11/mod.rs:384:9: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -376,17 +376,17 @@
 
         // Whitespace
         0xFF0D => (Enter, None),
         0xFF09 => (Tab, None),
         0x20 => (Space, None),
 
         // Navigation
         0xFF54 => (ArrowDown, None),
-        0xFF51 => (ArrowLeft, None),
+         /* ~ changed by cargo-mutants ~ */
         0xFF53 => (ArrowRight, None),
         0xFF52 => (ArrowUp, None),
         0xFF57 => (End, None),
         0xFF50 => (Home, None),
         0xFF56 => (PageDown, None),
         0xFF55 => (PageUp, None),
 
         // UI keys

*** result: Success
