*** espanso-detect/src/x11/mod.rs:400:9: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -392,17 +392,17 @@
         // UI keys
         0xFF1B => (Escape, None),
 
         // Editing keys
         0xFF08 => (Backspace, None),
 
         // Function keys
         0xFFBE => (F1, None),
-        0xFFBF => (F2, None),
+         /* ~ changed by cargo-mutants ~ */
         0xFFC0 => (F3, None),
         0xFFC1 => (F4, None),
         0xFFC2 => (F5, None),
         0xFFC3 => (F6, None),
         0xFFC4 => (F7, None),
         0xFFC5 => (F8, None),
         0xFFC6 => (F9, None),
         0xFFC7 => (F10, None),

*** result: Success
