*** espanso-detect/src/x11/mod.rs:412:9: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -404,17 +404,17 @@
         0xFFC3 => (F6, None),
         0xFFC4 => (F7, None),
         0xFFC5 => (F8, None),
         0xFFC6 => (F9, None),
         0xFFC7 => (F10, None),
         0xFFC8 => (F11, None),
         0xFFC9 => (F12, None),
         0xFFCA => (F13, None),
-        0xFFCB => (F14, None),
+         /* ~ changed by cargo-mutants ~ */
         0xFFCC => (F15, None),
         0xFFCD => (F16, None),
         0xFFCE => (F17, None),
         0xFFCF => (F18, None),
         0xFFD0 => (F19, None),
         0xFFD1 => (F20, None),
 
         // Numpad

*** result: Success
