*** espanso-detect/src/x11/mod.rs:416:9: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -408,17 +408,17 @@
         0xFFC7 => (F10, None),
         0xFFC8 => (F11, None),
         0xFFC9 => (F12, None),
         0xFFCA => (F13, None),
         0xFFCB => (F14, None),
         0xFFCC => (F15, None),
         0xFFCD => (F16, None),
         0xFFCE => (F17, None),
-        0xFFCF => (F18, None),
+         /* ~ changed by cargo-mutants ~ */
         0xFFD0 => (F19, None),
         0xFFD1 => (F20, None),
 
         // Numpad
         0xFFB0 => (Numpad0, None),
         0xFFB1 => (Numpad1, None),
         0xFFB2 => (Numpad2, None),
         0xFFB3 => (Numpad3, None),

*** result: Success
