*** espanso-detect/src/x11/mod.rs:422:9: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -414,17 +414,17 @@
         0xFFCD => (F16, None),
         0xFFCE => (F17, None),
         0xFFCF => (F18, None),
         0xFFD0 => (F19, None),
         0xFFD1 => (F20, None),
 
         // Numpad
         0xFFB0 => (Numpad0, None),
-        0xFFB1 => (Numpad1, None),
+         /* ~ changed by cargo-mutants ~ */
         0xFFB2 => (Numpad2, None),
         0xFFB3 => (Numpad3, None),
         0xFFB4 => (Numpad4, None),
         0xFFB5 => (Numpad5, None),
         0xFFB6 => (Numpad6, None),
         0xFFB7 => (Numpad7, None),
         0xFFB8 => (Numpad8, None),
         0xFFB9 => (Numpad9, None),

*** result: Success
