*** espanso-detect/src/x11/mod.rs:424:9: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -416,17 +416,17 @@
         0xFFCF => (F18, None),
         0xFFD0 => (F19, None),
         0xFFD1 => (F20, None),
 
         // Numpad
         0xFFB0 => (Numpad0, None),
         0xFFB1 => (Numpad1, None),
         0xFFB2 => (Numpad2, None),
-        0xFFB3 => (Numpad3, None),
+         /* ~ changed by cargo-mutants ~ */
         0xFFB4 => (Numpad4, None),
         0xFFB5 => (Numpad5, None),
         0xFFB6 => (Numpad6, None),
         0xFFB7 => (Numpad7, None),
         0xFFB8 => (Numpad8, None),
         0xFFB9 => (Numpad9, None),
 
         // Other keys, includes the raw code provided by the operating system

*** result: Success
