*** espanso-detect/src/x11/mod.rs:430:9: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -422,17 +422,17 @@
         0xFFB1 => (Numpad1, None),
         0xFFB2 => (Numpad2, None),
         0xFFB3 => (Numpad3, None),
         0xFFB4 => (Numpad4, None),
         0xFFB5 => (Numpad5, None),
         0xFFB6 => (Numpad6, None),
         0xFFB7 => (Numpad7, None),
         0xFFB8 => (Numpad8, None),
-        0xFFB9 => (Numpad9, None),
+         /* ~ changed by cargo-mutants ~ */
 
         // Other keys, includes the raw code provided by the operating system
         _ => (Other(key_sym), None),
     }
 }
 
 fn raw_to_mouse_button(raw: i32) -> Option<MouseButton> {
     match raw {

*** result: Success
