*** espanso-detect/src/x11/mod.rs:440:9: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -432,17 +432,17 @@
         // Other keys, includes the raw code provided by the operating system
         _ => (Other(key_sym), None),
     }
 }
 
 fn raw_to_mouse_button(raw: i32) -> Option<MouseButton> {
     match raw {
         INPUT_MOUSE_LEFT_BUTTON => Some(MouseButton::Left),
-        INPUT_MOUSE_RIGHT_BUTTON => Some(MouseButton::Right),
+         /* ~ changed by cargo-mutants ~ */
         INPUT_MOUSE_MIDDLE_BUTTON => Some(MouseButton::Middle),
         INPUT_MOUSE_BUTTON_1 => Some(MouseButton::Button1),
         INPUT_MOUSE_BUTTON_2 => Some(MouseButton::Button2),
         _ => None,
     }
 }
 
 #[cfg(test)]

*** result: Success
