*** espanso-detect/src/x11/mod.rs:441:9: delete match arm

*** mutation diff:
--- espanso-detect/src/x11/mod.rs
+++ delete match arm
@@ -433,17 +433,17 @@
         _ => (Other(key_sym), None),
     }
 }
 
 fn raw_to_mouse_button(raw: i32) -> Option<MouseButton> {
     match raw {
         INPUT_MOUSE_LEFT_BUTTON => Some(MouseButton::Left),
         INPUT_MOUSE_RIGHT_BUTTON => Some(MouseButton::Right),
-        INPUT_MOUSE_MIDDLE_BUTTON => Some(MouseButton::Middle),
+         /* ~ changed by cargo-mutants ~ */
         INPUT_MOUSE_BUTTON_1 => Some(MouseButton::Button1),
         INPUT_MOUSE_BUTTON_2 => Some(MouseButton::Button2),
         _ => None,
     }
 }
 
 #[cfg(test)]
 mod tests {

*** result: Success
