*** espanso-engine/src/dispatch/default.rs:78:9: replace <impl Dispatcher for DefaultDispatcher<'_>>::dispatch with ()

*** mutation diff:
--- espanso-engine/src/dispatch/default.rs
+++ replace <impl Dispatcher for DefaultDispatcher<'_>>::dispatch with ()
@@ -70,15 +70,11 @@
                 )),
             ],
         }
     }
 }
 
 impl Dispatcher for DefaultDispatcher<'_> {
     fn dispatch(&self, event: Event) {
-        for executor in &self.executors {
-            if executor.execute(&event) {
-                break;
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
