*** espanso-engine/src/dispatch/executor/key_inject.rs:43:9: replace <impl Executor for KeyInjectExecutor<'_>>::execute -> bool with true

*** mutation diff:
--- espanso-engine/src/dispatch/executor/key_inject.rs
+++ replace <impl Executor for KeyInjectExecutor<'_>>::execute -> bool with true
@@ -35,18 +35,11 @@
 impl<'a> KeyInjectExecutor<'a> {
     pub fn new(injector: &'a dyn KeyInjector) -> Self {
         Self { injector }
     }
 }
 
 impl Executor for KeyInjectExecutor<'_> {
     fn execute(&self, event: &Event) -> bool {
-        if let EventType::KeySequenceInject(inject_event) = &event.etype {
-            if let Err(error) = self.injector.inject_sequence(&inject_event.keys) {
-                error!("key injector reported an error: {}", error);
-            }
-            return true;
-        }
-
-        false
+        true /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
