*** espanso-engine/src/dispatch/executor/text_inject.rs:68:9: replace <impl Executor for TextInjectExecutor<'_>>::execute -> bool with true

*** mutation diff:
--- espanso-engine/src/dispatch/executor/text_inject.rs
+++ replace <impl Executor for TextInjectExecutor<'_>>::execute -> bool with true
@@ -60,56 +60,11 @@
             clipboard_injector,
             mode_provider,
         }
     }
 }
 
 impl Executor for TextInjectExecutor<'_> {
     fn execute(&self, event: &Event) -> bool {
-        if let EventType::TextInject(inject_event) = &event.etype {
-            let active_mode = self.mode_provider.active_mode();
-
-            let injector = if let Some(force_mode) = &inject_event.force_mode {
-                if let TextInjectMode::Keys = force_mode {
-                    self.event_injector
-                } else {
-                    self.clipboard_injector
-                }
-            } else if let Mode::Clipboard = active_mode {
-                self.clipboard_injector
-            } else if let Mode::Event = active_mode {
-                self.event_injector
-            } else if let Mode::Auto {
-                clipboard_threshold,
-            } = active_mode
-            {
-                if inject_event.text.chars().count() > clipboard_threshold {
-                    self.clipboard_injector
-                } else if cfg!(target_os = "linux") {
-                    if inject_event.text.is_ascii() {
-                        self.event_injector
-                    } else {
-                        self.clipboard_injector
-                    }
-                } else {
-                    self.event_injector
-                }
-            } else {
-                self.event_injector
-            };
-
-            trace!("using injector: {}", injector.name());
-
-            if let Err(error) = injector.inject_text(&inject_event.text) {
-                error!(
-                    "text injector ({}) reported an error: {:?}",
-                    injector.name(),
-                    error
-                );
-            }
-
-            return true;
-        }
-
-        false
+        true /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
