*** espanso-engine/src/dispatch/executor/text_ui.rs:42:9: replace <impl Executor for TextUIExecutor<'_>>::execute -> bool with true

*** mutation diff:
--- espanso-engine/src/dispatch/executor/text_ui.rs
+++ replace <impl Executor for TextUIExecutor<'_>>::execute -> bool with true
@@ -34,28 +34,11 @@
 impl<'a> TextUIExecutor<'a> {
     pub fn new(handler: &'a dyn TextUIHandler) -> Self {
         Self { handler }
     }
 }
 
 impl Executor for TextUIExecutor<'_> {
     fn execute(&self, event: &Event) -> bool {
-        if let EventType::ShowText(show_text_event) = &event.etype {
-            if let Err(error) = self
-                .handler
-                .show_text(&show_text_event.title, &show_text_event.text)
-            {
-                error!("text UI handler reported an error: {:?}", error);
-            }
-
-            return true;
-        } else if let EventType::ShowLogs = &event.etype {
-            if let Err(error) = self.handler.show_logs() {
-                error!("text UI handler reported an error: {:?}", error);
-            }
-
-            return true;
-        }
-
-        false
+        true /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
