*** espanso-engine/src/process/default.rs:177:15: delete ! in <impl Processor for DefaultProcessor<'_>>::process

*** mutation diff:
--- espanso-engine/src/process/default.rs
+++ delete ! in <impl Processor for DefaultProcessor<'_>>::process
@@ -169,17 +169,17 @@
 }
 
 impl Processor for DefaultProcessor<'_> {
     fn process(&mut self, event: Event) -> Vec<Event> {
         self.event_queue.push_front(event);
 
         let mut processed_events = Vec::new();
 
-        while !self.event_queue.is_empty() {
+        while  /* ~ changed by cargo-mutants ~ */self.event_queue.is_empty() {
             if let Some(event) = self.process_one() {
                 processed_events.push(event);
             }
         }
 
         processed_events
     }
 }

*** result: Success
