*** espanso-engine/src/process/middleware/action.rs:63:13: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/action.rs
+++ delete match arm
@@ -55,54 +55,17 @@
 
 impl Middleware for ActionMiddleware<'_> {
     fn name(&self) -> &'static str {
         "action"
     }
 
     fn next(&self, event: Event, dispatch: &mut dyn FnMut(Event)) -> Event {
         match &event.etype {
-            EventType::Rendered(_) | EventType::ImageResolved(_) => {
-                dispatch(Event::caused_by(event.source_id, EventType::MatchInjected));
-                dispatch(Event::caused_by(
-                    event.source_id,
-                    EventType::DiscardPrevious(DiscardPreviousEvent {
-                        minimum_source_id: self.event_sequence_provider.get_next_id(),
-                    }),
-                ));
-
-                match &event.etype {
-                    EventType::Rendered(m_event) => Event::caused_by(
-                        event.source_id,
-                        match m_event.format {
-                            TextFormat::Plain => EventType::TextInject(TextInjectRequest {
-                                text: m_event.body.clone(),
-                                force_mode: self
-                                    .match_info_provider
-                                    .get_force_mode(m_event.match_id),
-                            }),
-                            TextFormat::Html => EventType::HtmlInject(HtmlInjectRequest {
-                                html: m_event.body.clone(),
-                            }),
-                            TextFormat::Markdown => {
-                                EventType::MarkdownInject(MarkdownInjectRequest {
-                                    markdown: m_event.body.clone(),
-                                })
-                            }
-                        },
-                    ),
-                    EventType::ImageResolved(m_event) => Event::caused_by(
-                        event.source_id,
-                        EventType::ImageInject(ImageInjectRequest {
-                            image_path: m_event.image_path.clone(),
-                        }),
-                    ),
-                    _ => unreachable!(),
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             EventType::CursorHintCompensation(m_event) => {
                 dispatch(Event::caused_by(
                     event.source_id,
                     EventType::DiscardPrevious(DiscardPreviousEvent {
                         minimum_source_id: self.event_sequence_provider.get_next_id(),
                     }),
                 ));

*** result: Success
