*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:122:32: replace >= with < in convert_buffer_into_char

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ replace >= with < in convert_buffer_into_char
@@ -114,17 +114,17 @@
 
     // According to: https://en.wikipedia.org/wiki/Alt_code
     // The conversion works as follow:
     // * If the number is smaller than 256 and does not start with 0, then we use a patched version of the CP437 encoding
     // * If the number is smaller than 256 and starts with 0 we use the CP1252 encoding
     // * If the number is greater or equal than 256 we use the unicode encoding
 
     let code = buffer.parse::<u32>().ok()?;
-    let unicode_code = if code >= 256 {
+    let unicode_code = if code < /* ~ changed by cargo-mutants ~ */ 256 {
         // Unicode
         code
     } else if buffer.starts_with('0') {
         // CP1252
         convert_cp1252_code_to_unicode(code)?
     } else {
         // CP437
         convert_cp437_code_to_unicode(code)?

*** result: Success
