*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:139:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -131,17 +131,17 @@
     };
 
     char::from_u32(unicode_code).map(|c| c.to_string())
 }
 
 // Taken from: https://altcodeunicode.com/
 fn convert_cp437_code_to_unicode(code: u32) -> Option<u32> {
     match code {
-        0 => Some(0x0000),   // Control character - null (NUL)
+         /* ~ changed by cargo-mutants ~ */   // Control character - null (NUL)
         1 => Some(0x263A),   // White smiling face, smiley face
         2 => Some(0x263B),   // Black smiling face
         3 => Some(0x2665),   // Black heart suit
         4 => Some(0x2666),   // Black diamond suit
         5 => Some(0x2663),   // Black club suit
         6 => Some(0x2660),   // Black spade suit
         7 => Some(0x2022),   // Bullet
         8 => Some(0x25D8),   // Inverse bullet

*** result: Success
