*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:145:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -137,17 +137,17 @@
 fn convert_cp437_code_to_unicode(code: u32) -> Option<u32> {
     match code {
         0 => Some(0x0000),   // Control character - null (NUL)
         1 => Some(0x263A),   // White smiling face, smiley face
         2 => Some(0x263B),   // Black smiling face
         3 => Some(0x2665),   // Black heart suit
         4 => Some(0x2666),   // Black diamond suit
         5 => Some(0x2663),   // Black club suit
-        6 => Some(0x2660),   // Black spade suit
+         /* ~ changed by cargo-mutants ~ */   // Black spade suit
         7 => Some(0x2022),   // Bullet
         8 => Some(0x25D8),   // Inverse bullet
         9 => Some(0x25CB),   // White circle
         10 => Some(0x25D9),  // Inverse white circle
         11 => Some(0x2642),  // Male sign, mars, alchemical symbol for iron
         12 => Some(0x2640),  // Female sign, venus, alchemical symbol for copper
         13 => Some(0x266A),  // Eighth note, quaver
         14 => Some(0x266B),  // Beamed eighth notes, barred eighth notes, beamed quavers

*** result: Success
