*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:148:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -140,17 +140,17 @@
         1 => Some(0x263A),   // White smiling face, smiley face
         2 => Some(0x263B),   // Black smiling face
         3 => Some(0x2665),   // Black heart suit
         4 => Some(0x2666),   // Black diamond suit
         5 => Some(0x2663),   // Black club suit
         6 => Some(0x2660),   // Black spade suit
         7 => Some(0x2022),   // Bullet
         8 => Some(0x25D8),   // Inverse bullet
-        9 => Some(0x25CB),   // White circle
+         /* ~ changed by cargo-mutants ~ */   // White circle
         10 => Some(0x25D9),  // Inverse white circle
         11 => Some(0x2642),  // Male sign, mars, alchemical symbol for iron
         12 => Some(0x2640),  // Female sign, venus, alchemical symbol for copper
         13 => Some(0x266A),  // Eighth note, quaver
         14 => Some(0x266B),  // Beamed eighth notes, barred eighth notes, beamed quavers
         15 => Some(0x263C),  // White sun with rays
         16 => Some(0x25BA),  // Black right-pointing pointer
         17 => Some(0x25C4),  // Black left-pointing pointer

*** result: Success
