*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:165:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -157,17 +157,17 @@
         18 => Some(0x2195),  // Up down arrow
         19 => Some(0x203C),  // Double exclamation mark
         20 => Some(0x00B6),  // Pilcrow sign, paragraph sign
         21 => Some(0x00A7),  // Section sign
         22 => Some(0x25AC),  // Black rectangle
         23 => Some(0x21A8),  // Up down arrow with base
         24 => Some(0x2191),  // Upwards arrow
         25 => Some(0x2193),  // Downwards arrow
-        26 => Some(0x2192),  // Rightwards arrow, Z notation total function
+         /* ~ changed by cargo-mutants ~ */  // Rightwards arrow, Z notation total function
         27 => Some(0x2190),  // Leftwards arrow
         28 => Some(0x221F),  // Right angle
         29 => Some(0x2194),  // Left right arrow, Z notation relation
         30 => Some(0x25B2),  // Black up-pointing triangle
         31 => Some(0x25BC),  // Black down-pointing triangle
         32 => Some(0x0020),  // Space
         33 => Some(0x0021),  // Exclamation mark, factorial
         34 => Some(0x0022),  // Quotation mark

*** result: Success
