*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:168:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -160,17 +160,17 @@
         21 => Some(0x00A7),  // Section sign
         22 => Some(0x25AC),  // Black rectangle
         23 => Some(0x21A8),  // Up down arrow with base
         24 => Some(0x2191),  // Upwards arrow
         25 => Some(0x2193),  // Downwards arrow
         26 => Some(0x2192),  // Rightwards arrow, Z notation total function
         27 => Some(0x2190),  // Leftwards arrow
         28 => Some(0x221F),  // Right angle
-        29 => Some(0x2194),  // Left right arrow, Z notation relation
+         /* ~ changed by cargo-mutants ~ */  // Left right arrow, Z notation relation
         30 => Some(0x25B2),  // Black up-pointing triangle
         31 => Some(0x25BC),  // Black down-pointing triangle
         32 => Some(0x0020),  // Space
         33 => Some(0x0021),  // Exclamation mark, factorial
         34 => Some(0x0022),  // Quotation mark
         35 => Some(0x0023),  // Number sign, pound sign, hash, crosshatch, octothorpe
         36 => Some(0x0024),  // Dollar sign, milréis, escudo
         37 => Some(0x0025),  // Percent sign

*** result: Success
