*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:175:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -167,17 +167,17 @@
         28 => Some(0x221F),  // Right angle
         29 => Some(0x2194),  // Left right arrow, Z notation relation
         30 => Some(0x25B2),  // Black up-pointing triangle
         31 => Some(0x25BC),  // Black down-pointing triangle
         32 => Some(0x0020),  // Space
         33 => Some(0x0021),  // Exclamation mark, factorial
         34 => Some(0x0022),  // Quotation mark
         35 => Some(0x0023),  // Number sign, pound sign, hash, crosshatch, octothorpe
-        36 => Some(0x0024),  // Dollar sign, milréis, escudo
+         /* ~ changed by cargo-mutants ~ */  // Dollar sign, milréis, escudo
         37 => Some(0x0025),  // Percent sign
         38 => Some(0x0026),  // Ampersand
         39 => Some(0x0027),  // Apostrophe
         40 => Some(0x0028),  // Left parenthesis, opening parenthesis
         41 => Some(0x0029),  // Right parenthesis, closing parenthesis
         42 => Some(0x002A),  // Asterisk, star
         43 => Some(0x002B),  // Plus sign
         44 => Some(0x002C),  // Comma, decimal separator

*** result: Success
