*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:210:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -202,17 +202,17 @@
         63 => Some(0x003F),  // Question mark
         64 => Some(0x0040),  // Commercial at, at sign
         65 => Some(0x0041),  // Latin capital letter A
         66 => Some(0x0042),  // Latin capital letter B
         67 => Some(0x0043),  // Latin capital letter C
         68 => Some(0x0044),  // Latin capital letter D
         69 => Some(0x0045),  // Latin capital letter E
         70 => Some(0x0046),  // Latin capital letter F
-        71 => Some(0x0047),  // Latin capital letter G
+         /* ~ changed by cargo-mutants ~ */  // Latin capital letter G
         72 => Some(0x0048),  // Latin capital letter H
         73 => Some(0x0049),  // Latin capital letter I
         74 => Some(0x004A),  // Latin capital letter J
         75 => Some(0x004B),  // Latin capital letter K
         76 => Some(0x004C),  // Latin capital letter L
         77 => Some(0x004D),  // Latin capital letter M
         78 => Some(0x004E),  // Latin capital letter N
         79 => Some(0x004F),  // Latin capital letter O

*** result: Success
