*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:245:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -237,17 +237,17 @@
         98 => Some(0x0062),  // Latin small letter b
         99 => Some(0x0063),  // Latin small letter c
         100 => Some(0x0064), // Latin small letter d
         101 => Some(0x0065), // Latin small letter e
         102 => Some(0x0066), // Latin small letter f
         103 => Some(0x0067), // Latin small letter g
         104 => Some(0x0068), // Latin small letter h
         105 => Some(0x0069), // Latin small letter i
-        106 => Some(0x006A), // Latin small letter j
+         /* ~ changed by cargo-mutants ~ */ // Latin small letter j
         107 => Some(0x006B), // Latin small letter k
         108 => Some(0x006C), // Latin small letter l
         109 => Some(0x006D), // Latin small letter m
         110 => Some(0x006E), // Latin small letter n
         111 => Some(0x006F), // Latin small letter o
         112 => Some(0x0070), // Latin small letter p
         113 => Some(0x0071), // Latin small letter q
         114 => Some(0x0072), // Latin small letter r

*** result: Success
