*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:249:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -241,17 +241,17 @@
         102 => Some(0x0066), // Latin small letter f
         103 => Some(0x0067), // Latin small letter g
         104 => Some(0x0068), // Latin small letter h
         105 => Some(0x0069), // Latin small letter i
         106 => Some(0x006A), // Latin small letter j
         107 => Some(0x006B), // Latin small letter k
         108 => Some(0x006C), // Latin small letter l
         109 => Some(0x006D), // Latin small letter m
-        110 => Some(0x006E), // Latin small letter n
+         /* ~ changed by cargo-mutants ~ */ // Latin small letter n
         111 => Some(0x006F), // Latin small letter o
         112 => Some(0x0070), // Latin small letter p
         113 => Some(0x0071), // Latin small letter q
         114 => Some(0x0072), // Latin small letter r
         115 => Some(0x0073), // Latin small letter s
         116 => Some(0x0074), // Latin small letter t
         117 => Some(0x0075), // Latin small letter u
         118 => Some(0x0076), // Latin small letter v

*** result: Success
