*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:265:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -257,17 +257,17 @@
         118 => Some(0x0076), // Latin small letter v
         119 => Some(0x0077), // Latin small letter w
         120 => Some(0x0078), // Latin small letter x
         121 => Some(0x0079), // Latin small letter y
         122 => Some(0x007A), // Latin small letter z
         123 => Some(0x007B), // Left curly bracket, opening curly bracket, left brace
         124 => Some(0x007C), // Vertical line, vertical bar
         125 => Some(0x007D), // Right curly bracket, closing curly bracket, right brace
-        126 => Some(0x007E), // Tilde
+         /* ~ changed by cargo-mutants ~ */ // Tilde
         127 => Some(0x2302), // House
         128 => Some(0x00C7), // Latin capital letter C with cedilla
         129 => Some(0x00FC), // Latin small letter u with diaeresis
         130 => Some(0x00E9), // Latin small letter e with acute
         131 => Some(0x00E2), // Latin small letter a with circumflex
         132 => Some(0x00E4), // Latin small letter a with diaeresis
         133 => Some(0x00E0), // Latin small letter a with grave
         134 => Some(0x00E5), // Latin small letter a with ring above

*** result: Success
