*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:266:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -258,17 +258,17 @@
         119 => Some(0x0077), // Latin small letter w
         120 => Some(0x0078), // Latin small letter x
         121 => Some(0x0079), // Latin small letter y
         122 => Some(0x007A), // Latin small letter z
         123 => Some(0x007B), // Left curly bracket, opening curly bracket, left brace
         124 => Some(0x007C), // Vertical line, vertical bar
         125 => Some(0x007D), // Right curly bracket, closing curly bracket, right brace
         126 => Some(0x007E), // Tilde
-        127 => Some(0x2302), // House
+         /* ~ changed by cargo-mutants ~ */ // House
         128 => Some(0x00C7), // Latin capital letter C with cedilla
         129 => Some(0x00FC), // Latin small letter u with diaeresis
         130 => Some(0x00E9), // Latin small letter e with acute
         131 => Some(0x00E2), // Latin small letter a with circumflex
         132 => Some(0x00E4), // Latin small letter a with diaeresis
         133 => Some(0x00E0), // Latin small letter a with grave
         134 => Some(0x00E5), // Latin small letter a with ring above
         135 => Some(0x00E7), // Latin small letter c with cedilla

*** result: Success
