*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:272:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -264,17 +264,17 @@
         125 => Some(0x007D), // Right curly bracket, closing curly bracket, right brace
         126 => Some(0x007E), // Tilde
         127 => Some(0x2302), // House
         128 => Some(0x00C7), // Latin capital letter C with cedilla
         129 => Some(0x00FC), // Latin small letter u with diaeresis
         130 => Some(0x00E9), // Latin small letter e with acute
         131 => Some(0x00E2), // Latin small letter a with circumflex
         132 => Some(0x00E4), // Latin small letter a with diaeresis
-        133 => Some(0x00E0), // Latin small letter a with grave
+         /* ~ changed by cargo-mutants ~ */ // Latin small letter a with grave
         134 => Some(0x00E5), // Latin small letter a with ring above
         135 => Some(0x00E7), // Latin small letter c with cedilla
         136 => Some(0x00EA), // Latin small letter e with circumflex
         137 => Some(0x00EB), // Latin small letter e with diaeresis
         138 => Some(0x00E8), // Latin small letter e with grave
         139 => Some(0x00EF), // Latin small letter i with diaeresis
         140 => Some(0x00EE), // Latin small letter i with circumflex
         141 => Some(0x00EC), // Latin small letter i with grave

*** result: Success
