*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:286:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -278,17 +278,17 @@
         139 => Some(0x00EF), // Latin small letter i with diaeresis
         140 => Some(0x00EE), // Latin small letter i with circumflex
         141 => Some(0x00EC), // Latin small letter i with grave
         142 => Some(0x00C4), // Latin capital letter A with diaeresis
         143 => Some(0x00C5), // Latin capital letter A with ring above
         144 => Some(0x00C9), // Latin capital letter E with acute
         145 => Some(0x00E6), // Latin small letter ae, ash (from Old English æsc)
         146 => Some(0x00C6), // Latin capital letter AE
-        147 => Some(0x00F4), // Latin small letter o with circumflex
+         /* ~ changed by cargo-mutants ~ */ // Latin small letter o with circumflex
         148 => Some(0x00F6), // Latin small letter o with diaeresis
         149 => Some(0x00F2), // Latin small letter o with grave
         150 => Some(0x00FB), // Latin small letter u with circumflex
         151 => Some(0x00F9), // Latin small letter u with grave
         152 => Some(0x00FF), // Latin small letter y with diaeresis
         153 => Some(0x00D6), // Latin capital letter O with diaeresis
         154 => Some(0x00DC), // Latin capital letter U with diaeresis
         155 => Some(0x00A2), // Cent sign

*** result: Success
