*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:298:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -290,17 +290,17 @@
         151 => Some(0x00F9), // Latin small letter u with grave
         152 => Some(0x00FF), // Latin small letter y with diaeresis
         153 => Some(0x00D6), // Latin capital letter O with diaeresis
         154 => Some(0x00DC), // Latin capital letter U with diaeresis
         155 => Some(0x00A2), // Cent sign
         156 => Some(0x00A3), // Pound sign, pound sterling, Irish punt, lira sign
         157 => Some(0x00A5), // Yen sign, yuan sign
         158 => Some(0x20A7), // Peseta sign
-        159 => Some(0x0192), // Latin small letter f with hook, florin currency symbol, function symbol
+         /* ~ changed by cargo-mutants ~ */ // Latin small letter f with hook, florin currency symbol, function symbol
         160 => Some(0x00E1), // Latin small letter a with acute
         161 => Some(0x00ED), // Latin small letter i with acute
         162 => Some(0x00F3), // Latin small letter o with acute
         163 => Some(0x00FA), // Latin small letter u with acute
         164 => Some(0x00F1), // Latin small letter n with tilde, small letter enye
         165 => Some(0x00D1), // Latin capital letter N with tilde, capital letter enye
         166 => Some(0x00AA), // Feminine ordinal indicator
         167 => Some(0x00BA), // Masculine ordinal indicator

*** result: Success
