*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:309:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -301,17 +301,17 @@
         162 => Some(0x00F3), // Latin small letter o with acute
         163 => Some(0x00FA), // Latin small letter u with acute
         164 => Some(0x00F1), // Latin small letter n with tilde, small letter enye
         165 => Some(0x00D1), // Latin capital letter N with tilde, capital letter enye
         166 => Some(0x00AA), // Feminine ordinal indicator
         167 => Some(0x00BA), // Masculine ordinal indicator
         168 => Some(0x00BF), // Inverted question mark, turned question mark
         169 => Some(0x2310), // Reversed not sign, beginning of line
-        170 => Some(0x00AC), // Not sign, angled dash
+         /* ~ changed by cargo-mutants ~ */ // Not sign, angled dash
         171 => Some(0x00BD), // Vulgar fraction one half
         172 => Some(0x00BC), // Vulgar fraction one quarter
         173 => Some(0x00A1), // Inverted exclamation mark
         174 => Some(0x00AB), // Left-pointing double angle quotation mark, left guillemet, chevrons (in typography)
         175 => Some(0x00BB), // Right-pointing double angle quotation mark, right guillemet
         176 => Some(0x2591), // Light shade
         177 => Some(0x2592), // Medium shade, speckles fill, dotted fill
         178 => Some(0x2593), // Dark shade

*** result: Success
