*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:321:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -313,17 +313,17 @@
         174 => Some(0x00AB), // Left-pointing double angle quotation mark, left guillemet, chevrons (in typography)
         175 => Some(0x00BB), // Right-pointing double angle quotation mark, right guillemet
         176 => Some(0x2591), // Light shade
         177 => Some(0x2592), // Medium shade, speckles fill, dotted fill
         178 => Some(0x2593), // Dark shade
         179 => Some(0x2502), // Box drawings light vertical
         180 => Some(0x2524), // Box drawings light vertical and left
         181 => Some(0x2561), // Box drawings vertical single and left double
-        182 => Some(0x2562), // Box drawings vertical double and left single
+         /* ~ changed by cargo-mutants ~ */ // Box drawings vertical double and left single
         183 => Some(0x2556), // Box drawings down double and left single
         184 => Some(0x2555), // Box drawings down single and left double
         185 => Some(0x2563), // Box drawings double vertical and left
         186 => Some(0x2551), // Box drawings double vertical
         187 => Some(0x2557), // Box drawings double down and left
         188 => Some(0x255D), // Box drawings double up and left
         189 => Some(0x255C), // Box drawings up double and left single
         190 => Some(0x255B), // Box drawings up single and left double

*** result: Success
