*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:345:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -337,17 +337,17 @@
         198 => Some(0x255E), // Box drawings vertical single and right double
         199 => Some(0x255F), // Box drawings vertical double and right single
         200 => Some(0x255A), // Box drawings double up and right
         201 => Some(0x2554), // Box drawings double down and right
         202 => Some(0x2569), // Box drawings double up and horizontal
         203 => Some(0x2566), // Box drawings double down and horizontal
         204 => Some(0x2560), // Box drawings double vertical and right
         205 => Some(0x2550), // Box drawings double horizontal
-        206 => Some(0x256C), // Box drawings double vertical and horizontal
+         /* ~ changed by cargo-mutants ~ */ // Box drawings double vertical and horizontal
         207 => Some(0x2567), // Box drawings up single and horizontal double
         208 => Some(0x2568), // Box drawings up double and horizontal single
         209 => Some(0x2564), // Box drawings down single and horizontal double
         210 => Some(0x2565), // Box drawings down double and horizontal single
         211 => Some(0x2559), // Box drawings up double and right single
         212 => Some(0x2558), // Box drawings up single and right double
         213 => Some(0x2552), // Box drawings down single and right double
         214 => Some(0x2553), // Box drawings down double and right single

*** result: Success
