*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:358:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -350,17 +350,17 @@
         211 => Some(0x2559), // Box drawings up double and right single
         212 => Some(0x2558), // Box drawings up single and right double
         213 => Some(0x2552), // Box drawings down single and right double
         214 => Some(0x2553), // Box drawings down double and right single
         215 => Some(0x256B), // Box drawings vertical double and horizontal single
         216 => Some(0x256A), // Box drawings vertical single and horizontal double
         217 => Some(0x2518), // Box drawings light up and left
         218 => Some(0x250C), // Box drawings light down and right
-        219 => Some(0x2588), // Full block, solid block
+         /* ~ changed by cargo-mutants ~ */ // Full block, solid block
         220 => Some(0x2584), // Lower half block
         221 => Some(0x258C), // Left half block
         222 => Some(0x2590), // Right half block
         223 => Some(0x2580), // Upper half block
         224 => Some(0x03B1), // Greek small letter alpha
         225 => Some(0x00DF), // Latin small letter sharp s, eszett
         226 => Some(0x0393), // Greek capital letter gamma
         227 => Some(0x03C0), // Greek small letter pi

*** result: Success
