*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:389:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -381,17 +381,17 @@
         242 => Some(0x2265), // Greater-than or equal to
         243 => Some(0x2264), // Less-than or equal to
         244 => Some(0x2320), // Top half integral
         245 => Some(0x2321), // Bottom half integral
         246 => Some(0x00F7), // Division sign, obelus
         247 => Some(0x2248), // Almost equal to, asymptotic to
         248 => Some(0x00B0), // Degree sign
         249 => Some(0x2219), // Bullet operator
-        250 => Some(0x00B7), // Middle dot, midpoint (in typography), interpunct, Georgian comma, Greek ano teleia
+         /* ~ changed by cargo-mutants ~ */ // Middle dot, midpoint (in typography), interpunct, Georgian comma, Greek ano teleia
         251 => Some(0x221A), // Square root, radical sign
         252 => Some(0x207F), // Superscript Latin small letter n
         253 => Some(0x00B2), // Superscript two, squared
         254 => Some(0x25A0), // Black square
         255 => Some(0x00A0), // No-break space, non-breaking space, nbsp
         _ => None,
     }
 }

*** result: Success
