*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:422:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -414,17 +414,17 @@
 #        Column #2 is the Unicode (in hex as 0xXXXX)
 #        Column #3 is the Unicode name (follows a comment sign, '#')
 #
 #    The entries are in cp1252 order
 #
 */
 fn convert_cp1252_code_to_unicode(code: u32) -> Option<u32> {
     match code {
-        0x00 => Some(0x0000), // #NULL
+         /* ~ changed by cargo-mutants ~ */ // #NULL
         0x01 => Some(0x0001), // #START OF HEADING
         0x02 => Some(0x0002), // #START OF TEXT
         0x03 => Some(0x0003), // #END OF TEXT
         0x04 => Some(0x0004), // #END OF TRANSMISSION
         0x05 => Some(0x0005), // #ENQUIRY
         0x06 => Some(0x0006), // #ACKNOWLEDGE
         0x07 => Some(0x0007), // #BELL
         0x08 => Some(0x0008), // #BACKSPACE

*** result: Success
