*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:436:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -428,17 +428,17 @@
         0x06 => Some(0x0006), // #ACKNOWLEDGE
         0x07 => Some(0x0007), // #BELL
         0x08 => Some(0x0008), // #BACKSPACE
         0x09 => Some(0x0009), // #HORIZONTAL TABULATION
         0x0A => Some(0x000A), // #LINE FEED
         0x0B => Some(0x000B), // #VERTICAL TABULATION
         0x0C => Some(0x000C), // #FORM FEED
         0x0D => Some(0x000D), // #CARRIAGE RETURN
-        0x0E => Some(0x000E), // #SHIFT OUT
+         /* ~ changed by cargo-mutants ~ */ // #SHIFT OUT
         0x0F => Some(0x000F), // #SHIFT IN
         0x10 => Some(0x0010), // #DATA LINK ESCAPE
         0x11 => Some(0x0011), // #DEVICE CONTROL ONE
         0x12 => Some(0x0012), // #DEVICE CONTROL TWO
         0x13 => Some(0x0013), // #DEVICE CONTROL THREE
         0x14 => Some(0x0014), // #DEVICE CONTROL FOUR
         0x15 => Some(0x0015), // #NEGATIVE ACKNOWLEDGE
         0x16 => Some(0x0016), // #SYNCHRONOUS IDLE

*** result: Success
