*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:440:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -432,17 +432,17 @@
         0x0A => Some(0x000A), // #LINE FEED
         0x0B => Some(0x000B), // #VERTICAL TABULATION
         0x0C => Some(0x000C), // #FORM FEED
         0x0D => Some(0x000D), // #CARRIAGE RETURN
         0x0E => Some(0x000E), // #SHIFT OUT
         0x0F => Some(0x000F), // #SHIFT IN
         0x10 => Some(0x0010), // #DATA LINK ESCAPE
         0x11 => Some(0x0011), // #DEVICE CONTROL ONE
-        0x12 => Some(0x0012), // #DEVICE CONTROL TWO
+         /* ~ changed by cargo-mutants ~ */ // #DEVICE CONTROL TWO
         0x13 => Some(0x0013), // #DEVICE CONTROL THREE
         0x14 => Some(0x0014), // #DEVICE CONTROL FOUR
         0x15 => Some(0x0015), // #NEGATIVE ACKNOWLEDGE
         0x16 => Some(0x0016), // #SYNCHRONOUS IDLE
         0x17 => Some(0x0017), // #END OF TRANSMISSION BLOCK
         0x18 => Some(0x0018), // #CANCEL
         0x19 => Some(0x0019), // #END OF MEDIUM
         0x1A => Some(0x001A), // #SUBSTITUTE

*** result: Success
