*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:450:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -442,17 +442,17 @@
         0x14 => Some(0x0014), // #DEVICE CONTROL FOUR
         0x15 => Some(0x0015), // #NEGATIVE ACKNOWLEDGE
         0x16 => Some(0x0016), // #SYNCHRONOUS IDLE
         0x17 => Some(0x0017), // #END OF TRANSMISSION BLOCK
         0x18 => Some(0x0018), // #CANCEL
         0x19 => Some(0x0019), // #END OF MEDIUM
         0x1A => Some(0x001A), // #SUBSTITUTE
         0x1B => Some(0x001B), // #ESCAPE
-        0x1C => Some(0x001C), // #FILE SEPARATOR
+         /* ~ changed by cargo-mutants ~ */ // #FILE SEPARATOR
         0x1D => Some(0x001D), // #GROUP SEPARATOR
         0x1E => Some(0x001E), // #RECORD SEPARATOR
         0x1F => Some(0x001F), // #UNIT SEPARATOR
         0x20 => Some(0x0020), // #SPACE
         0x21 => Some(0x0021), // #EXCLAMATION MARK
         0x22 => Some(0x0022), // #QUOTATION MARK
         0x23 => Some(0x0023), // #NUMBER SIGN
         0x24 => Some(0x0024), // #DOLLAR SIGN

*** result: Success
