*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:457:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -449,17 +449,17 @@
         0x1B => Some(0x001B), // #ESCAPE
         0x1C => Some(0x001C), // #FILE SEPARATOR
         0x1D => Some(0x001D), // #GROUP SEPARATOR
         0x1E => Some(0x001E), // #RECORD SEPARATOR
         0x1F => Some(0x001F), // #UNIT SEPARATOR
         0x20 => Some(0x0020), // #SPACE
         0x21 => Some(0x0021), // #EXCLAMATION MARK
         0x22 => Some(0x0022), // #QUOTATION MARK
-        0x23 => Some(0x0023), // #NUMBER SIGN
+         /* ~ changed by cargo-mutants ~ */ // #NUMBER SIGN
         0x24 => Some(0x0024), // #DOLLAR SIGN
         0x25 => Some(0x0025), // #PERCENT SIGN
         0x26 => Some(0x0026), // #AMPERSAND
         0x27 => Some(0x0027), // #APOSTROPHE
         0x28 => Some(0x0028), // #LEFT PARENTHESIS
         0x29 => Some(0x0029), // #RIGHT PARENTHESIS
         0x2A => Some(0x002A), // #ASTERISK
         0x2B => Some(0x002B), // #PLUS SIGN

*** result: Success
