*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:467:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -459,17 +459,17 @@
         0x25 => Some(0x0025), // #PERCENT SIGN
         0x26 => Some(0x0026), // #AMPERSAND
         0x27 => Some(0x0027), // #APOSTROPHE
         0x28 => Some(0x0028), // #LEFT PARENTHESIS
         0x29 => Some(0x0029), // #RIGHT PARENTHESIS
         0x2A => Some(0x002A), // #ASTERISK
         0x2B => Some(0x002B), // #PLUS SIGN
         0x2C => Some(0x002C), // #COMMA
-        0x2D => Some(0x002D), // #HYPHEN-MINUS
+         /* ~ changed by cargo-mutants ~ */ // #HYPHEN-MINUS
         0x2E => Some(0x002E), // #FULL STOP
         0x2F => Some(0x002F), // #SOLIDUS
         0x30 => Some(0x0030), // #DIGIT ZERO
         0x31 => Some(0x0031), // #DIGIT ONE
         0x32 => Some(0x0032), // #DIGIT TWO
         0x33 => Some(0x0033), // #DIGIT THREE
         0x34 => Some(0x0034), // #DIGIT FOUR
         0x35 => Some(0x0035), // #DIGIT FIVE

*** result: Success
