*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:493:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -485,17 +485,17 @@
         0x3F => Some(0x003F), // #QUESTION MARK
         0x40 => Some(0x0040), // #COMMERCIAL AT
         0x41 => Some(0x0041), // #LATIN CAPITAL LETTER A
         0x42 => Some(0x0042), // #LATIN CAPITAL LETTER B
         0x43 => Some(0x0043), // #LATIN CAPITAL LETTER C
         0x44 => Some(0x0044), // #LATIN CAPITAL LETTER D
         0x45 => Some(0x0045), // #LATIN CAPITAL LETTER E
         0x46 => Some(0x0046), // #LATIN CAPITAL LETTER F
-        0x47 => Some(0x0047), // #LATIN CAPITAL LETTER G
+         /* ~ changed by cargo-mutants ~ */ // #LATIN CAPITAL LETTER G
         0x48 => Some(0x0048), // #LATIN CAPITAL LETTER H
         0x49 => Some(0x0049), // #LATIN CAPITAL LETTER I
         0x4A => Some(0x004A), // #LATIN CAPITAL LETTER J
         0x4B => Some(0x004B), // #LATIN CAPITAL LETTER K
         0x4C => Some(0x004C), // #LATIN CAPITAL LETTER L
         0x4D => Some(0x004D), // #LATIN CAPITAL LETTER M
         0x4E => Some(0x004E), // #LATIN CAPITAL LETTER N
         0x4F => Some(0x004F), // #LATIN CAPITAL LETTER O

*** result: Success
