*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:51:9: replace <impl Middleware for AltCodeSynthesizerMiddleware<'_>>::name -> &'static str with ""

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ replace <impl Middleware for AltCodeSynthesizerMiddleware<'_>>::name -> &'static str with ""
@@ -43,17 +43,17 @@
             code_buffer: RefCell::new(None),
             enabled_state_provider,
         }
     }
 }
 
 impl Middleware for AltCodeSynthesizerMiddleware<'_> {
     fn name(&self) -> &'static str {
-        "alt_code_synthesizer"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn next(&self, event: Event, dispatch: &mut dyn FnMut(Event)) -> Event {
         match &event.etype {
             EventType::Keyboard(keyboard_event)
                 if self
                     .enabled_state_provider
                     .is_alt_code_synthesizer_enabled() =>

*** result: Success
