*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:530:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -522,17 +522,17 @@
         0x64 => Some(0x0064), // #LATIN SMALL LETTER D
         0x65 => Some(0x0065), // #LATIN SMALL LETTER E
         0x66 => Some(0x0066), // #LATIN SMALL LETTER F
         0x67 => Some(0x0067), // #LATIN SMALL LETTER G
         0x68 => Some(0x0068), // #LATIN SMALL LETTER H
         0x69 => Some(0x0069), // #LATIN SMALL LETTER I
         0x6A => Some(0x006A), // #LATIN SMALL LETTER J
         0x6B => Some(0x006B), // #LATIN SMALL LETTER K
-        0x6C => Some(0x006C), // #LATIN SMALL LETTER L
+         /* ~ changed by cargo-mutants ~ */ // #LATIN SMALL LETTER L
         0x6D => Some(0x006D), // #LATIN SMALL LETTER M
         0x6E => Some(0x006E), // #LATIN SMALL LETTER N
         0x6F => Some(0x006F), // #LATIN SMALL LETTER O
         0x70 => Some(0x0070), // #LATIN SMALL LETTER P
         0x71 => Some(0x0071), // #LATIN SMALL LETTER Q
         0x72 => Some(0x0072), // #LATIN SMALL LETTER R
         0x73 => Some(0x0073), // #LATIN SMALL LETTER S
         0x74 => Some(0x0074), // #LATIN SMALL LETTER T

*** result: Success
