*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:540:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -532,17 +532,17 @@
         0x6E => Some(0x006E), // #LATIN SMALL LETTER N
         0x6F => Some(0x006F), // #LATIN SMALL LETTER O
         0x70 => Some(0x0070), // #LATIN SMALL LETTER P
         0x71 => Some(0x0071), // #LATIN SMALL LETTER Q
         0x72 => Some(0x0072), // #LATIN SMALL LETTER R
         0x73 => Some(0x0073), // #LATIN SMALL LETTER S
         0x74 => Some(0x0074), // #LATIN SMALL LETTER T
         0x75 => Some(0x0075), // #LATIN SMALL LETTER U
-        0x76 => Some(0x0076), // #LATIN SMALL LETTER V
+         /* ~ changed by cargo-mutants ~ */ // #LATIN SMALL LETTER V
         0x77 => Some(0x0077), // #LATIN SMALL LETTER W
         0x78 => Some(0x0078), // #LATIN SMALL LETTER X
         0x79 => Some(0x0079), // #LATIN SMALL LETTER Y
         0x7A => Some(0x007A), // #LATIN SMALL LETTER Z
         0x7B => Some(0x007B), // #LEFT CURLY BRACKET
         0x7C => Some(0x007C), // #VERTICAL LINE
         0x7D => Some(0x007D), // #RIGHT CURLY BRACKET
         0x7E => Some(0x007E), // #TILDE

*** result: Success
