*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:557:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -549,17 +549,17 @@
         0x7F => Some(0x007F), // #DELETE
         0x80 => Some(0x20AC), // #EURO SIGN
         0x82 => Some(0x201A), // #SINGLE LOW-9 QUOTATION MARK
         0x83 => Some(0x0192), // #LATIN SMALL LETTER F WITH HOOK
         0x84 => Some(0x201E), // #DOUBLE LOW-9 QUOTATION MARK
         0x85 => Some(0x2026), // #HORIZONTAL ELLIPSIS
         0x86 => Some(0x2020), // #DAGGER
         0x87 => Some(0x2021), // #DOUBLE DAGGER
-        0x88 => Some(0x02C6), // #MODIFIER LETTER CIRCUMFLEX ACCENT
+         /* ~ changed by cargo-mutants ~ */ // #MODIFIER LETTER CIRCUMFLEX ACCENT
         0x89 => Some(0x2030), // #PER MILLE SIGN
         0x8A => Some(0x0160), // #LATIN CAPITAL LETTER S WITH CARON
         0x8B => Some(0x2039), // #SINGLE LEFT-POINTING ANGLE QUOTATION MARK
         0x8C => Some(0x0152), // #LATIN CAPITAL LIGATURE OE
         0x8E => Some(0x017D), // #LATIN CAPITAL LETTER Z WITH CARON
         0x91 => Some(0x2018), // #LEFT SINGLE QUOTATION MARK
         0x92 => Some(0x2019), // #RIGHT SINGLE QUOTATION MARK
         0x93 => Some(0x201C), // #LEFT DOUBLE QUOTATION MARK

*** result: Success
