*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:57:20: replace match guard with true

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ replace match guard with true
@@ -49,19 +49,17 @@
 impl Middleware for AltCodeSynthesizerMiddleware<'_> {
     fn name(&self) -> &'static str {
         "alt_code_synthesizer"
     }
 
     fn next(&self, event: Event, dispatch: &mut dyn FnMut(Event)) -> Event {
         match &event.etype {
             EventType::Keyboard(keyboard_event)
-                if self
-                    .enabled_state_provider
-                    .is_alt_code_synthesizer_enabled() =>
+                if true /* ~ changed by cargo-mutants ~ */ =>
             {
                 let mut code_buffer = self.code_buffer.borrow_mut();
 
                 if keyboard_event.status == Status::Pressed {
                     if let Key::Alt = &keyboard_event.key {
                         *code_buffer = Some(String::new());
                     } else if let Some(buffer) = &mut *code_buffer {
                         match keyboard_event.key {

*** result: Success
