*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:587:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -579,17 +579,17 @@
         0xA2 => Some(0x00A2), // #CENT SIGN
         0xA3 => Some(0x00A3), // #POUND SIGN
         0xA4 => Some(0x00A4), // #CURRENCY SIGN
         0xA5 => Some(0x00A5), // #YEN SIGN
         0xA6 => Some(0x00A6), // #BROKEN BAR
         0xA7 => Some(0x00A7), // #SECTION SIGN
         0xA8 => Some(0x00A8), // #DIAERESIS
         0xA9 => Some(0x00A9), // #COPYRIGHT SIGN
-        0xAA => Some(0x00AA), // #FEMININE ORDINAL INDICATOR
+         /* ~ changed by cargo-mutants ~ */ // #FEMININE ORDINAL INDICATOR
         0xAB => Some(0x00AB), // #LEFT-POINTING DOUBLE ANGLE QUOTATION MARK
         0xAC => Some(0x00AC), // #NOT SIGN
         0xAD => Some(0x00AD), // #SOFT HYPHEN
         0xAE => Some(0x00AE), // #REGISTERED SIGN
         0xAF => Some(0x00AF), // #MACRON
         0xB0 => Some(0x00B0), // #DEGREE SIGN
         0xB1 => Some(0x00B1), // #PLUS-MINUS SIGN
         0xB2 => Some(0x00B2), // #SUPERSCRIPT TWO

*** result: Success
