*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:601:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -593,17 +593,17 @@
         0xB0 => Some(0x00B0), // #DEGREE SIGN
         0xB1 => Some(0x00B1), // #PLUS-MINUS SIGN
         0xB2 => Some(0x00B2), // #SUPERSCRIPT TWO
         0xB3 => Some(0x00B3), // #SUPERSCRIPT THREE
         0xB4 => Some(0x00B4), // #ACUTE ACCENT
         0xB5 => Some(0x00B5), // #MICRO SIGN
         0xB6 => Some(0x00B6), // #PILCROW SIGN
         0xB7 => Some(0x00B7), // #MIDDLE DOT
-        0xB8 => Some(0x00B8), // #CEDILLA
+         /* ~ changed by cargo-mutants ~ */ // #CEDILLA
         0xB9 => Some(0x00B9), // #SUPERSCRIPT ONE
         0xBA => Some(0x00BA), // #MASCULINE ORDINAL INDICATOR
         0xBB => Some(0x00BB), // #RIGHT-POINTING DOUBLE ANGLE QUOTATION MARK
         0xBC => Some(0x00BC), // #VULGAR FRACTION ONE QUARTER
         0xBD => Some(0x00BD), // #VULGAR FRACTION ONE HALF
         0xBE => Some(0x00BE), // #VULGAR FRACTION THREE QUARTERS
         0xBF => Some(0x00BF), // #INVERTED QUESTION MARK
         0xC0 => Some(0x00C0), // #LATIN CAPITAL LETTER A WITH GRAVE

*** result: Success
