*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:613:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -605,17 +605,17 @@
         0xBC => Some(0x00BC), // #VULGAR FRACTION ONE QUARTER
         0xBD => Some(0x00BD), // #VULGAR FRACTION ONE HALF
         0xBE => Some(0x00BE), // #VULGAR FRACTION THREE QUARTERS
         0xBF => Some(0x00BF), // #INVERTED QUESTION MARK
         0xC0 => Some(0x00C0), // #LATIN CAPITAL LETTER A WITH GRAVE
         0xC1 => Some(0x00C1), // #LATIN CAPITAL LETTER A WITH ACUTE
         0xC2 => Some(0x00C2), // #LATIN CAPITAL LETTER A WITH CIRCUMFLEX
         0xC3 => Some(0x00C3), // #LATIN CAPITAL LETTER A WITH TILDE
-        0xC4 => Some(0x00C4), // #LATIN CAPITAL LETTER A WITH DIAERESIS
+         /* ~ changed by cargo-mutants ~ */ // #LATIN CAPITAL LETTER A WITH DIAERESIS
         0xC5 => Some(0x00C5), // #LATIN CAPITAL LETTER A WITH RING ABOVE
         0xC6 => Some(0x00C6), // #LATIN CAPITAL LETTER AE
         0xC7 => Some(0x00C7), // #LATIN CAPITAL LETTER C WITH CEDILLA
         0xC8 => Some(0x00C8), // #LATIN CAPITAL LETTER E WITH GRAVE
         0xC9 => Some(0x00C9), // #LATIN CAPITAL LETTER E WITH ACUTE
         0xCA => Some(0x00CA), // #LATIN CAPITAL LETTER E WITH CIRCUMFLEX
         0xCB => Some(0x00CB), // #LATIN CAPITAL LETTER E WITH DIAERESIS
         0xCC => Some(0x00CC), // #LATIN CAPITAL LETTER I WITH GRAVE

*** result: Success
