*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:617:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -609,17 +609,17 @@
         0xC0 => Some(0x00C0), // #LATIN CAPITAL LETTER A WITH GRAVE
         0xC1 => Some(0x00C1), // #LATIN CAPITAL LETTER A WITH ACUTE
         0xC2 => Some(0x00C2), // #LATIN CAPITAL LETTER A WITH CIRCUMFLEX
         0xC3 => Some(0x00C3), // #LATIN CAPITAL LETTER A WITH TILDE
         0xC4 => Some(0x00C4), // #LATIN CAPITAL LETTER A WITH DIAERESIS
         0xC5 => Some(0x00C5), // #LATIN CAPITAL LETTER A WITH RING ABOVE
         0xC6 => Some(0x00C6), // #LATIN CAPITAL LETTER AE
         0xC7 => Some(0x00C7), // #LATIN CAPITAL LETTER C WITH CEDILLA
-        0xC8 => Some(0x00C8), // #LATIN CAPITAL LETTER E WITH GRAVE
+         /* ~ changed by cargo-mutants ~ */ // #LATIN CAPITAL LETTER E WITH GRAVE
         0xC9 => Some(0x00C9), // #LATIN CAPITAL LETTER E WITH ACUTE
         0xCA => Some(0x00CA), // #LATIN CAPITAL LETTER E WITH CIRCUMFLEX
         0xCB => Some(0x00CB), // #LATIN CAPITAL LETTER E WITH DIAERESIS
         0xCC => Some(0x00CC), // #LATIN CAPITAL LETTER I WITH GRAVE
         0xCD => Some(0x00CD), // #LATIN CAPITAL LETTER I WITH ACUTE
         0xCE => Some(0x00CE), // #LATIN CAPITAL LETTER I WITH CIRCUMFLEX
         0xCF => Some(0x00CF), // #LATIN CAPITAL LETTER I WITH DIAERESIS
         0xD0 => Some(0x00D0), // #LATIN CAPITAL LETTER ETH

*** result: Success
