*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:621:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -613,17 +613,17 @@
         0xC4 => Some(0x00C4), // #LATIN CAPITAL LETTER A WITH DIAERESIS
         0xC5 => Some(0x00C5), // #LATIN CAPITAL LETTER A WITH RING ABOVE
         0xC6 => Some(0x00C6), // #LATIN CAPITAL LETTER AE
         0xC7 => Some(0x00C7), // #LATIN CAPITAL LETTER C WITH CEDILLA
         0xC8 => Some(0x00C8), // #LATIN CAPITAL LETTER E WITH GRAVE
         0xC9 => Some(0x00C9), // #LATIN CAPITAL LETTER E WITH ACUTE
         0xCA => Some(0x00CA), // #LATIN CAPITAL LETTER E WITH CIRCUMFLEX
         0xCB => Some(0x00CB), // #LATIN CAPITAL LETTER E WITH DIAERESIS
-        0xCC => Some(0x00CC), // #LATIN CAPITAL LETTER I WITH GRAVE
+         /* ~ changed by cargo-mutants ~ */ // #LATIN CAPITAL LETTER I WITH GRAVE
         0xCD => Some(0x00CD), // #LATIN CAPITAL LETTER I WITH ACUTE
         0xCE => Some(0x00CE), // #LATIN CAPITAL LETTER I WITH CIRCUMFLEX
         0xCF => Some(0x00CF), // #LATIN CAPITAL LETTER I WITH DIAERESIS
         0xD0 => Some(0x00D0), // #LATIN CAPITAL LETTER ETH
         0xD1 => Some(0x00D1), // #LATIN CAPITAL LETTER N WITH TILDE
         0xD2 => Some(0x00D2), // #LATIN CAPITAL LETTER O WITH GRAVE
         0xD3 => Some(0x00D3), // #LATIN CAPITAL LETTER O WITH ACUTE
         0xD4 => Some(0x00D4), // #LATIN CAPITAL LETTER O WITH CIRCUMFLEX

*** result: Success
