*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:627:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -619,17 +619,17 @@
         0xCA => Some(0x00CA), // #LATIN CAPITAL LETTER E WITH CIRCUMFLEX
         0xCB => Some(0x00CB), // #LATIN CAPITAL LETTER E WITH DIAERESIS
         0xCC => Some(0x00CC), // #LATIN CAPITAL LETTER I WITH GRAVE
         0xCD => Some(0x00CD), // #LATIN CAPITAL LETTER I WITH ACUTE
         0xCE => Some(0x00CE), // #LATIN CAPITAL LETTER I WITH CIRCUMFLEX
         0xCF => Some(0x00CF), // #LATIN CAPITAL LETTER I WITH DIAERESIS
         0xD0 => Some(0x00D0), // #LATIN CAPITAL LETTER ETH
         0xD1 => Some(0x00D1), // #LATIN CAPITAL LETTER N WITH TILDE
-        0xD2 => Some(0x00D2), // #LATIN CAPITAL LETTER O WITH GRAVE
+         /* ~ changed by cargo-mutants ~ */ // #LATIN CAPITAL LETTER O WITH GRAVE
         0xD3 => Some(0x00D3), // #LATIN CAPITAL LETTER O WITH ACUTE
         0xD4 => Some(0x00D4), // #LATIN CAPITAL LETTER O WITH CIRCUMFLEX
         0xD5 => Some(0x00D5), // #LATIN CAPITAL LETTER O WITH TILDE
         0xD6 => Some(0x00D6), // #LATIN CAPITAL LETTER O WITH DIAERESIS
         0xD7 => Some(0x00D7), // #MULTIPLICATION SIGN
         0xD8 => Some(0x00D8), // #LATIN CAPITAL LETTER O WITH STROKE
         0xD9 => Some(0x00D9), // #LATIN CAPITAL LETTER U WITH GRAVE
         0xDA => Some(0x00DA), // #LATIN CAPITAL LETTER U WITH ACUTE

*** result: Success
