*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:644:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -636,17 +636,17 @@
         0xDB => Some(0x00DB), // #LATIN CAPITAL LETTER U WITH CIRCUMFLEX
         0xDC => Some(0x00DC), // #LATIN CAPITAL LETTER U WITH DIAERESIS
         0xDD => Some(0x00DD), // #LATIN CAPITAL LETTER Y WITH ACUTE
         0xDE => Some(0x00DE), // #LATIN CAPITAL LETTER THORN
         0xDF => Some(0x00DF), // #LATIN SMALL LETTER SHARP S
         0xE0 => Some(0x00E0), // #LATIN SMALL LETTER A WITH GRAVE
         0xE1 => Some(0x00E1), // #LATIN SMALL LETTER A WITH ACUTE
         0xE2 => Some(0x00E2), // #LATIN SMALL LETTER A WITH CIRCUMFLEX
-        0xE3 => Some(0x00E3), // #LATIN SMALL LETTER A WITH TILDE
+         /* ~ changed by cargo-mutants ~ */ // #LATIN SMALL LETTER A WITH TILDE
         0xE4 => Some(0x00E4), // #LATIN SMALL LETTER A WITH DIAERESIS
         0xE5 => Some(0x00E5), // #LATIN SMALL LETTER A WITH RING ABOVE
         0xE6 => Some(0x00E6), // #LATIN SMALL LETTER AE
         0xE7 => Some(0x00E7), // #LATIN SMALL LETTER C WITH CEDILLA
         0xE8 => Some(0x00E8), // #LATIN SMALL LETTER E WITH GRAVE
         0xE9 => Some(0x00E9), // #LATIN SMALL LETTER E WITH ACUTE
         0xEA => Some(0x00EA), // #LATIN SMALL LETTER E WITH CIRCUMFLEX
         0xEB => Some(0x00EB), // #LATIN SMALL LETTER E WITH DIAERESIS

*** result: Success
