*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:658:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -650,17 +650,17 @@
         0xE9 => Some(0x00E9), // #LATIN SMALL LETTER E WITH ACUTE
         0xEA => Some(0x00EA), // #LATIN SMALL LETTER E WITH CIRCUMFLEX
         0xEB => Some(0x00EB), // #LATIN SMALL LETTER E WITH DIAERESIS
         0xEC => Some(0x00EC), // #LATIN SMALL LETTER I WITH GRAVE
         0xED => Some(0x00ED), // #LATIN SMALL LETTER I WITH ACUTE
         0xEE => Some(0x00EE), // #LATIN SMALL LETTER I WITH CIRCUMFLEX
         0xEF => Some(0x00EF), // #LATIN SMALL LETTER I WITH DIAERESIS
         0xF0 => Some(0x00F0), // #LATIN SMALL LETTER ETH
-        0xF1 => Some(0x00F1), // #LATIN SMALL LETTER N WITH TILDE
+         /* ~ changed by cargo-mutants ~ */ // #LATIN SMALL LETTER N WITH TILDE
         0xF2 => Some(0x00F2), // #LATIN SMALL LETTER O WITH GRAVE
         0xF3 => Some(0x00F3), // #LATIN SMALL LETTER O WITH ACUTE
         0xF4 => Some(0x00F4), // #LATIN SMALL LETTER O WITH CIRCUMFLEX
         0xF5 => Some(0x00F5), // #LATIN SMALL LETTER O WITH TILDE
         0xF6 => Some(0x00F6), // #LATIN SMALL LETTER O WITH DIAERESIS
         0xF7 => Some(0x00F7), // #DIVISION SIGN
         0xF8 => Some(0x00F8), // #LATIN SMALL LETTER O WITH STROKE
         0xF9 => Some(0x00F9), // #LATIN SMALL LETTER U WITH GRAVE

*** result: Success
