*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:663:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -655,17 +655,17 @@
         0xEE => Some(0x00EE), // #LATIN SMALL LETTER I WITH CIRCUMFLEX
         0xEF => Some(0x00EF), // #LATIN SMALL LETTER I WITH DIAERESIS
         0xF0 => Some(0x00F0), // #LATIN SMALL LETTER ETH
         0xF1 => Some(0x00F1), // #LATIN SMALL LETTER N WITH TILDE
         0xF2 => Some(0x00F2), // #LATIN SMALL LETTER O WITH GRAVE
         0xF3 => Some(0x00F3), // #LATIN SMALL LETTER O WITH ACUTE
         0xF4 => Some(0x00F4), // #LATIN SMALL LETTER O WITH CIRCUMFLEX
         0xF5 => Some(0x00F5), // #LATIN SMALL LETTER O WITH TILDE
-        0xF6 => Some(0x00F6), // #LATIN SMALL LETTER O WITH DIAERESIS
+         /* ~ changed by cargo-mutants ~ */ // #LATIN SMALL LETTER O WITH DIAERESIS
         0xF7 => Some(0x00F7), // #DIVISION SIGN
         0xF8 => Some(0x00F8), // #LATIN SMALL LETTER O WITH STROKE
         0xF9 => Some(0x00F9), // #LATIN SMALL LETTER U WITH GRAVE
         0xFA => Some(0x00FA), // #LATIN SMALL LETTER U WITH ACUTE
         0xFB => Some(0x00FB), // #LATIN SMALL LETTER U WITH CIRCUMFLEX
         0xFC => Some(0x00FC), // #LATIN SMALL LETTER U WITH DIAERESIS
         0xFD => Some(0x00FD), // #LATIN SMALL LETTER Y WITH ACUTE
         0xFE => Some(0x00FE), // #LATIN SMALL LETTER THORN

*** result: Success
