*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:669:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -661,15 +661,15 @@
         0xF4 => Some(0x00F4), // #LATIN SMALL LETTER O WITH CIRCUMFLEX
         0xF5 => Some(0x00F5), // #LATIN SMALL LETTER O WITH TILDE
         0xF6 => Some(0x00F6), // #LATIN SMALL LETTER O WITH DIAERESIS
         0xF7 => Some(0x00F7), // #DIVISION SIGN
         0xF8 => Some(0x00F8), // #LATIN SMALL LETTER O WITH STROKE
         0xF9 => Some(0x00F9), // #LATIN SMALL LETTER U WITH GRAVE
         0xFA => Some(0x00FA), // #LATIN SMALL LETTER U WITH ACUTE
         0xFB => Some(0x00FB), // #LATIN SMALL LETTER U WITH CIRCUMFLEX
-        0xFC => Some(0x00FC), // #LATIN SMALL LETTER U WITH DIAERESIS
+         /* ~ changed by cargo-mutants ~ */ // #LATIN SMALL LETTER U WITH DIAERESIS
         0xFD => Some(0x00FD), // #LATIN SMALL LETTER Y WITH ACUTE
         0xFE => Some(0x00FE), // #LATIN SMALL LETTER THORN
         0xFF => Some(0x00FF), // #LATIN SMALL LETTER Y WITH DIAERESIS
         _ => None,
     }
 }

*** result: Success
