*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:68:29: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -60,17 +60,17 @@
             {
                 let mut code_buffer = self.code_buffer.borrow_mut();
 
                 if keyboard_event.status == Status::Pressed {
                     if let Key::Alt = &keyboard_event.key {
                         *code_buffer = Some(String::new());
                     } else if let Some(buffer) = &mut *code_buffer {
                         match keyboard_event.key {
-                            Key::Numpad0 => buffer.push('0'),
+                             /* ~ changed by cargo-mutants ~ */
                             Key::Numpad1 => buffer.push('1'),
                             Key::Numpad2 => buffer.push('2'),
                             Key::Numpad3 => buffer.push('3'),
                             Key::Numpad4 => buffer.push('4'),
                             Key::Numpad5 => buffer.push('5'),
                             Key::Numpad6 => buffer.push('6'),
                             Key::Numpad7 => buffer.push('7'),
                             Key::Numpad8 => buffer.push('8'),

*** result: Success
