*** espanso-engine/src/process/middleware/alt_code_synthesizer.rs:76:29: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/alt_code_synthesizer.rs
+++ delete match arm
@@ -68,17 +68,17 @@
                             Key::Numpad0 => buffer.push('0'),
                             Key::Numpad1 => buffer.push('1'),
                             Key::Numpad2 => buffer.push('2'),
                             Key::Numpad3 => buffer.push('3'),
                             Key::Numpad4 => buffer.push('4'),
                             Key::Numpad5 => buffer.push('5'),
                             Key::Numpad6 => buffer.push('6'),
                             Key::Numpad7 => buffer.push('7'),
-                            Key::Numpad8 => buffer.push('8'),
+                             /* ~ changed by cargo-mutants ~ */
                             Key::Numpad9 => buffer.push('9'),
                             _ => {}
                         }
                     }
                 } else if keyboard_event.key == Key::Alt {
                     if let Some(codes) = &*code_buffer {
                         if let Some(target_char) = convert_buffer_into_char(codes) {
                             dispatch(Event::caused_by(

*** result: Success
