*** espanso-engine/src/process/middleware/context_menu.rs:131:13: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/context_menu.rs
+++ delete match arm
@@ -123,69 +123,17 @@
                 Event::caused_by(
                     event.source_id,
                     EventType::ShowContextMenu(ShowContextMenuEvent {
                         // TODO: add actual entries
                         items,
                     }),
                 )
             }
-            EventType::ContextMenuClicked(context_click_event) => {
-                match context_click_event.context_item_id {
-                    CONTEXT_ITEM_EXIT => Event::caused_by(
-                        event.source_id,
-                        EventType::ExitRequested(ExitMode::ExitAllProcesses),
-                    ),
-                    CONTEXT_ITEM_RELOAD => Event::caused_by(
-                        event.source_id,
-                        EventType::ExitRequested(ExitMode::RestartWorker),
-                    ),
-                    CONTEXT_ITEM_ENABLE => {
-                        dispatch(Event::caused_by(event.source_id, EventType::EnableRequest));
-                        Event::caused_by(event.source_id, EventType::NOOP)
-                    }
-                    CONTEXT_ITEM_DISABLE => {
-                        dispatch(Event::caused_by(event.source_id, EventType::DisableRequest));
-                        Event::caused_by(event.source_id, EventType::NOOP)
-                    }
-                    CONTEXT_ITEM_SECURE_INPUT_EXPLAIN => {
-                        dispatch(Event::caused_by(
-                            event.source_id,
-                            EventType::DisplaySecureInputTroubleshoot,
-                        ));
-                        Event::caused_by(event.source_id, EventType::NOOP)
-                    }
-                    CONTEXT_ITEM_SECURE_INPUT_TRIGGER_WORKAROUND => {
-                        dispatch(Event::caused_by(
-                            event.source_id,
-                            EventType::LaunchSecureInputAutoFix,
-                        ));
-                        Event::caused_by(event.source_id, EventType::NOOP)
-                    }
-                    CONTEXT_ITEM_OPEN_SEARCH => {
-                        dispatch(Event::caused_by(event.source_id, EventType::ShowSearchBar));
-                        Event::caused_by(event.source_id, EventType::NOOP)
-                    }
-                    CONTEXT_ITEM_SHOW_LOGS => {
-                        dispatch(Event::caused_by(event.source_id, EventType::ShowLogs));
-                        Event::caused_by(event.source_id, EventType::NOOP)
-                    }
-                    CONTEXT_ITEM_OPEN_CONFIG_FOLDER => {
-                        dispatch(Event::caused_by(
-                            event.source_id,
-                            EventType::ShowConfigFolder,
-                        ));
-                        Event::caused_by(event.source_id, EventType::NOOP)
-                    }
-                    _ => {
-                        // TODO: handle dynamic items
-                        todo!()
-                    }
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             EventType::Disabled => {
                 *is_enabled = false;
                 event
             }
             EventType::Enabled => {
                 *is_enabled = true;
                 event
             }

*** result: Success
