*** espanso-engine/src/process/middleware/context_menu.rs:149:21: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/context_menu.rs
+++ delete match arm
@@ -141,23 +141,17 @@
                     CONTEXT_ITEM_ENABLE => {
                         dispatch(Event::caused_by(event.source_id, EventType::EnableRequest));
                         Event::caused_by(event.source_id, EventType::NOOP)
                     }
                     CONTEXT_ITEM_DISABLE => {
                         dispatch(Event::caused_by(event.source_id, EventType::DisableRequest));
                         Event::caused_by(event.source_id, EventType::NOOP)
                     }
-                    CONTEXT_ITEM_SECURE_INPUT_EXPLAIN => {
-                        dispatch(Event::caused_by(
-                            event.source_id,
-                            EventType::DisplaySecureInputTroubleshoot,
-                        ));
-                        Event::caused_by(event.source_id, EventType::NOOP)
-                    }
+                     /* ~ changed by cargo-mutants ~ */
                     CONTEXT_ITEM_SECURE_INPUT_TRIGGER_WORKAROUND => {
                         dispatch(Event::caused_by(
                             event.source_id,
                             EventType::LaunchSecureInputAutoFix,
                         ));
                         Event::caused_by(event.source_id, EventType::NOOP)
                     }
                     CONTEXT_ITEM_OPEN_SEARCH => {

*** result: Success
