*** espanso-engine/src/process/middleware/context_menu.rs:156:21: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/context_menu.rs
+++ delete match arm
@@ -148,23 +148,17 @@
                     }
                     CONTEXT_ITEM_SECURE_INPUT_EXPLAIN => {
                         dispatch(Event::caused_by(
                             event.source_id,
                             EventType::DisplaySecureInputTroubleshoot,
                         ));
                         Event::caused_by(event.source_id, EventType::NOOP)
                     }
-                    CONTEXT_ITEM_SECURE_INPUT_TRIGGER_WORKAROUND => {
-                        dispatch(Event::caused_by(
-                            event.source_id,
-                            EventType::LaunchSecureInputAutoFix,
-                        ));
-                        Event::caused_by(event.source_id, EventType::NOOP)
-                    }
+                     /* ~ changed by cargo-mutants ~ */
                     CONTEXT_ITEM_OPEN_SEARCH => {
                         dispatch(Event::caused_by(event.source_id, EventType::ShowSearchBar));
                         Event::caused_by(event.source_id, EventType::NOOP)
                     }
                     CONTEXT_ITEM_SHOW_LOGS => {
                         dispatch(Event::caused_by(event.source_id, EventType::ShowLogs));
                         Event::caused_by(event.source_id, EventType::NOOP)
                     }

*** result: Success
