*** espanso-engine/src/process/middleware/context_menu.rs:163:21: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/context_menu.rs
+++ delete match arm
@@ -155,20 +155,17 @@
                     }
                     CONTEXT_ITEM_SECURE_INPUT_TRIGGER_WORKAROUND => {
                         dispatch(Event::caused_by(
                             event.source_id,
                             EventType::LaunchSecureInputAutoFix,
                         ));
                         Event::caused_by(event.source_id, EventType::NOOP)
                     }
-                    CONTEXT_ITEM_OPEN_SEARCH => {
-                        dispatch(Event::caused_by(event.source_id, EventType::ShowSearchBar));
-                        Event::caused_by(event.source_id, EventType::NOOP)
-                    }
+                     /* ~ changed by cargo-mutants ~ */
                     CONTEXT_ITEM_SHOW_LOGS => {
                         dispatch(Event::caused_by(event.source_id, EventType::ShowLogs));
                         Event::caused_by(event.source_id, EventType::NOOP)
                     }
                     CONTEXT_ITEM_OPEN_CONFIG_FOLDER => {
                         dispatch(Event::caused_by(
                             event.source_id,
                             EventType::ShowConfigFolder,

*** result: Success
