*** espanso-engine/src/process/middleware/context_menu.rs:167:21: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/context_menu.rs
+++ delete match arm
@@ -159,20 +159,17 @@
                             EventType::LaunchSecureInputAutoFix,
                         ));
                         Event::caused_by(event.source_id, EventType::NOOP)
                     }
                     CONTEXT_ITEM_OPEN_SEARCH => {
                         dispatch(Event::caused_by(event.source_id, EventType::ShowSearchBar));
                         Event::caused_by(event.source_id, EventType::NOOP)
                     }
-                    CONTEXT_ITEM_SHOW_LOGS => {
-                        dispatch(Event::caused_by(event.source_id, EventType::ShowLogs));
-                        Event::caused_by(event.source_id, EventType::NOOP)
-                    }
+                     /* ~ changed by cargo-mutants ~ */
                     CONTEXT_ITEM_OPEN_CONFIG_FOLDER => {
                         dispatch(Event::caused_by(
                             event.source_id,
                             EventType::ShowConfigFolder,
                         ));
                         Event::caused_by(event.source_id, EventType::NOOP)
                     }
                     _ => {

*** result: Success
