*** espanso-engine/src/process/middleware/context_menu.rs:184:13: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/context_menu.rs
+++ delete match arm
@@ -176,20 +176,17 @@
                         Event::caused_by(event.source_id, EventType::NOOP)
                     }
                     _ => {
                         // TODO: handle dynamic items
                         todo!()
                     }
                 }
             }
-            EventType::Disabled => {
-                *is_enabled = false;
-                event
-            }
+             /* ~ changed by cargo-mutants ~ */
             EventType::Enabled => {
                 *is_enabled = true;
                 event
             }
             EventType::SecureInputEnabled(_) => {
                 *is_secure_input_enabled = true;
                 event
             }

*** result: Success
