*** espanso-engine/src/process/middleware/context_menu.rs:188:13: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/context_menu.rs
+++ delete match arm
@@ -180,20 +180,17 @@
                         todo!()
                     }
                 }
             }
             EventType::Disabled => {
                 *is_enabled = false;
                 event
             }
-            EventType::Enabled => {
-                *is_enabled = true;
-                event
-            }
+             /* ~ changed by cargo-mutants ~ */
             EventType::SecureInputEnabled(_) => {
                 *is_secure_input_enabled = true;
                 event
             }
             EventType::SecureInputDisabled => {
                 *is_secure_input_enabled = false;
                 event
             }

*** result: Success
