*** espanso-engine/src/process/middleware/delay_modifiers.rs:51:9: replace <impl Middleware for DelayForModifierReleaseMiddleware<'_>>::name -> &'static str with "xyzzy"

*** mutation diff:
--- espanso-engine/src/process/middleware/delay_modifiers.rs
+++ replace <impl Middleware for DelayForModifierReleaseMiddleware<'_>>::name -> &'static str with "xyzzy"
@@ -43,17 +43,17 @@
 impl<'a> DelayForModifierReleaseMiddleware<'a> {
     pub fn new(provider: &'a dyn ModifierStatusProvider) -> Self {
         Self { provider }
     }
 }
 
 impl Middleware for DelayForModifierReleaseMiddleware<'_> {
     fn name(&self) -> &'static str {
-        "delay_modifiers"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn next(&self, event: Event, _: &mut dyn FnMut(Event)) -> Event {
         if is_injection_event(&event.etype) {
             let start = Instant::now();
             while self.provider.is_any_conflicting_modifier_pressed() {
                 if Instant::now().duration_since(start) > MODIFIER_DELAY_TIMEOUT {
                     warn!("injection delay has timed out, please release the modifier keys (SHIFT, CTRL, ALT, CMD) to trigger an expansion");

*** result: Success
