*** espanso-engine/src/process/middleware/delay_modifiers.rs:58:57: replace > with < in <impl Middleware for DelayForModifierReleaseMiddleware<'_>>::next

*** mutation diff:
--- espanso-engine/src/process/middleware/delay_modifiers.rs
+++ replace > with < in <impl Middleware for DelayForModifierReleaseMiddleware<'_>>::next
@@ -50,17 +50,17 @@
     fn name(&self) -> &'static str {
         "delay_modifiers"
     }
 
     fn next(&self, event: Event, _: &mut dyn FnMut(Event)) -> Event {
         if is_injection_event(&event.etype) {
             let start = Instant::now();
             while self.provider.is_any_conflicting_modifier_pressed() {
-                if Instant::now().duration_since(start) > MODIFIER_DELAY_TIMEOUT {
+                if Instant::now().duration_since(start) < /* ~ changed by cargo-mutants ~ */ MODIFIER_DELAY_TIMEOUT {
                     warn!("injection delay has timed out, please release the modifier keys (SHIFT, CTRL, ALT, CMD) to trigger an expansion");
                     break;
                 }
 
                 // TODO: here we might show a popup window to tell the users to release those keys
 
                 trace!("delaying injection event as some modifiers are pressed");
                 std::thread::sleep(Duration::from_millis(100));

*** result: Success
