*** espanso-engine/src/process/middleware/delay_modifiers.rs:75:5: replace is_injection_event -> bool with true

*** mutation diff:
--- espanso-engine/src/process/middleware/delay_modifiers.rs
+++ replace is_injection_event -> bool with true
@@ -67,19 +67,10 @@
             }
         }
 
         event
     }
 }
 
 fn is_injection_event(event_type: &EventType) -> bool {
-    matches!(
-        event_type,
-        EventType::TriggerCompensation(_)
-            | EventType::CursorHintCompensation(_)
-            | EventType::KeySequenceInject(_)
-            | EventType::TextInject(_)
-            | EventType::ImageInject(_)
-            | EventType::HtmlInject(_)
-            | EventType::MarkdownInject(_)
-    )
+    true /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
