*** espanso-engine/src/process/middleware/disable.rs:128:5: replace is_toggle_key -> bool with true

*** mutation diff:
--- espanso-engine/src/process/middleware/disable.rs
+++ replace is_toggle_key -> bool with true
@@ -120,22 +120,10 @@
         }
         // TODO: also ignore hotkey and mouse events
 
         event
     }
 }
 
 fn is_toggle_key(event: &KeyboardEvent, options: &DisableOptions) -> bool {
-    if options
-        .toggle_key
-        .as_ref()
-        .is_some_and(|key| key == &event.key)
-    {
-        if let (Some(variant), Some(e_variant)) = (&options.toggle_key_variant, &event.variant) {
-            variant == e_variant
-        } else {
-            true
-        }
-    } else {
-        false
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
