*** espanso-engine/src/process/middleware/disable.rs:131:32: replace == with != in is_toggle_key

*** mutation diff:
--- espanso-engine/src/process/middleware/disable.rs
+++ replace == with != in is_toggle_key
@@ -123,17 +123,17 @@
         event
     }
 }
 
 fn is_toggle_key(event: &KeyboardEvent, options: &DisableOptions) -> bool {
     if options
         .toggle_key
         .as_ref()
-        .is_some_and(|key| key == &event.key)
+        .is_some_and(|key| key != /* ~ changed by cargo-mutants ~ */ &event.key)
     {
         if let (Some(variant), Some(e_variant)) = (&options.toggle_key_variant, &event.variant) {
             variant == e_variant
         } else {
             true
         }
     } else {
         false

*** result: Success
