*** espanso-engine/src/process/middleware/disable.rs:134:21: replace == with != in is_toggle_key

*** mutation diff:
--- espanso-engine/src/process/middleware/disable.rs
+++ replace == with != in is_toggle_key
@@ -126,16 +126,16 @@
 
 fn is_toggle_key(event: &KeyboardEvent, options: &DisableOptions) -> bool {
     if options
         .toggle_key
         .as_ref()
         .is_some_and(|key| key == &event.key)
     {
         if let (Some(variant), Some(e_variant)) = (&options.toggle_key_variant, &event.variant) {
-            variant == e_variant
+            variant != /* ~ changed by cargo-mutants ~ */ e_variant
         } else {
             true
         }
     } else {
         false
     }
 }

*** result: Success
