*** espanso-engine/src/process/middleware/disable.rs:66:13: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/disable.rs
+++ delete match arm
@@ -58,38 +58,17 @@
         "disable"
     }
 
     fn next(&self, event: Event, dispatch: &mut dyn FnMut(Event)) -> Event {
         let mut has_status_changed = false;
         let mut enabled = self.enabled.borrow_mut();
 
         match &event.etype {
-            EventType::Keyboard(m_event) => {
-                if m_event.status == Status::Released {
-                    let mut last_toggle_press = self.last_toggle_press.borrow_mut();
-                    if is_toggle_key(m_event, &self.options) {
-                        if let Some(previous_press) = *last_toggle_press {
-                            if previous_press.elapsed() < self.options.toggle_key_maximum_window {
-                                *enabled = !*enabled;
-                                *last_toggle_press = None;
-                                has_status_changed = true;
-                            } else {
-                                *last_toggle_press = Some(Instant::now());
-                            }
-                        } else {
-                            *last_toggle_press = Some(Instant::now());
-                        }
-                    } else {
-                        // If another key is pressed (not the toggle key), we should reset the window
-                        // For more information, see: https://github.com/espanso/espanso/issues/815
-                        *last_toggle_press = None;
-                    }
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             EventType::EnableRequest => {
                 *enabled = true;
                 has_status_changed = true;
             }
             EventType::DisableRequest => {
                 *enabled = false;
                 has_status_changed = true;
             }

*** result: Success
