*** espanso-engine/src/process/middleware/disable.rs:72:44: delete ! in <impl Middleware for DisableMiddleware>::next

*** mutation diff:
--- espanso-engine/src/process/middleware/disable.rs
+++ delete ! in <impl Middleware for DisableMiddleware>::next
@@ -64,17 +64,17 @@
 
         match &event.etype {
             EventType::Keyboard(m_event) => {
                 if m_event.status == Status::Released {
                     let mut last_toggle_press = self.last_toggle_press.borrow_mut();
                     if is_toggle_key(m_event, &self.options) {
                         if let Some(previous_press) = *last_toggle_press {
                             if previous_press.elapsed() < self.options.toggle_key_maximum_window {
-                                *enabled = !*enabled;
+                                *enabled =  /* ~ changed by cargo-mutants ~ */*enabled;
                                 *last_toggle_press = None;
                                 has_status_changed = true;
                             } else {
                                 *last_toggle_press = Some(Instant::now());
                             }
                         } else {
                             *last_toggle_press = Some(Instant::now());
                         }

*** result: Success
