*** espanso-engine/src/process/middleware/disable.rs:88:13: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/disable.rs
+++ delete match arm
@@ -80,20 +80,17 @@
                         }
                     } else {
                         // If another key is pressed (not the toggle key), we should reset the window
                         // For more information, see: https://github.com/espanso/espanso/issues/815
                         *last_toggle_press = None;
                     }
                 }
             }
-            EventType::EnableRequest => {
-                *enabled = true;
-                has_status_changed = true;
-            }
+             /* ~ changed by cargo-mutants ~ */
             EventType::DisableRequest => {
                 *enabled = false;
                 has_status_changed = true;
             }
             EventType::ToggleRequest => {
                 *enabled = !*enabled;
                 has_status_changed = true;
             }

*** result: Success
