*** espanso-engine/src/process/middleware/match_select.rs:72:17: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/match_select.rs
+++ delete match arm
@@ -64,17 +64,17 @@
     fn next(&self, event: Event, dispatch: &mut dyn FnMut(Event)) -> Event {
         if let EventType::MatchesDetected(m_event) = event.etype {
             let matches_ids: Vec<i32> = m_event.matches.iter().map(|m| m.id).collect();
 
             // Find the matches that are actually valid in the current context
             let valid_ids = self.match_filter.filter_active(&matches_ids);
 
             return match valid_ids.len() {
-                0 => Event::caused_by(event.source_id, EventType::NOOP), // No valid matches, consume the event
+                 /* ~ changed by cargo-mutants ~ */ // No valid matches, consume the event
                 1 => {
                     // Only one match, no need to show a selection dialog
                     let m = m_event
                         .matches
                         .into_iter()
                         .find(|m| m.id == *valid_ids.first().unwrap());
                     if let Some(m) = m {
                         Event::caused_by(

*** result: Success
