*** espanso-engine/src/process/middleware/match_select.rs:78:40: replace == with != in <impl Middleware for MatchSelectMiddleware<'_>>::next

*** mutation diff:
--- espanso-engine/src/process/middleware/match_select.rs
+++ replace == with != in <impl Middleware for MatchSelectMiddleware<'_>>::next
@@ -70,17 +70,17 @@
 
             return match valid_ids.len() {
                 0 => Event::caused_by(event.source_id, EventType::NOOP), // No valid matches, consume the event
                 1 => {
                     // Only one match, no need to show a selection dialog
                     let m = m_event
                         .matches
                         .into_iter()
-                        .find(|m| m.id == *valid_ids.first().unwrap());
+                        .find(|m| m.id != /* ~ changed by cargo-mutants ~ */ *valid_ids.first().unwrap());
                     if let Some(m) = m {
                         Event::caused_by(
                             event.source_id,
                             EventType::MatchSelected(MatchSelectedEvent { chosen: m }),
                         )
                     } else {
                         error!("MatchSelectMiddleware could not find the correspondent match");
                         Event::caused_by(event.source_id, EventType::NOOP)

*** result: Success
