*** espanso-engine/src/process/middleware/matcher.rs:158:20: delete ! in <impl Middleware for MatcherMiddleware<'_, State>>::next

*** mutation diff:
--- espanso-engine/src/process/middleware/matcher.rs
+++ delete ! in <impl Middleware for MatcherMiddleware<'_, State>>::next
@@ -150,17 +150,17 @@
                     new_states.push(state);
                 }
 
                 matcher_states.push_back(new_states);
                 if matcher_states.len() > self.max_history_size {
                     matcher_states.pop_front();
                 }
 
-                if !all_results.is_empty() {
+                if  /* ~ changed by cargo-mutants ~ */all_results.is_empty() {
                     return Event::caused_by(
                         event.source_id,
                         EventType::MatchesDetected(MatchesDetectedEvent {
                             matches: all_results
                                 .into_iter()
                                 .map(|result| DetectedMatch {
                                     id: result.id,
                                     trigger: Some(result.trigger),

*** result: Success
