*** espanso-engine/src/process/middleware/matcher.rs:184:5: replace is_event_of_interest -> bool with true

*** mutation diff:
--- espanso-engine/src/process/middleware/matcher.rs
+++ replace is_event_of_interest -> bool with true
@@ -176,46 +176,17 @@
             }
         }
 
         event
     }
 }
 
 fn is_event_of_interest(event_type: &EventType) -> bool {
-    match event_type {
-        EventType::Keyboard(keyboard_event) => {
-            if keyboard_event.status == Status::Pressed {
-                // Skip linux Keyboard (XKB) Extension function and modifier keys
-                // In hex, they have the byte 3 = 0xfe
-                // See list in "keysymdef.h" file
-                if cfg!(target_os = "linux") {
-                    if let (Key::Other(raw_code), None) =
-                        (&keyboard_event.key, &keyboard_event.value)
-                    {
-                        if (65025..=65276).contains(raw_code) {
-                            return false;
-                        }
-                    }
-                }
-
-                // Skip modifier keys
-                !matches!(
-                    keyboard_event.key,
-                    Key::Alt | Key::Shift | Key::CapsLock | Key::Meta | Key::NumLock | Key::Control
-                )
-            } else {
-                // Skip non-press events
-                false
-            }
-        }
-        EventType::Mouse(mouse_event) => mouse_event.status == Status::Pressed,
-        EventType::MatchInjected => true,
-        _ => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn convert_to_matcher_event(event_type: &EventType) -> Option<MatcherEvent> {
     match event_type {
         EventType::Keyboard(keyboard_event) => Some(MatcherEvent::Key {
             key: keyboard_event.key.clone(),
             chars: keyboard_event.value.clone(),
         }),

*** result: Success
