*** espanso-engine/src/process/middleware/matcher.rs:222:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/matcher.rs
+++ delete match arm
@@ -214,17 +214,17 @@
 }
 
 fn convert_to_matcher_event(event_type: &EventType) -> Option<MatcherEvent> {
     match event_type {
         EventType::Keyboard(keyboard_event) => Some(MatcherEvent::Key {
             key: keyboard_event.key.clone(),
             chars: keyboard_event.value.clone(),
         }),
-        EventType::Mouse(_) => Some(MatcherEvent::VirtualSeparator),
+         /* ~ changed by cargo-mutants ~ */
         EventType::MatchInjected => Some(MatcherEvent::VirtualSeparator),
         _ => None,
     }
 }
 
 fn is_invalidating_event(event_type: &EventType) -> bool {
     match event_type {
         EventType::Keyboard(keyboard_event) => matches!(

*** result: Success
