*** espanso-engine/src/process/middleware/matcher.rs:230:9: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/matcher.rs
+++ delete match arm
@@ -222,28 +222,17 @@
         EventType::Mouse(_) => Some(MatcherEvent::VirtualSeparator),
         EventType::MatchInjected => Some(MatcherEvent::VirtualSeparator),
         _ => None,
     }
 }
 
 fn is_invalidating_event(event_type: &EventType) -> bool {
     match event_type {
-        EventType::Keyboard(keyboard_event) => matches!(
-            keyboard_event.key,
-            Key::ArrowDown
-                | Key::ArrowLeft
-                | Key::ArrowRight
-                | Key::ArrowUp
-                | Key::End
-                | Key::Home
-                | Key::PageDown
-                | Key::PageUp
-                | Key::Escape
-        ),
+         /* ~ changed by cargo-mutants ~ */
         EventType::Mouse(_) => true,
         _ => false,
     }
 }
 
 fn should_skip_key_event_due_to_modifier_press(modifier_state: &ModifierState) -> bool {
     if cfg!(target_os = "macos") {
         modifier_state.is_meta_down

*** result: Success
