*** espanso-engine/src/process/middleware/matcher.rs:248:5: replace should_skip_key_event_due_to_modifier_press -> bool with true

*** mutation diff:
--- espanso-engine/src/process/middleware/matcher.rs
+++ replace should_skip_key_event_due_to_modifier_press -> bool with true
@@ -240,18 +240,10 @@
                 | Key::Escape
         ),
         EventType::Mouse(_) => true,
         _ => false,
     }
 }
 
 fn should_skip_key_event_due_to_modifier_press(modifier_state: &ModifierState) -> bool {
-    if cfg!(target_os = "macos") {
-        modifier_state.is_meta_down
-    } else if cfg!(target_os = "windows") {
-        false
-    } else if cfg!(target_os = "linux") {
-        modifier_state.is_alt_down || modifier_state.is_meta_down
-    } else {
-        unreachable!()
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
