*** espanso-engine/src/process/middleware/matcher.rs:253:36: replace || with && in should_skip_key_event_due_to_modifier_press

*** mutation diff:
--- espanso-engine/src/process/middleware/matcher.rs
+++ replace || with && in should_skip_key_event_due_to_modifier_press
@@ -245,13 +245,13 @@
 }
 
 fn should_skip_key_event_due_to_modifier_press(modifier_state: &ModifierState) -> bool {
     if cfg!(target_os = "macos") {
         modifier_state.is_meta_down
     } else if cfg!(target_os = "windows") {
         false
     } else if cfg!(target_os = "linux") {
-        modifier_state.is_alt_down || modifier_state.is_meta_down
+        modifier_state.is_alt_down && /* ~ changed by cargo-mutants ~ */ modifier_state.is_meta_down
     } else {
         unreachable!()
     }
 }

*** result: Success
