*** espanso-engine/src/process/middleware/notification.rs:42:9: replace <impl Middleware for NotificationMiddleware<'_>>::name -> &'static str with "xyzzy"

*** mutation diff:
--- espanso-engine/src/process/middleware/notification.rs
+++ replace <impl Middleware for NotificationMiddleware<'_>>::name -> &'static str with "xyzzy"
@@ -34,17 +34,17 @@
         Self {
             notification_manager,
         }
     }
 }
 
 impl Middleware for NotificationMiddleware<'_> {
     fn name(&self) -> &'static str {
-        "notification"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn next(&self, event: Event, _: &mut dyn FnMut(Event)) -> Event {
         match &event.etype {
             EventType::Enabled => self.notification_manager.notify_status_change(true),
             EventType::Disabled => self.notification_manager.notify_status_change(false),
             EventType::RenderingError => self.notification_manager.notify_rendering_error(),
             _ => {}

*** result: Success
