*** espanso-engine/src/process/middleware/notification.rs:48:13: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/notification.rs
+++ delete match arm
@@ -40,16 +40,16 @@
 impl Middleware for NotificationMiddleware<'_> {
     fn name(&self) -> &'static str {
         "notification"
     }
 
     fn next(&self, event: Event, _: &mut dyn FnMut(Event)) -> Event {
         match &event.etype {
             EventType::Enabled => self.notification_manager.notify_status_change(true),
-            EventType::Disabled => self.notification_manager.notify_status_change(false),
+             /* ~ changed by cargo-mutants ~ */
             EventType::RenderingError => self.notification_manager.notify_rendering_error(),
             _ => {}
         }
 
         event
     }
 }

*** result: Success
