*** espanso-engine/src/process/middleware/notification.rs:49:13: delete match arm

*** mutation diff:
--- espanso-engine/src/process/middleware/notification.rs
+++ delete match arm
@@ -41,15 +41,15 @@
     fn name(&self) -> &'static str {
         "notification"
     }
 
     fn next(&self, event: Event, _: &mut dyn FnMut(Event)) -> Event {
         match &event.etype {
             EventType::Enabled => self.notification_manager.notify_status_change(true),
             EventType::Disabled => self.notification_manager.notify_status_change(false),
-            EventType::RenderingError => self.notification_manager.notify_rendering_error(),
+             /* ~ changed by cargo-mutants ~ */
             _ => {}
         }
 
         event
     }
 }

*** result: Success
