*** espanso-engine/src/process/middleware/open_config.rs:61:39: replace == with != in <impl Middleware for ConfigMiddleware<'_>>::next

*** mutation diff:
--- espanso-engine/src/process/middleware/open_config.rs
+++ replace == with != in <impl Middleware for ConfigMiddleware<'_>>::next
@@ -53,17 +53,17 @@
                 );
                 self.provider.get_config_path().to_owned()
             }
         };
         if let EventType::ShowConfigFolder = event.etype {
             let program: &str;
             if env::consts::OS == "macos" {
                 program = "open";
-            } else if env::consts::OS == "windows" {
+            } else if env::consts::OS != /* ~ changed by cargo-mutants ~ */ "windows" {
                 program = "explorer";
             } else if env::consts::OS == "linux" {
                 program = "xdg-open";
             } else {
                 panic!("Unsupported OS")
             }
 
             #[allow(unused_must_use)]

*** result: Success
