*** espanso-engine/src/process/middleware/suppress.rs:41:9: replace <impl Middleware for SuppressMiddleware<'_>>::name -> &'static str with "xyzzy"

*** mutation diff:
--- espanso-engine/src/process/middleware/suppress.rs
+++ replace <impl Middleware for SuppressMiddleware<'_>>::name -> &'static str with "xyzzy"
@@ -33,17 +33,17 @@
 impl<'a> SuppressMiddleware<'a> {
     pub fn new(provider: &'a dyn EnabledStatusProvider) -> Self {
         Self { provider }
     }
 }
 
 impl Middleware for SuppressMiddleware<'_> {
     fn name(&self) -> &'static str {
-        "suppress"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn next(&self, event: Event, _: &mut dyn FnMut(Event)) -> Event {
         if let EventType::MatchesDetected(_) = event.etype {
             if !self.provider.is_config_enabled() {
                 trace!("suppressing match detected event as active config has enable=false");
                 return Event::caused_by(event.source_id, EventType::NOOP);
             }

*** result: Success
