*** espanso-engine/src/process/middleware/suppress.rs:46:16: delete ! in <impl Middleware for SuppressMiddleware<'_>>::next

*** mutation diff:
--- espanso-engine/src/process/middleware/suppress.rs
+++ delete ! in <impl Middleware for SuppressMiddleware<'_>>::next
@@ -38,17 +38,17 @@
 
 impl Middleware for SuppressMiddleware<'_> {
     fn name(&self) -> &'static str {
         "suppress"
     }
 
     fn next(&self, event: Event, _: &mut dyn FnMut(Event)) -> Event {
         if let EventType::MatchesDetected(_) = event.etype {
-            if !self.provider.is_config_enabled() {
+            if  /* ~ changed by cargo-mutants ~ */self.provider.is_config_enabled() {
                 trace!("suppressing match detected event as active config has enable=false");
                 return Event::caused_by(event.source_id, EventType::NOOP);
             }
         }
 
         event
     }
 }

*** result: Success
