*** espanso-info/src/cocoa/mod.rs:49:85: replace > with == in CocoaAppInfoProvider::get_exec

*** mutation diff:
--- espanso-info/src/cocoa/mod.rs
+++ replace > with == in CocoaAppInfoProvider::get_exec
@@ -41,17 +41,17 @@
             exec: self.get_exec(),
         }
     }
 }
 
 impl CocoaAppInfoProvider {
     fn get_exec(&self) -> Option<String> {
         let mut buffer: [c_char; 2048] = [0; 2048];
-        if unsafe { info_get_exec(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) } > 0 {
+        if unsafe { info_get_exec(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) } == /* ~ changed by cargo-mutants ~ */ 0 {
             let string = unsafe { CStr::from_ptr(buffer.as_ptr()) };
             let string = string.to_string_lossy();
             if string.is_empty() {
                 None
             } else {
                 Some(string.to_string())
             }
         } else {

*** result: Success
