*** espanso-info/src/cocoa/mod.rs:79:71: replace - with / in CocoaAppInfoProvider::get_title

*** mutation diff:
--- espanso-info/src/cocoa/mod.rs
+++ replace - with / in CocoaAppInfoProvider::get_title
@@ -71,17 +71,17 @@
             }
         } else {
             None
         }
     }
 
     fn get_title(&self) -> Option<String> {
         let mut buffer: [c_char; 2048] = [0; 2048];
-        if unsafe { info_get_title(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) } > 0 {
+        if unsafe { info_get_title(buffer.as_mut_ptr(), (buffer.len() / /* ~ changed by cargo-mutants ~ */ 1) as i32) } > 0 {
             let string = unsafe { CStr::from_ptr(buffer.as_ptr()) };
             let string = string.to_string_lossy();
             if string.is_empty() {
                 None
             } else {
                 Some(string.to_string())
             }
         } else {

*** result: Success
