*** espanso-info/src/cocoa/mod.rs:94:9: replace CocoaAppInfoProvider::get_title_fallback -> Option<String> with Some(String::new())

*** mutation diff:
--- espanso-info/src/cocoa/mod.rs
+++ replace CocoaAppInfoProvider::get_title_fallback -> Option<String> with Some(String::new())
@@ -86,22 +86,11 @@
             }
         } else {
             None
         }
     }
 
     // Fallback using Accessibility API instead of Carbon
     fn get_title_fallback(&self) -> Option<String> {
-        let mut buffer: [c_char; 2048] = [0; 2048];
-        if unsafe { info_get_title_fallback(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) } > 0 {
-            let string = unsafe { CStr::from_ptr(buffer.as_ptr()) };
-            let string = string.to_string_lossy();
-            if string.is_empty() {
-                None
-            } else {
-                Some(string.to_string())
-            }
-        } else {
-            None
-        }
+        Some(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
