*** espanso-info/src/cocoa/mod.rs:95:80: replace - with + in CocoaAppInfoProvider::get_title_fallback

*** mutation diff:
--- espanso-info/src/cocoa/mod.rs
+++ replace - with + in CocoaAppInfoProvider::get_title_fallback
@@ -87,17 +87,17 @@
         } else {
             None
         }
     }
 
     // Fallback using Accessibility API instead of Carbon
     fn get_title_fallback(&self) -> Option<String> {
         let mut buffer: [c_char; 2048] = [0; 2048];
-        if unsafe { info_get_title_fallback(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) } > 0 {
+        if unsafe { info_get_title_fallback(buffer.as_mut_ptr(), (buffer.len() + /* ~ changed by cargo-mutants ~ */ 1) as i32) } > 0 {
             let string = unsafe { CStr::from_ptr(buffer.as_ptr()) };
             let string = string.to_string_lossy();
             if string.is_empty() {
                 None
             } else {
                 Some(string.to_string())
             }
         } else {

*** result: Success
