*** espanso-info/src/lib.rs:50:5: replace get_provider -> Result<Box<dyn AppInfoProvider>> with Ok(Box::new(Default::default()))

*** mutation diff:
--- espanso-info/src/lib.rs
+++ replace get_provider -> Result<Box<dyn AppInfoProvider>> with Ok(Box::new(Default::default()))
@@ -42,18 +42,17 @@
 pub struct AppInfo {
     pub title: Option<String>,
     pub exec: Option<String>,
     pub class: Option<String>,
 }
 
 #[cfg(target_os = "windows")]
 pub fn get_provider() -> Result<Box<dyn AppInfoProvider>> {
-    info!("using Win32AppInfoProvider");
-    Ok(Box::new(win32::WinAppInfoProvider::new()))
+    Ok(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "macos")]
 pub fn get_provider() -> Result<Box<dyn AppInfoProvider>> {
     info!("using CocoaAppInfoProvider");
     Ok(Box::new(cocoa::CocoaAppInfoProvider::new()))
 }

*** result: Success
