*** espanso-info/src/lib.rs:63:5: replace get_provider -> Result<Box<dyn AppInfoProvider>> with Ok(Box::new(Default::default()))

*** mutation diff:
--- espanso-info/src/lib.rs
+++ replace get_provider -> Result<Box<dyn AppInfoProvider>> with Ok(Box::new(Default::default()))
@@ -55,18 +55,17 @@
 pub fn get_provider() -> Result<Box<dyn AppInfoProvider>> {
     info!("using CocoaAppInfoProvider");
     Ok(Box::new(cocoa::CocoaAppInfoProvider::new()))
 }
 
 #[cfg(target_os = "linux")]
 #[cfg(not(feature = "wayland"))]
 pub fn get_provider() -> Result<Box<dyn AppInfoProvider>> {
-    info!("using X11AppInfoProvider");
-    Ok(Box::new(x11::X11AppInfoProvider::new()))
+    Ok(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "linux")]
 #[cfg(feature = "wayland")]
 pub fn get_provider() -> Result<Box<dyn AppInfoProvider>> {
     info!("using WaylandAppInfoProvider");
     Ok(Box::new(wayland::WaylandAppInfoProvider::new()))
 }

*** result: Success
