*** espanso-info/src/lib.rs:80:5: replace add_expansion_events with ()

*** mutation diff:
--- espanso-info/src/lib.rs
+++ replace add_expansion_events with ()
@@ -72,17 +72,17 @@
 }
 
 #[cfg(target_os = "windows")]
 use std::sync::atomic::{AtomicUsize, Ordering::SeqCst};
 #[cfg(target_os = "windows")]
 static EXPANSION_NUM_EVENTS_REMAINING: AtomicUsize = AtomicUsize::new(0);
 #[cfg(target_os = "windows")]
 pub fn add_expansion_events(ev_count: usize) {
-    EXPANSION_NUM_EVENTS_REMAINING.fetch_add(ev_count, SeqCst);
+    () /* ~ changed by cargo-mutants ~ */
 }
 #[cfg(target_os = "windows")]
 pub fn decr_expansion_events() {
     if EXPANSION_NUM_EVENTS_REMAINING.fetch_sub(1, SeqCst) == 0 {
         // Defensively do saturating subtract. Events may have been added, so can't unconditionally
         // store 0.
         let _ = EXPANSION_NUM_EVENTS_REMAINING.compare_exchange(usize::MAX, 0, SeqCst, SeqCst);
     }

*** result: Success
