*** espanso-info/src/lib.rs:84:60: replace == with != in decr_expansion_events

*** mutation diff:
--- espanso-info/src/lib.rs
+++ replace == with != in decr_expansion_events
@@ -76,17 +76,17 @@
 #[cfg(target_os = "windows")]
 static EXPANSION_NUM_EVENTS_REMAINING: AtomicUsize = AtomicUsize::new(0);
 #[cfg(target_os = "windows")]
 pub fn add_expansion_events(ev_count: usize) {
     EXPANSION_NUM_EVENTS_REMAINING.fetch_add(ev_count, SeqCst);
 }
 #[cfg(target_os = "windows")]
 pub fn decr_expansion_events() {
-    if EXPANSION_NUM_EVENTS_REMAINING.fetch_sub(1, SeqCst) == 0 {
+    if EXPANSION_NUM_EVENTS_REMAINING.fetch_sub(1, SeqCst) != /* ~ changed by cargo-mutants ~ */ 0 {
         // Defensively do saturating subtract. Events may have been added, so can't unconditionally
         // store 0.
         let _ = EXPANSION_NUM_EVENTS_REMAINING.compare_exchange(usize::MAX, 0, SeqCst, SeqCst);
     }
 }
 #[cfg(target_os = "windows")]
 pub fn expansion_is_in_progress() -> bool {
     EXPANSION_NUM_EVENTS_REMAINING.load(SeqCst) > 0

*** result: Success
