*** espanso-info/src/lib.rs:92:5: replace expansion_is_in_progress -> bool with false

*** mutation diff:
--- espanso-info/src/lib.rs
+++ replace expansion_is_in_progress -> bool with false
@@ -84,10 +84,10 @@
     if EXPANSION_NUM_EVENTS_REMAINING.fetch_sub(1, SeqCst) == 0 {
         // Defensively do saturating subtract. Events may have been added, so can't unconditionally
         // store 0.
         let _ = EXPANSION_NUM_EVENTS_REMAINING.compare_exchange(usize::MAX, 0, SeqCst, SeqCst);
     }
 }
 #[cfg(target_os = "windows")]
 pub fn expansion_is_in_progress() -> bool {
-    EXPANSION_NUM_EVENTS_REMAINING.load(SeqCst) > 0
+    false /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
