*** espanso-info/src/win32/mod.rs:48:9: replace WinAppInfoProvider::get_exec -> Option<String> with Some(String::new())

*** mutation diff:
--- espanso-info/src/win32/mod.rs
+++ replace WinAppInfoProvider::get_exec -> Option<String> with Some(String::new())
@@ -40,28 +40,17 @@
             class: None,
             exec: WinAppInfoProvider::get_exec(),
         }
     }
 }
 
 impl WinAppInfoProvider {
     fn get_exec() -> Option<String> {
-        let mut buffer: [u16; 2048] = [0; 2048];
-        if unsafe { info_get_exec(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) } == 0 {
-            None
-        } else {
-            let string = unsafe { U16CStr::from_ptr_str(buffer.as_ptr()) };
-            let string = string.to_string_lossy();
-            if string.is_empty() {
-                None
-            } else {
-                Some(string)
-            }
-        }
+        Some(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn get_title() -> Option<String> {
         let mut buffer: [u16; 2048] = [0; 2048];
         if unsafe { info_get_title(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) } > 0 {
             let string = unsafe { U16CStr::from_ptr_str(buffer.as_ptr()) };
             let string = string.to_string_lossy();
             if string.is_empty() {

*** result: Success
