*** espanso-info/src/win32/mod.rs:49:70: replace - with / in WinAppInfoProvider::get_exec

*** mutation diff:
--- espanso-info/src/win32/mod.rs
+++ replace - with / in WinAppInfoProvider::get_exec
@@ -41,17 +41,17 @@
             exec: WinAppInfoProvider::get_exec(),
         }
     }
 }
 
 impl WinAppInfoProvider {
     fn get_exec() -> Option<String> {
         let mut buffer: [u16; 2048] = [0; 2048];
-        if unsafe { info_get_exec(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) } == 0 {
+        if unsafe { info_get_exec(buffer.as_mut_ptr(), (buffer.len() / /* ~ changed by cargo-mutants ~ */ 1) as i32) } == 0 {
             None
         } else {
             let string = unsafe { U16CStr::from_ptr_str(buffer.as_ptr()) };
             let string = string.to_string_lossy();
             if string.is_empty() {
                 None
             } else {
                 Some(string)

*** result: Success
