*** espanso-info/src/win32/mod.rs:63:9: replace WinAppInfoProvider::get_title -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- espanso-info/src/win32/mod.rs
+++ replace WinAppInfoProvider::get_title -> Option<String> with Some("xyzzy".into())
@@ -55,22 +55,11 @@
                 None
             } else {
                 Some(string)
             }
         }
     }
 
     fn get_title() -> Option<String> {
-        let mut buffer: [u16; 2048] = [0; 2048];
-        if unsafe { info_get_title(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) } > 0 {
-            let string = unsafe { U16CStr::from_ptr_str(buffer.as_ptr()) };
-            let string = string.to_string_lossy();
-            if string.is_empty() {
-                None
-            } else {
-                Some(string)
-            }
-        } else {
-            None
-        }
+        Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
