*** espanso-info/src/win32/mod.rs:64:71: replace - with + in WinAppInfoProvider::get_title

*** mutation diff:
--- espanso-info/src/win32/mod.rs
+++ replace - with + in WinAppInfoProvider::get_title
@@ -56,17 +56,17 @@
             } else {
                 Some(string)
             }
         }
     }
 
     fn get_title() -> Option<String> {
         let mut buffer: [u16; 2048] = [0; 2048];
-        if unsafe { info_get_title(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) } > 0 {
+        if unsafe { info_get_title(buffer.as_mut_ptr(), (buffer.len() + /* ~ changed by cargo-mutants ~ */ 1) as i32) } > 0 {
             let string = unsafe { U16CStr::from_ptr_str(buffer.as_ptr()) };
             let string = string.to_string_lossy();
             if string.is_empty() {
                 None
             } else {
                 Some(string)
             }
         } else {

*** result: Success
