*** espanso-info/src/x11/mod.rs:48:9: replace X11AppInfoProvider::get_exec -> Option<String> with Some(String::new())

*** mutation diff:
--- espanso-info/src/x11/mod.rs
+++ replace X11AppInfoProvider::get_exec -> Option<String> with Some(String::new())
@@ -40,28 +40,17 @@
             class: self.get_class(),
             exec: self.get_exec(),
         }
     }
 }
 
 impl X11AppInfoProvider {
     fn get_exec(&self) -> Option<String> {
-        let mut buffer: [c_char; 2048] = [0; 2048];
-        if unsafe { info_get_exec(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) } > 0 {
-            let string = unsafe { CStr::from_ptr(buffer.as_ptr()) };
-            let string = string.to_string_lossy();
-            if string.is_empty() {
-                None
-            } else {
-                Some(string.to_string())
-            }
-        } else {
-            None
-        }
+        Some(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn get_class(&self) -> Option<String> {
         let mut buffer: [c_char; 2048] = [0; 2048];
         if unsafe { info_get_class(buffer.as_mut_ptr(), (buffer.len() - 1) as i32) } > 0 {
             let string = unsafe { CStr::from_ptr(buffer.as_ptr()) };
             let string = string.to_string_lossy();
             if string.is_empty() {

*** result: Success
