*** espanso-inject/src/evdev/mod.rs:219:9: replace EVDEVInjector::send_key with ()

*** mutation diff:
--- espanso-inject/src/evdev/mod.rs
+++ replace EVDEVInjector::send_key with ()
@@ -211,22 +211,17 @@
                     .get(&(*sym as u32))
                     .cloned()
                     .ok_or_else(|| EVDEVInjectorError::SymMappingFailure(*sym as u32).into())
             })
             .collect()
     }
 
     fn send_key(&self, code: u32, pressed: bool, delay_us: u32) {
-        self.device.emit(code, pressed);
-        if delay_us != 0 {
-            unsafe {
-                libc::usleep(delay_us);
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn wait_until_key_is_released(&self, code: u32) -> Result<()> {
         if let Some(key_provider) = &self.keyboard_state_provider {
             let key_provider_code = code + EVDEV_OFFSET;
 
             if !key_provider.is_key_pressed(key_provider_code) {
                 return Ok(());

*** result: Success
