*** espanso-inject/src/evdev/mod.rs:229:42: replace + with * in EVDEVInjector::wait_until_key_is_released

*** mutation diff:
--- espanso-inject/src/evdev/mod.rs
+++ replace + with * in EVDEVInjector::wait_until_key_is_released
@@ -221,17 +221,17 @@
             unsafe {
                 libc::usleep(delay_us);
             }
         }
     }
 
     fn wait_until_key_is_released(&self, code: u32) -> Result<()> {
         if let Some(key_provider) = &self.keyboard_state_provider {
-            let key_provider_code = code + EVDEV_OFFSET;
+            let key_provider_code = code * /* ~ changed by cargo-mutants ~ */ EVDEV_OFFSET;
 
             if !key_provider.is_key_pressed(key_provider_code) {
                 return Ok(());
             }
 
             // Key is pressed, wait until timeout
             let now = Instant::now();
             while now.elapsed()

*** result: Success
