*** espanso-inject/src/evdev/mod.rs:231:16: delete ! in EVDEVInjector::wait_until_key_is_released

*** mutation diff:
--- espanso-inject/src/evdev/mod.rs
+++ delete ! in EVDEVInjector::wait_until_key_is_released
@@ -223,17 +223,17 @@
             }
         }
     }
 
     fn wait_until_key_is_released(&self, code: u32) -> Result<()> {
         if let Some(key_provider) = &self.keyboard_state_provider {
             let key_provider_code = code + EVDEV_OFFSET;
 
-            if !key_provider.is_key_pressed(key_provider_code) {
+            if  /* ~ changed by cargo-mutants ~ */key_provider.is_key_pressed(key_provider_code) {
                 return Ok(());
             }
 
             // Key is pressed, wait until timeout
             let now = Instant::now();
             while now.elapsed()
                 < std::time::Duration::from_millis(DEFAULT_WAIT_KEY_RELEASE_TIMEOUT_MS)
             {

*** result: Success
