*** espanso-inject/src/keys.rs:236:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -228,17 +228,17 @@
             Key::Raw(code) => write!(f, "RAW({code})"),
         }
     }
 }
 
 impl Key {
     pub fn parse(key: &str) -> Option<Key> {
         let parsed = match key {
-            "ALT" | "OPTION" => Some(Key::Alt),
+             /* ~ changed by cargo-mutants ~ */
             "CAPSLOCK" => Some(Key::CapsLock),
             "CTRL" => Some(Key::Control),
             "META" | "CMD" => Some(Key::Meta),
             "NUMLOCK" => Some(Key::NumLock),
             "SHIFT" => Some(Key::Shift),
             "ENTER" => Some(Key::Enter),
             "TAB" => Some(Key::Tab),
             "SPACE" => Some(Key::Space),

---- keys::tests::parse_works_correctly stdout ----

thread 'keys::tests::parse_works_correctly' panicked at espanso-inject/src/keys.rs:349:44:
called `Option::unwrap()` on a `None` value

failures:
    keys::tests::parse_works_correctly

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
