*** espanso-inject/src/keys.rs:237:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -229,17 +229,17 @@
         }
     }
 }
 
 impl Key {
     pub fn parse(key: &str) -> Option<Key> {
         let parsed = match key {
             "ALT" | "OPTION" => Some(Key::Alt),
-            "CAPSLOCK" => Some(Key::CapsLock),
+             /* ~ changed by cargo-mutants ~ */
             "CTRL" => Some(Key::Control),
             "META" | "CMD" => Some(Key::Meta),
             "NUMLOCK" => Some(Key::NumLock),
             "SHIFT" => Some(Key::Shift),
             "ENTER" => Some(Key::Enter),
             "TAB" => Some(Key::Tab),
             "SPACE" => Some(Key::Space),
             "DOWN" => Some(Key::ArrowDown),

*** result: Success
