*** espanso-inject/src/keys.rs:239:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -231,17 +231,17 @@
 }
 
 impl Key {
     pub fn parse(key: &str) -> Option<Key> {
         let parsed = match key {
             "ALT" | "OPTION" => Some(Key::Alt),
             "CAPSLOCK" => Some(Key::CapsLock),
             "CTRL" => Some(Key::Control),
-            "META" | "CMD" => Some(Key::Meta),
+             /* ~ changed by cargo-mutants ~ */
             "NUMLOCK" => Some(Key::NumLock),
             "SHIFT" => Some(Key::Shift),
             "ENTER" => Some(Key::Enter),
             "TAB" => Some(Key::Tab),
             "SPACE" => Some(Key::Space),
             "DOWN" => Some(Key::ArrowDown),
             "LEFT" => Some(Key::ArrowLeft),
             "RIGHT" => Some(Key::ArrowRight),

*** result: Success
