*** espanso-inject/src/keys.rs:242:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -234,17 +234,17 @@
     pub fn parse(key: &str) -> Option<Key> {
         let parsed = match key {
             "ALT" | "OPTION" => Some(Key::Alt),
             "CAPSLOCK" => Some(Key::CapsLock),
             "CTRL" => Some(Key::Control),
             "META" | "CMD" => Some(Key::Meta),
             "NUMLOCK" => Some(Key::NumLock),
             "SHIFT" => Some(Key::Shift),
-            "ENTER" => Some(Key::Enter),
+             /* ~ changed by cargo-mutants ~ */
             "TAB" => Some(Key::Tab),
             "SPACE" => Some(Key::Space),
             "DOWN" => Some(Key::ArrowDown),
             "LEFT" => Some(Key::ArrowLeft),
             "RIGHT" => Some(Key::ArrowRight),
             "UP" => Some(Key::ArrowUp),
             "END" => Some(Key::End),
             "HOME" => Some(Key::Home),

*** result: Success
