*** espanso-inject/src/keys.rs:243:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -235,17 +235,17 @@
         let parsed = match key {
             "ALT" | "OPTION" => Some(Key::Alt),
             "CAPSLOCK" => Some(Key::CapsLock),
             "CTRL" => Some(Key::Control),
             "META" | "CMD" => Some(Key::Meta),
             "NUMLOCK" => Some(Key::NumLock),
             "SHIFT" => Some(Key::Shift),
             "ENTER" => Some(Key::Enter),
-            "TAB" => Some(Key::Tab),
+             /* ~ changed by cargo-mutants ~ */
             "SPACE" => Some(Key::Space),
             "DOWN" => Some(Key::ArrowDown),
             "LEFT" => Some(Key::ArrowLeft),
             "RIGHT" => Some(Key::ArrowRight),
             "UP" => Some(Key::ArrowUp),
             "END" => Some(Key::End),
             "HOME" => Some(Key::Home),
             "PAGEDOWN" => Some(Key::PageDown),

*** result: Success
