*** espanso-inject/src/keys.rs:248:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -240,17 +240,17 @@
             "NUMLOCK" => Some(Key::NumLock),
             "SHIFT" => Some(Key::Shift),
             "ENTER" => Some(Key::Enter),
             "TAB" => Some(Key::Tab),
             "SPACE" => Some(Key::Space),
             "DOWN" => Some(Key::ArrowDown),
             "LEFT" => Some(Key::ArrowLeft),
             "RIGHT" => Some(Key::ArrowRight),
-            "UP" => Some(Key::ArrowUp),
+             /* ~ changed by cargo-mutants ~ */
             "END" => Some(Key::End),
             "HOME" => Some(Key::Home),
             "PAGEDOWN" => Some(Key::PageDown),
             "PAGEUP" => Some(Key::PageUp),
             "ESC" => Some(Key::Escape),
             "BACKSPACE" => Some(Key::Backspace),
             "INSERT" => Some(Key::Insert),
             "DELETE" => Some(Key::Delete),

*** result: Success
