*** espanso-inject/src/keys.rs:252:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -244,17 +244,17 @@
             "SPACE" => Some(Key::Space),
             "DOWN" => Some(Key::ArrowDown),
             "LEFT" => Some(Key::ArrowLeft),
             "RIGHT" => Some(Key::ArrowRight),
             "UP" => Some(Key::ArrowUp),
             "END" => Some(Key::End),
             "HOME" => Some(Key::Home),
             "PAGEDOWN" => Some(Key::PageDown),
-            "PAGEUP" => Some(Key::PageUp),
+             /* ~ changed by cargo-mutants ~ */
             "ESC" => Some(Key::Escape),
             "BACKSPACE" => Some(Key::Backspace),
             "INSERT" => Some(Key::Insert),
             "DELETE" => Some(Key::Delete),
             "F1" => Some(Key::F1),
             "F2" => Some(Key::F2),
             "F3" => Some(Key::F3),
             "F4" => Some(Key::F4),

*** result: Success
