*** espanso-inject/src/keys.rs:264:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -256,17 +256,17 @@
             "DELETE" => Some(Key::Delete),
             "F1" => Some(Key::F1),
             "F2" => Some(Key::F2),
             "F3" => Some(Key::F3),
             "F4" => Some(Key::F4),
             "F5" => Some(Key::F5),
             "F6" => Some(Key::F6),
             "F7" => Some(Key::F7),
-            "F8" => Some(Key::F8),
+             /* ~ changed by cargo-mutants ~ */
             "F9" => Some(Key::F9),
             "F10" => Some(Key::F10),
             "F11" => Some(Key::F11),
             "F12" => Some(Key::F12),
             "F13" => Some(Key::F13),
             "F14" => Some(Key::F14),
             "F15" => Some(Key::F15),
             "F16" => Some(Key::F16),

*** result: Success
