*** espanso-inject/src/keys.rs:265:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -257,17 +257,17 @@
             "F1" => Some(Key::F1),
             "F2" => Some(Key::F2),
             "F3" => Some(Key::F3),
             "F4" => Some(Key::F4),
             "F5" => Some(Key::F5),
             "F6" => Some(Key::F6),
             "F7" => Some(Key::F7),
             "F8" => Some(Key::F8),
-            "F9" => Some(Key::F9),
+             /* ~ changed by cargo-mutants ~ */
             "F10" => Some(Key::F10),
             "F11" => Some(Key::F11),
             "F12" => Some(Key::F12),
             "F13" => Some(Key::F13),
             "F14" => Some(Key::F14),
             "F15" => Some(Key::F15),
             "F16" => Some(Key::F16),
             "F17" => Some(Key::F17),

*** result: Success
