*** espanso-inject/src/keys.rs:267:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -259,17 +259,17 @@
             "F3" => Some(Key::F3),
             "F4" => Some(Key::F4),
             "F5" => Some(Key::F5),
             "F6" => Some(Key::F6),
             "F7" => Some(Key::F7),
             "F8" => Some(Key::F8),
             "F9" => Some(Key::F9),
             "F10" => Some(Key::F10),
-            "F11" => Some(Key::F11),
+             /* ~ changed by cargo-mutants ~ */
             "F12" => Some(Key::F12),
             "F13" => Some(Key::F13),
             "F14" => Some(Key::F14),
             "F15" => Some(Key::F15),
             "F16" => Some(Key::F16),
             "F17" => Some(Key::F17),
             "F18" => Some(Key::F18),
             "F19" => Some(Key::F19),

*** result: Success
