*** espanso-inject/src/keys.rs:281:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -273,17 +273,17 @@
             "F17" => Some(Key::F17),
             "F18" => Some(Key::F18),
             "F19" => Some(Key::F19),
             "F20" => Some(Key::F20),
             "A" => Some(Key::A),
             "B" => Some(Key::B),
             "C" => Some(Key::C),
             "D" => Some(Key::D),
-            "E" => Some(Key::E),
+             /* ~ changed by cargo-mutants ~ */
             "F" => Some(Key::F),
             "G" => Some(Key::G),
             "H" => Some(Key::H),
             "I" => Some(Key::I),
             "J" => Some(Key::J),
             "K" => Some(Key::K),
             "L" => Some(Key::L),
             "M" => Some(Key::M),

*** result: Success
