*** espanso-inject/src/keys.rs:284:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -276,17 +276,17 @@
             "F20" => Some(Key::F20),
             "A" => Some(Key::A),
             "B" => Some(Key::B),
             "C" => Some(Key::C),
             "D" => Some(Key::D),
             "E" => Some(Key::E),
             "F" => Some(Key::F),
             "G" => Some(Key::G),
-            "H" => Some(Key::H),
+             /* ~ changed by cargo-mutants ~ */
             "I" => Some(Key::I),
             "J" => Some(Key::J),
             "K" => Some(Key::K),
             "L" => Some(Key::L),
             "M" => Some(Key::M),
             "N" => Some(Key::N),
             "O" => Some(Key::O),
             "P" => Some(Key::P),

*** result: Success
