*** espanso-inject/src/keys.rs:286:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -278,17 +278,17 @@
             "B" => Some(Key::B),
             "C" => Some(Key::C),
             "D" => Some(Key::D),
             "E" => Some(Key::E),
             "F" => Some(Key::F),
             "G" => Some(Key::G),
             "H" => Some(Key::H),
             "I" => Some(Key::I),
-            "J" => Some(Key::J),
+             /* ~ changed by cargo-mutants ~ */
             "K" => Some(Key::K),
             "L" => Some(Key::L),
             "M" => Some(Key::M),
             "N" => Some(Key::N),
             "O" => Some(Key::O),
             "P" => Some(Key::P),
             "Q" => Some(Key::Q),
             "R" => Some(Key::R),

*** result: Success
