*** espanso-inject/src/keys.rs:288:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -280,17 +280,17 @@
             "D" => Some(Key::D),
             "E" => Some(Key::E),
             "F" => Some(Key::F),
             "G" => Some(Key::G),
             "H" => Some(Key::H),
             "I" => Some(Key::I),
             "J" => Some(Key::J),
             "K" => Some(Key::K),
-            "L" => Some(Key::L),
+             /* ~ changed by cargo-mutants ~ */
             "M" => Some(Key::M),
             "N" => Some(Key::N),
             "O" => Some(Key::O),
             "P" => Some(Key::P),
             "Q" => Some(Key::Q),
             "R" => Some(Key::R),
             "S" => Some(Key::S),
             "T" => Some(Key::T),

*** result: Success
