*** espanso-inject/src/keys.rs:292:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -284,17 +284,17 @@
             "H" => Some(Key::H),
             "I" => Some(Key::I),
             "J" => Some(Key::J),
             "K" => Some(Key::K),
             "L" => Some(Key::L),
             "M" => Some(Key::M),
             "N" => Some(Key::N),
             "O" => Some(Key::O),
-            "P" => Some(Key::P),
+             /* ~ changed by cargo-mutants ~ */
             "Q" => Some(Key::Q),
             "R" => Some(Key::R),
             "S" => Some(Key::S),
             "T" => Some(Key::T),
             "U" => Some(Key::U),
             "V" => Some(Key::V),
             "W" => Some(Key::W),
             "X" => Some(Key::X),

*** result: Success
