*** espanso-inject/src/keys.rs:294:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -286,17 +286,17 @@
             "J" => Some(Key::J),
             "K" => Some(Key::K),
             "L" => Some(Key::L),
             "M" => Some(Key::M),
             "N" => Some(Key::N),
             "O" => Some(Key::O),
             "P" => Some(Key::P),
             "Q" => Some(Key::Q),
-            "R" => Some(Key::R),
+             /* ~ changed by cargo-mutants ~ */
             "S" => Some(Key::S),
             "T" => Some(Key::T),
             "U" => Some(Key::U),
             "V" => Some(Key::V),
             "W" => Some(Key::W),
             "X" => Some(Key::X),
             "Y" => Some(Key::Y),
             "Z" => Some(Key::Z),

*** result: Success
