*** espanso-inject/src/keys.rs:298:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -290,17 +290,17 @@
             "N" => Some(Key::N),
             "O" => Some(Key::O),
             "P" => Some(Key::P),
             "Q" => Some(Key::Q),
             "R" => Some(Key::R),
             "S" => Some(Key::S),
             "T" => Some(Key::T),
             "U" => Some(Key::U),
-            "V" => Some(Key::V),
+             /* ~ changed by cargo-mutants ~ */
             "W" => Some(Key::W),
             "X" => Some(Key::X),
             "Y" => Some(Key::Y),
             "Z" => Some(Key::Z),
             "0" => Some(Key::N0),
             "1" => Some(Key::N1),
             "2" => Some(Key::N2),
             "3" => Some(Key::N3),

*** result: Success
