*** espanso-inject/src/keys.rs:304:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -296,17 +296,17 @@
             "T" => Some(Key::T),
             "U" => Some(Key::U),
             "V" => Some(Key::V),
             "W" => Some(Key::W),
             "X" => Some(Key::X),
             "Y" => Some(Key::Y),
             "Z" => Some(Key::Z),
             "0" => Some(Key::N0),
-            "1" => Some(Key::N1),
+             /* ~ changed by cargo-mutants ~ */
             "2" => Some(Key::N2),
             "3" => Some(Key::N3),
             "4" => Some(Key::N4),
             "5" => Some(Key::N5),
             "6" => Some(Key::N6),
             "7" => Some(Key::N7),
             "8" => Some(Key::N8),
             "9" => Some(Key::N9),

*** result: Success
