*** espanso-inject/src/keys.rs:311:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -303,17 +303,17 @@
             "0" => Some(Key::N0),
             "1" => Some(Key::N1),
             "2" => Some(Key::N2),
             "3" => Some(Key::N3),
             "4" => Some(Key::N4),
             "5" => Some(Key::N5),
             "6" => Some(Key::N6),
             "7" => Some(Key::N7),
-            "8" => Some(Key::N8),
+             /* ~ changed by cargo-mutants ~ */
             "9" => Some(Key::N9),
             "NUMPAD0" => Some(Key::Numpad0),
             "NUMPAD1" => Some(Key::Numpad1),
             "NUMPAD2" => Some(Key::Numpad2),
             "NUMPAD3" => Some(Key::Numpad3),
             "NUMPAD4" => Some(Key::Numpad4),
             "NUMPAD5" => Some(Key::Numpad5),
             "NUMPAD6" => Some(Key::Numpad6),

*** result: Success
