*** espanso-inject/src/keys.rs:313:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -305,17 +305,17 @@
             "2" => Some(Key::N2),
             "3" => Some(Key::N3),
             "4" => Some(Key::N4),
             "5" => Some(Key::N5),
             "6" => Some(Key::N6),
             "7" => Some(Key::N7),
             "8" => Some(Key::N8),
             "9" => Some(Key::N9),
-            "NUMPAD0" => Some(Key::Numpad0),
+             /* ~ changed by cargo-mutants ~ */
             "NUMPAD1" => Some(Key::Numpad1),
             "NUMPAD2" => Some(Key::Numpad2),
             "NUMPAD3" => Some(Key::Numpad3),
             "NUMPAD4" => Some(Key::Numpad4),
             "NUMPAD5" => Some(Key::Numpad5),
             "NUMPAD6" => Some(Key::Numpad6),
             "NUMPAD7" => Some(Key::Numpad7),
             "NUMPAD8" => Some(Key::Numpad8),

*** result: Success
