*** espanso-inject/src/keys.rs:315:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -307,17 +307,17 @@
             "4" => Some(Key::N4),
             "5" => Some(Key::N5),
             "6" => Some(Key::N6),
             "7" => Some(Key::N7),
             "8" => Some(Key::N8),
             "9" => Some(Key::N9),
             "NUMPAD0" => Some(Key::Numpad0),
             "NUMPAD1" => Some(Key::Numpad1),
-            "NUMPAD2" => Some(Key::Numpad2),
+             /* ~ changed by cargo-mutants ~ */
             "NUMPAD3" => Some(Key::Numpad3),
             "NUMPAD4" => Some(Key::Numpad4),
             "NUMPAD5" => Some(Key::Numpad5),
             "NUMPAD6" => Some(Key::Numpad6),
             "NUMPAD7" => Some(Key::Numpad7),
             "NUMPAD8" => Some(Key::Numpad8),
             "NUMPAD9" => Some(Key::Numpad9),
             _ => None,

*** result: Success
