*** espanso-inject/src/keys.rs:321:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -313,17 +313,17 @@
             "NUMPAD0" => Some(Key::Numpad0),
             "NUMPAD1" => Some(Key::Numpad1),
             "NUMPAD2" => Some(Key::Numpad2),
             "NUMPAD3" => Some(Key::Numpad3),
             "NUMPAD4" => Some(Key::Numpad4),
             "NUMPAD5" => Some(Key::Numpad5),
             "NUMPAD6" => Some(Key::Numpad6),
             "NUMPAD7" => Some(Key::Numpad7),
-            "NUMPAD8" => Some(Key::Numpad8),
+             /* ~ changed by cargo-mutants ~ */
             "NUMPAD9" => Some(Key::Numpad9),
             _ => None,
         };
 
         if parsed.is_none() {
             // Attempt to parse raw keys
             if RAW_PARSER.is_match(key) {
                 if let Some(caps) = RAW_PARSER.captures(key) {

*** result: Success
