*** espanso-inject/src/keys.rs:322:13: delete match arm

*** mutation diff:
--- espanso-inject/src/keys.rs
+++ delete match arm
@@ -314,17 +314,17 @@
             "NUMPAD1" => Some(Key::Numpad1),
             "NUMPAD2" => Some(Key::Numpad2),
             "NUMPAD3" => Some(Key::Numpad3),
             "NUMPAD4" => Some(Key::Numpad4),
             "NUMPAD5" => Some(Key::Numpad5),
             "NUMPAD6" => Some(Key::Numpad6),
             "NUMPAD7" => Some(Key::Numpad7),
             "NUMPAD8" => Some(Key::Numpad8),
-            "NUMPAD9" => Some(Key::Numpad9),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         };
 
         if parsed.is_none() {
             // Attempt to parse raw keys
             if RAW_PARSER.is_match(key) {
                 if let Some(caps) = RAW_PARSER.captures(key) {
                     let code_str = caps.get(1).map_or("", |m| m.as_str());

*** result: Success
