*** espanso-inject/src/lib.rs:137:5: replace get_injector -> Result<Box<dyn Injector>> with Ok(Box::new(Default::default()))

*** mutation diff:
--- espanso-inject/src/lib.rs
+++ replace get_injector -> Result<Box<dyn Injector>> with Ok(Box::new(Default::default()))
@@ -129,18 +129,17 @@
 }
 
 pub trait KeyboardStateProvider {
     fn is_key_pressed(&self, code: u32) -> bool;
 }
 
 #[cfg(target_os = "windows")]
 pub fn get_injector(_options: InjectorCreationOptions) -> Result<Box<dyn Injector>> {
-    info!("using Win32Injector");
-    Ok(Box::new(win32::Win32Injector::new()))
+    Ok(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "macos")]
 pub fn get_injector(_options: InjectorCreationOptions) -> Result<Box<dyn Injector>> {
     info!("using MacInjector");
     Ok(Box::new(mac::MacInjector::new()))
 }

*** result: Success
