*** espanso-inject/src/lib.rs:162:5: replace get_injector -> Result<Box<dyn Injector>> with Ok(Box::new(Default::default()))

*** mutation diff:
--- espanso-inject/src/lib.rs
+++ replace get_injector -> Result<Box<dyn Injector>> with Ok(Box::new(Default::default()))
@@ -154,11 +154,10 @@
         info!("using X11ProxyInjector");
         Ok(Box::new(x11::X11ProxyInjector::new()?))
     }
 }
 
 #[cfg(target_os = "linux")]
 #[cfg(feature = "wayland")]
 pub fn get_injector(options: InjectorCreationOptions) -> Result<Box<dyn Injector>> {
-    info!("using EVDEVInjector");
-    Ok(Box::new(evdev::EVDEVInjector::new(options)?))
+    Ok(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
