*** espanso-inject/src/linux/raw_keys.rs:130:5: replace convert_to_sym_array -> Result<Vec<u64>> with Ok(vec![0])

*** mutation diff:
--- espanso-inject/src/linux/raw_keys.rs
+++ replace convert_to_sym_array -> Result<Vec<u64>> with Ok(vec![0])
@@ -122,25 +122,16 @@
         Key::Numpad7 => Some(0xffb7),
         Key::Numpad8 => Some(0xffb8),
         Key::Numpad9 => Some(0xffb9),
         Key::Raw(code) => Some(*code as u32),
     }
 }
 
 pub fn convert_to_sym_array(keys: &[Key]) -> Result<Vec<u64>> {
-    let mut virtual_keys: Vec<u64> = Vec::new();
-    for key in keys {
-        let vk = convert_key_to_sym(key);
-        if let Some(vk) = vk {
-            virtual_keys.push(vk as u64);
-        } else {
-            return Err(LinuxRawKeyError::MappingFailure(key.clone()).into());
-        }
-    }
-    Ok(virtual_keys)
+    Ok(vec![0]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Error, Debug)]
 pub enum LinuxRawKeyError {
     #[error("missing mapping for key `{0}`")]
     MappingFailure(Key),
 }

*** result: Success
