*** espanso-inject/src/mac/mod.rs:49:9: replace MacInjector::convert_to_vk_array -> Result<Vec<i32>> with Ok(vec![-1])

*** mutation diff:
--- espanso-inject/src/mac/mod.rs
+++ replace MacInjector::convert_to_vk_array -> Result<Vec<i32>> with Ok(vec![-1])
@@ -41,26 +41,17 @@
 
 #[allow(clippy::new_without_default)]
 impl MacInjector {
     pub fn new() -> Self {
         Self {}
     }
 
     pub fn convert_to_vk_array(keys: &[keys::Key]) -> Result<Vec<i32>> {
-        let mut virtual_keys: Vec<i32> = Vec::new();
-        for key in keys {
-            let vk = convert_key_to_vkey(key);
-            if let Some(vk) = vk {
-                virtual_keys.push(vk);
-            } else {
-                return Err(MacInjectorError::MappingFailure(key.clone()).into());
-            }
-        }
-        Ok(virtual_keys)
+        Ok(vec![-1]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Injector for MacInjector {
     fn send_string(&self, string: &str, options: InjectionOptions) -> Result<()> {
         let c_string = CString::new(string)?;
         unsafe {
             inject_string(

---- mac::tests::convert_raw_to_virtual_key_array stdout ----

thread 'mac::tests::convert_raw_to_virtual_key_array' panicked at espanso-inject/src/mac/mod.rs:107:9:
assertion `left == right` failed
  left: [-1]
 right: [58, 9]

failures:
    mac::tests::convert_raw_to_virtual_key_array

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
