*** espanso-inject/src/mac/mod.rs:76:9: replace <impl Injector for MacInjector>::send_keys -> Result<()> with Ok(())

*** mutation diff:
--- espanso-inject/src/mac/mod.rs
+++ replace <impl Injector for MacInjector>::send_keys -> Result<()> with Ok(())
@@ -68,27 +68,17 @@
                 InjectionOptions::default().delay,
                 options.delay,
             );
         }
         Ok(())
     }
 
     fn send_keys(&self, keys: &[keys::Key], options: InjectionOptions) -> Result<()> {
-        let virtual_keys = Self::convert_to_vk_array(keys)?;
-
-        unsafe {
-            inject_separate_vkeys(
-                virtual_keys.as_ptr(),
-                virtual_keys.len() as i32,
-                options.delay,
-            );
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn send_key_combination(&self, keys: &[keys::Key], options: InjectionOptions) -> Result<()> {
         let virtual_keys = Self::convert_to_vk_array(keys)?;
 
         unsafe {
             inject_vkeys_combination(
                 virtual_keys.as_ptr(),

*** result: Success
