*** espanso-inject/src/mac/mod.rs:90:9: replace <impl Injector for MacInjector>::send_key_combination -> Result<()> with Ok(())

*** mutation diff:
--- espanso-inject/src/mac/mod.rs
+++ replace <impl Injector for MacInjector>::send_key_combination -> Result<()> with Ok(())
@@ -82,27 +82,17 @@
                 options.delay,
             );
         }
 
         Ok(())
     }
 
     fn send_key_combination(&self, keys: &[keys::Key], options: InjectionOptions) -> Result<()> {
-        let virtual_keys = Self::convert_to_vk_array(keys)?;
-
-        unsafe {
-            inject_vkeys_combination(
-                virtual_keys.as_ptr(),
-                virtual_keys.len() as i32,
-                options.delay,
-            );
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Error, Debug)]
 pub enum MacInjectorError {
     #[error("missing vkey mapping for key `{0}`")]
     MappingFailure(keys::Key),
 }

*** result: Success
