*** espanso-inject/src/win32/mod.rs:49:9: replace Win32Injector::convert_to_vk_array -> Result<Vec<i32>> with Ok(vec![])

*** mutation diff:
--- espanso-inject/src/win32/mod.rs
+++ replace Win32Injector::convert_to_vk_array -> Result<Vec<i32>> with Ok(vec![])
@@ -41,26 +41,17 @@
 
 #[allow(clippy::new_without_default)]
 impl Win32Injector {
     pub fn new() -> Self {
         Self {}
     }
 
     pub fn convert_to_vk_array(keys: &[keys::Key]) -> Result<Vec<i32>> {
-        let mut virtual_keys: Vec<i32> = Vec::new();
-        for key in keys {
-            let vk = convert_key_to_vkey(key);
-            if let Some(vk) = vk {
-                virtual_keys.push(vk);
-            } else {
-                return Err(Win32InjectorError::MappingFailure(key.clone()).into());
-            }
-        }
-        Ok(virtual_keys)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Injector for Win32Injector {
     fn send_string(&self, string: &str, _: InjectionOptions) -> Result<()> {
         let wide_string = widestring::WideCString::from_str(string)?;
         unsafe {
             inject_string(wide_string.as_ptr());

*** result: Success
