*** espanso-inject/src/win32/mod.rs:72:9: replace <impl Injector for Win32Injector>::send_keys -> Result<()> with Ok(())

*** mutation diff:
--- espanso-inject/src/win32/mod.rs
+++ replace <impl Injector for Win32Injector>::send_keys -> Result<()> with Ok(())
@@ -64,35 +64,17 @@
         let wide_string = widestring::WideCString::from_str(string)?;
         unsafe {
             inject_string(wide_string.as_ptr());
         }
         Ok(())
     }
 
     fn send_keys(&self, keys: &[keys::Key], options: InjectionOptions) -> Result<()> {
-        let virtual_keys = Self::convert_to_vk_array(keys)?;
-        // note: multiplying by 2 because there is a press and release event
-        espanso_info::add_expansion_events(keys.len() * 2);
-
-        if options.delay == 0 {
-            unsafe {
-                inject_separate_vkeys(virtual_keys.as_ptr(), virtual_keys.len() as i32);
-            }
-        } else {
-            unsafe {
-                inject_separate_vkeys_with_delay(
-                    virtual_keys.as_ptr(),
-                    virtual_keys.len() as i32,
-                    options.delay,
-                );
-            }
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn send_key_combination(&self, keys: &[keys::Key], options: InjectionOptions) -> Result<()> {
         let virtual_keys = Self::convert_to_vk_array(keys)?;
 
         if options.delay == 0 {
             unsafe {
                 inject_vkeys_combination(virtual_keys.as_ptr(), virtual_keys.len() as i32);

*** result: Success
