*** espanso-inject/src/win32/mod.rs:74:55: replace * with + in <impl Injector for Win32Injector>::send_keys

*** mutation diff:
--- espanso-inject/src/win32/mod.rs
+++ replace * with + in <impl Injector for Win32Injector>::send_keys
@@ -66,17 +66,17 @@
             inject_string(wide_string.as_ptr());
         }
         Ok(())
     }
 
     fn send_keys(&self, keys: &[keys::Key], options: InjectionOptions) -> Result<()> {
         let virtual_keys = Self::convert_to_vk_array(keys)?;
         // note: multiplying by 2 because there is a press and release event
-        espanso_info::add_expansion_events(keys.len() * 2);
+        espanso_info::add_expansion_events(keys.len() + /* ~ changed by cargo-mutants ~ */ 2);
 
         if options.delay == 0 {
             unsafe {
                 inject_separate_vkeys(virtual_keys.as_ptr(), virtual_keys.len() as i32);
             }
         } else {
             unsafe {
                 inject_separate_vkeys_with_delay(

*** result: Success
