*** espanso-inject/src/win32/mod.rs:94:9: replace <impl Injector for Win32Injector>::send_key_combination -> Result<()> with Ok(())

*** mutation diff:
--- espanso-inject/src/win32/mod.rs
+++ replace <impl Injector for Win32Injector>::send_key_combination -> Result<()> with Ok(())
@@ -86,33 +86,17 @@
                 );
             }
         }
 
         Ok(())
     }
 
     fn send_key_combination(&self, keys: &[keys::Key], options: InjectionOptions) -> Result<()> {
-        let virtual_keys = Self::convert_to_vk_array(keys)?;
-
-        if options.delay == 0 {
-            unsafe {
-                inject_vkeys_combination(virtual_keys.as_ptr(), virtual_keys.len() as i32);
-            }
-        } else {
-            unsafe {
-                inject_vkeys_combination_with_delay(
-                    virtual_keys.as_ptr(),
-                    virtual_keys.len() as i32,
-                    options.delay,
-                );
-            }
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Error, Debug)]
 pub enum Win32InjectorError {
     #[error("missing vkey mapping for key `{0}`")]
     MappingFailure(keys::Key),
 }

*** result: Success
