*** espanso-inject/src/x11/default/mod.rs:204:43: replace - with + in X11DefaultInjector::generate_maps

*** mutation diff:
--- espanso-inject/src/x11/default/mod.rs
+++ replace - with + in X11DefaultInjector::generate_maps
@@ -196,17 +196,17 @@
                     let mut sym: KeySym = 0;
                     let mut buffer: [c_char; 10] = [0; 10];
 
                     let result = unsafe {
                         Xutf8LookupString(
                             input_context,
                             &mut key_event,
                             buffer.as_mut_ptr(),
-                            (buffer.len() - 1) as i32,
+                            (buffer.len() + /* ~ changed by cargo-mutants ~ */ 1) as i32,
                             &mut sym,
                             std::ptr::null_mut(),
                         )
                     };
 
                     let key_record = KeyRecord {
                         main: KeyPair {
                             code: code_with_offset,

*** result: Success
