*** espanso-inject/src/x11/default/mod.rs:219:28: replace != with == in X11DefaultInjector::generate_maps

*** mutation diff:
--- espanso-inject/src/x11/default/mod.rs
+++ replace != with == in X11DefaultInjector::generate_maps
@@ -211,17 +211,17 @@
                         main: KeyPair {
                             code: code_with_offset,
                             state: modifier_state,
                         },
                         preceding_dead_key,
                     };
 
                     // Keysym was found
-                    if sym != 0 {
+                    if sym == /* ~ changed by cargo-mutants ~ */ 0 {
                         sym_map.entry(sym).or_insert(key_record);
                     }
 
                     // Char was found
                     if result > 0 {
                         let raw_string = unsafe { CStr::from_ptr(buffer.as_ptr()) };
                         let string = raw_string.to_string_lossy().to_string();
                         char_map.entry(string).or_insert(key_record);

*** result: Success
