*** espanso-inject/src/x11/default/mod.rs:224:31: replace > with < in X11DefaultInjector::generate_maps

*** mutation diff:
--- espanso-inject/src/x11/default/mod.rs
+++ replace > with < in X11DefaultInjector::generate_maps
@@ -216,17 +216,17 @@
                     };
 
                     // Keysym was found
                     if sym != 0 {
                         sym_map.entry(sym).or_insert(key_record);
                     }
 
                     // Char was found
-                    if result > 0 {
+                    if result < /* ~ changed by cargo-mutants ~ */ 0 {
                         let raw_string = unsafe { CStr::from_ptr(buffer.as_ptr()) };
                         let string = raw_string.to_string_lossy().to_string();
                         char_map.entry(string).or_insert(key_record);
                     }
 
                     // We need to reset the context state to prevent
                     // deadkeys effect to propagate to the next combination
                     let _reset = unsafe { XmbResetIC(input_context) };

*** result: Success
