*** espanso-inject/src/x11/default/mod.rs:337:28: replace != with == in X11DefaultInjector::get_modifier_codes

*** mutation diff:
--- espanso-inject/src/x11/default/mod.rs
+++ replace != with == in X11DefaultInjector::get_modifier_codes
@@ -329,17 +329,17 @@
                 let modifier_map = unsafe {
                     slice::from_raw_parts(
                         modifiers.modifiermap,
                         (8 * modifiers.max_keypermod) as usize,
                     )
                 };
                 let keycode =
                     modifier_map[(mod_index * modifiers.max_keypermod + mod_key) as usize];
-                if keycode != 0 {
+                if keycode == /* ~ changed by cargo-mutants ~ */ 0 {
                     modifier_codes.push(keycode);
                 }
             }
             modifiers_codes.push(modifier_codes);
         }
 
         unsafe { XFreeModifiermap(modifiers_ptr) };

*** result: Success
