*** espanso-inject/src/x11/default/mod.rs:454:24: replace != with == in X11DefaultInjector::xtest_release_all_keys

*** mutation diff:
--- espanso-inject/src/x11/default/mod.rs
+++ replace != with == in X11DefaultInjector::xtest_release_all_keys
@@ -446,17 +446,17 @@
         let mut keys: [u8; 32] = [0; 32];
         unsafe {
             XQueryKeymap(self.display, keys.as_mut_ptr());
         }
 
         #[allow(clippy::needless_range_loop)]
         for i in 0..32 {
             // Only those that are pressed should be changed
-            if keys[i] != 0 {
+            if keys[i] == /* ~ changed by cargo-mutants ~ */ 0 {
                 for k in 0..8 {
                     if (keys[i] & (1 << k)) != 0 {
                         let key_code = i * 8 + k;
                         unsafe {
                             XTestFakeKeyEvent(self.display, key_code as u32, 0, 0);
                         }
                     }
                 }

*** result: Success
