*** espanso-inject/src/x11/default/mod.rs:456:38: replace << with >> in X11DefaultInjector::xtest_release_all_keys

*** mutation diff:
--- espanso-inject/src/x11/default/mod.rs
+++ replace << with >> in X11DefaultInjector::xtest_release_all_keys
@@ -448,17 +448,17 @@
             XQueryKeymap(self.display, keys.as_mut_ptr());
         }
 
         #[allow(clippy::needless_range_loop)]
         for i in 0..32 {
             // Only those that are pressed should be changed
             if keys[i] != 0 {
                 for k in 0..8 {
-                    if (keys[i] & (1 << k)) != 0 {
+                    if (keys[i] & (1 >> /* ~ changed by cargo-mutants ~ */ k)) != 0 {
                         let key_code = i * 8 + k;
                         unsafe {
                             XTestFakeKeyEvent(self.display, key_code as u32, 0, 0);
                         }
                     }
                 }
             }
         }

*** result: Success
