*** espanso-inject/src/x11/default/mod.rs:548:9: replace <impl Injector for X11DefaultInjector>::send_key_combination -> Result<()> with Ok(())

*** mutation diff:
--- espanso-inject/src/x11/default/mod.rs
+++ replace <impl Injector for X11DefaultInjector>::send_key_combination -> Result<()> with Ok(())
@@ -540,50 +540,17 @@
                 self.send_key(focused_window, &record.main, false, delay_us);
             }
         }
 
         Ok(())
     }
 
     fn send_key_combination(&self, keys: &[keys::Key], options: InjectionOptions) -> Result<()> {
-        let focused_window = self.get_focused_window();
-
-        // Compute all the key record sequence first to make sure a mapping is available
-        let syms = convert_to_sym_array(keys)?;
-        let records = self.convert_to_record_array(&syms)?;
-
-        // Render the correct modifier mask for the given sequence
-        let records = self.render_key_combination(&records);
-
-        if options.disable_fast_inject {
-            self.xtest_release_all_keys();
-        }
-
-        let delay_us = options.delay as u32 * 1000; // Convert to micro seconds
-
-        // First press the keys
-        for record in &records {
-            if options.disable_fast_inject {
-                self.xtest_send_key(&record.main, true, delay_us);
-            } else {
-                self.send_key(focused_window, &record.main, true, delay_us);
-            }
-        }
-
-        // Then release them
-        for record in records.iter().rev() {
-            if options.disable_fast_inject {
-                self.xtest_send_key(&record.main, false, delay_us);
-            } else {
-                self.send_key(focused_window, &record.main, false, delay_us);
-            }
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Error, Debug)]
 pub enum X11InjectorError {
     #[error("failed to initialize x11 display")]
     Init(),

*** result: Success
