*** espanso-inject/src/x11/mod.rs:87:9: replace <impl Injector for X11ProxyInjector>::send_string -> Result<()> with Ok(())

*** mutation diff:
--- espanso-inject/src/x11/mod.rs
+++ replace <impl Injector for X11ProxyInjector>::send_string -> Result<()> with Ok(())
@@ -79,18 +79,17 @@
         }
 
         unreachable!()
     }
 }
 
 impl Injector for X11ProxyInjector {
     fn send_string(&self, string: &str, options: crate::InjectionOptions) -> Result<()> {
-        self.get_active_injector(&options)?
-            .send_string(string, options)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn send_keys(&self, keys: &[crate::keys::Key], options: crate::InjectionOptions) -> Result<()> {
         self.get_active_injector(&options)?.send_keys(keys, options)
     }
 
     fn send_key_combination(
         &self,

*** result: Success
