*** espanso-inject/src/x11/xdotool/mod.rs:125:42: replace * with + in X11XDOToolInjector::fast_release_all_keys

*** mutation diff:
--- espanso-inject/src/x11/xdotool/mod.rs
+++ replace * with + in X11XDOToolInjector::fast_release_all_keys
@@ -117,17 +117,17 @@
         let focused_window = self.get_focused_window();
 
         #[allow(clippy::needless_range_loop)]
         for i in 0..32 {
             // Only those that are pressed should be changed
             if keys[i] != 0 {
                 for k in 0..8 {
                     if (keys[i] & (1 << k)) != 0 {
-                        let key_code = i * 8 + k;
+                        let key_code = i + /* ~ changed by cargo-mutants ~ */ 8 + k;
                         unsafe {
                             ffi::fast_send_event(
                                 self.xdo,
                                 focused_window,
                                 key_code.try_into().unwrap(),
                                 0,
                             );
                         }

*** result: Success
