*** espanso-inject/src/x11/xdotool/mod.rs:187:35: replace * with / in <impl Injector for X11XDOToolInjector>::send_keys

*** mutation diff:
--- espanso-inject/src/x11/xdotool/mod.rs
+++ replace * with / in <impl Injector for X11XDOToolInjector>::send_keys
@@ -179,17 +179,17 @@
         keys: &[crate::keys::Key],
         options: crate::InjectionOptions,
     ) -> anyhow::Result<()> {
         let key_syms: Vec<String> = keys
             .iter()
             .filter_map(|key| unsafe { convert_key_to_keysym((*self.xdo).xdpy, key) })
             .collect();
 
-        let delay = options.delay * 1000;
+        let delay = options.delay / /* ~ changed by cargo-mutants ~ */ 1000;
 
         for key in key_syms {
             let c_str = CString::new(key).context("unable to generate CString")?;
 
             if options.disable_fast_inject {
                 unsafe {
                     xdo_send_keysequence_window(
                         self.xdo,

*** result: Success
