*** espanso-inject/src/x11/xdotool/mod.rs:54:9: replace X11XDOToolInjector::xfake_release_all_keys with ()

*** mutation diff:
--- espanso-inject/src/x11/xdotool/mod.rs
+++ replace X11XDOToolInjector::xfake_release_all_keys with ()
@@ -46,35 +46,17 @@
         }
 
         debug!("initialized xdo_t object");
 
         Ok(Self { xdo })
     }
 
     fn xfake_release_all_keys(&self) {
-        let mut keys: [u8; 32] = [0; 32];
-        unsafe {
-            XQueryKeymap((*self.xdo).xdpy, keys.as_mut_ptr());
-        }
-
-        #[allow(clippy::needless_range_loop)]
-        for i in 0..32 {
-            // Only those that are pressed should be changed
-            if keys[i] != 0 {
-                for k in 0..8 {
-                    if (keys[i] & (1 << k)) != 0 {
-                        let key_code = i * 8 + k;
-                        unsafe {
-                            XTestFakeKeyEvent((*self.xdo).xdpy, key_code as u32, 0, 0);
-                        }
-                    }
-                }
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn get_focused_window(&self) -> Window {
         let mut focused_window: Window = 0;
         let mut revert_to = 0;
         unsafe {
             XGetInputFocus((*self.xdo).xdpy, &mut focused_window, &mut revert_to);
         }

*** result: Success
