*** espanso-inject/src/x11/xdotool/mod.rs:94:9: replace X11XDOToolInjector::xfake_send_string -> anyhow::Result<()> with Ok(())

*** mutation diff:
--- espanso-inject/src/x11/xdotool/mod.rs
+++ replace X11XDOToolInjector::xfake_send_string -> anyhow::Result<()> with Ok(())
@@ -86,31 +86,17 @@
         string: &str,
         options: crate::InjectionOptions,
     ) -> anyhow::Result<()> {
         // It may happen that when an expansion is triggered, some keys are still pressed.
         // This causes a problem if the expanded match contains that character, as the injection
         // will not be able to register that keypress (as it is already pressed).
         // To solve the problem, before an expansion we get which keys are currently pressed
         // and inject a key_release event so that they can be further registered.
-        self.xfake_release_all_keys();
-
-        let c_string = CString::new(string).context("unable to create CString")?;
-        let delay = options.delay * 1000;
-
-        unsafe {
-            ffi::xdo_enter_text_window(
-                self.xdo,
-                CURRENTWINDOW,
-                c_string.as_ptr(),
-                delay.try_into().unwrap(),
-            );
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn fast_release_all_keys(&self) {
         let mut keys: [u8; 32] = [0; 32];
         unsafe {
             XQueryKeymap((*self.xdo).xdpy, keys.as_mut_ptr());
         }

*** result: Success
