*** espanso-ipc/src/util.rs:25:5: replace read_line -> Result<Option<String>> with Ok(None)

*** mutation diff:
--- espanso-ipc/src/util.rs
+++ replace read_line -> Result<Option<String>> with Ok(None)
@@ -17,29 +17,10 @@
  * along with espanso.  If not, see <https://www.gnu.org/licenses/>.
  */
 
 use anyhow::Result;
 
 // Unbuffered version, necessary to concurrently write
 // to the buffer if necessary (when receiving sync messages)
 pub fn read_line<R: std::io::Read>(stream: R) -> Result<Option<String>> {
-    let mut buffer = Vec::new();
-
-    let mut is_eof = true;
-
-    for byte_res in stream.bytes() {
-        let byte = byte_res?;
-
-        if byte == 10 {
-            // Newline
-            break;
-        }
-        buffer.push(byte);
-        is_eof = false;
-    }
-
-    if is_eof {
-        Ok(None)
-    } else {
-        Ok(Some(String::from_utf8(buffer)?))
-    }
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }

*** result: Timeout
