*** espanso-ipc/src/windows.rs:137:9: replace <impl IPCClient<Event> for WinIPCClient>::send_async -> Result<()> with Ok(())

*** mutation diff:
--- espanso-ipc/src/windows.rs
+++ replace <impl IPCClient<Event> for WinIPCClient>::send_async -> Result<()> with Ok(())
@@ -129,16 +129,11 @@
                 Err(err) => Err(IPCClientError::MalformedResponse(err.into()).into()),
             }
         } else {
             Err(IPCClientError::EmptyResponse.into())
         }
     }
 
     fn send_async(&mut self, event: Event) -> Result<()> {
-        let mut json_event = serde_json::to_string(&event)?;
-        json_event.push('\n');
-        self.stream.write_all(json_event.as_bytes())?;
-        self.stream.flush()?;
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
