*** espanso-kvs/src/persistent.rs:100:12: delete ! in <impl KVS for PersistentJsonKVS>::delete

*** mutation diff:
--- espanso-kvs/src/persistent.rs
+++ delete ! in <impl KVS for PersistentJsonKVS>::delete
@@ -92,17 +92,17 @@
 
         let target_file = self.kvs_dir.join(key);
         std::fs::write(target_file, serialized_string)?;
 
         Ok(())
     }
 
     fn delete(&self, key: &str) -> Result<()> {
-        if !is_valid_key_name(key) {
+        if  /* ~ changed by cargo-mutants ~ */is_valid_key_name(key) {
             return Err(PersistentJsonKVSError::InvalidKey(key.to_string()).into());
         }
 
         let mut lock = self.store.lock().expect("unable to obtain KVS delete lock");
 
         lock.remove(key);
 
         let target_file = self.kvs_dir.join(key);

---- tests::test_delete_non_existing_key stdout ----

thread 'tests::test_delete_non_existing_key' panicked at espanso-kvs/src/lib.rs:90:34:
called `Result::unwrap()` on an `Err` value: The provided key `my_key` is is invalid. Keys must only be composed of ascii letters, numbers and underscores.

---- tests::test_base_types stdout ----

thread 'tests::test_base_types' panicked at espanso-kvs/src/lib.rs:64:34:
called `Result::unwrap()` on an `Err` value: The provided key `my_key` is is invalid. Keys must only be composed of ascii letters, numbers and underscores.

failures:
    tests::test_base_types
    tests::test_delete_non_existing_key

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
