*** espanso-kvs/src/persistent.rs:118:23: replace || with && in is_valid_key_name

*** mutation diff:
--- espanso-kvs/src/persistent.rs
+++ replace || with && in is_valid_key_name
@@ -110,17 +110,17 @@
             std::fs::remove_file(target_file)?;
         }
 
         Ok(())
     }
 }
 
 fn is_valid_key_name(key: &str) -> bool {
-    if key.is_empty() || key.len() > 200 {
+    if key.is_empty() && /* ~ changed by cargo-mutants ~ */ key.len() > 200 {
         return false;
     }
 
     if !key.chars().all(|c| c.is_ascii_alphanumeric() || c == '_') {
         return false;
     }
 
     true

---- persistent::tests::test_invalid_key_names stdout ----

thread 'persistent::tests::test_invalid_key_names' panicked at espanso-kvs/src/persistent.rs:148:9:
assertion failed: !is_valid_key_name("")

---- tests::test_invalid_key_name stdout ----

thread 'tests::test_invalid_key_name' panicked at espanso-kvs/src/lib.rs:100:13:
assertion failed: kvs.get::<String>("").is_err()

failures:
    persistent::tests::test_invalid_key_names
    tests::test_invalid_key_name

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
