*** espanso-kvs/src/persistent.rs:118:5: replace is_valid_key_name -> bool with false

*** mutation diff:
--- espanso-kvs/src/persistent.rs
+++ replace is_valid_key_name -> bool with false
@@ -110,25 +110,17 @@
             std::fs::remove_file(target_file)?;
         }
 
         Ok(())
     }
 }
 
 fn is_valid_key_name(key: &str) -> bool {
-    if key.is_empty() || key.len() > 200 {
-        return false;
-    }
-
-    if !key.chars().all(|c| c.is_ascii_alphanumeric() || c == '_') {
-        return false;
-    }
-
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Error, Debug)]
 pub enum PersistentJsonKVSError {
     #[error("The provided key `{0}` is is invalid. Keys must only be composed of ascii letters, numbers and underscores.")]
     InvalidKey(String),
 }

---- persistent::tests::test_valid_key_names stdout ----

thread 'persistent::tests::test_valid_key_names' panicked at espanso-kvs/src/persistent.rs:133:9:
assertion failed: is_valid_key_name("key")

---- tests::test_delete_non_existing_key stdout ----

thread 'tests::test_delete_non_existing_key' panicked at espanso-kvs/src/lib.rs:90:34:
called `Result::unwrap()` on an `Err` value: The provided key `my_key` is is invalid. Keys must only be composed of ascii letters, numbers and underscores.

---- tests::test_type_mismatch stdout ----

thread 'tests::test_type_mismatch' panicked at espanso-kvs/src/lib.rs:76:49:
called `Result::unwrap()` on an `Err` value: The provided key `my_key` is is invalid. Keys must only be composed of ascii letters, numbers and underscores.

failures:
    persistent::tests::test_valid_key_names
    tests::test_base_types
    tests::test_delete_non_existing_key
    tests::test_type_mismatch

test result: FAILED. 2 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
