*** espanso-kvs/src/persistent.rs:118:5: replace is_valid_key_name -> bool with true

*** mutation diff:
--- espanso-kvs/src/persistent.rs
+++ replace is_valid_key_name -> bool with true
@@ -110,25 +110,17 @@
             std::fs::remove_file(target_file)?;
         }
 
         Ok(())
     }
 }
 
 fn is_valid_key_name(key: &str) -> bool {
-    if key.is_empty() || key.len() > 200 {
-        return false;
-    }
-
-    if !key.chars().all(|c| c.is_ascii_alphanumeric() || c == '_') {
-        return false;
-    }
-
-    true
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Error, Debug)]
 pub enum PersistentJsonKVSError {
     #[error("The provided key `{0}` is is invalid. Keys must only be composed of ascii letters, numbers and underscores.")]
     InvalidKey(String),
 }

---- persistent::tests::test_invalid_key_names stdout ----

thread 'persistent::tests::test_invalid_key_names' panicked at espanso-kvs/src/persistent.rs:140:9:
assertion failed: !is_valid_key_name("")

---- tests::test_invalid_key_name stdout ----

thread 'tests::test_invalid_key_name' panicked at espanso-kvs/src/lib.rs:99:13:
assertion failed: kvs.get::<String>("invalid key name").is_err()

failures:
    persistent::tests::test_invalid_key_names
    tests::test_invalid_key_name

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
