*** espanso-kvs/src/persistent.rs:122:55: replace || with && in is_valid_key_name

*** mutation diff:
--- espanso-kvs/src/persistent.rs
+++ replace || with && in is_valid_key_name
@@ -114,17 +114,17 @@
     }
 }
 
 fn is_valid_key_name(key: &str) -> bool {
     if key.is_empty() || key.len() > 200 {
         return false;
     }
 
-    if !key.chars().all(|c| c.is_ascii_alphanumeric() || c == '_') {
+    if !key.chars().all(|c| c.is_ascii_alphanumeric() && /* ~ changed by cargo-mutants ~ */ c == '_') {
         return false;
     }
 
     true
 }
 
 #[derive(Error, Debug)]
 pub enum PersistentJsonKVSError {

---- persistent::tests::test_valid_key_names stdout ----

thread 'persistent::tests::test_valid_key_names' panicked at espanso-kvs/src/persistent.rs:141:9:
assertion failed: is_valid_key_name("key")

---- tests::test_type_mismatch stdout ----

thread 'tests::test_type_mismatch' panicked at espanso-kvs/src/lib.rs:76:49:
called `Result::unwrap()` on an `Err` value: The provided key `my_key` is is invalid. Keys must only be composed of ascii letters, numbers and underscores.

---- tests::test_delete_non_existing_key stdout ----

thread 'tests::test_delete_non_existing_key' panicked at espanso-kvs/src/lib.rs:90:34:
called `Result::unwrap()` on an `Err` value: The provided key `my_key` is is invalid. Keys must only be composed of ascii letters, numbers and underscores.

failures:
    persistent::tests::test_valid_key_names
    tests::test_base_types
    tests::test_delete_non_existing_key
    tests::test_type_mismatch

test result: FAILED. 2 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
