*** espanso-kvs/src/persistent.rs:122:8: delete ! in is_valid_key_name

*** mutation diff:
--- espanso-kvs/src/persistent.rs
+++ delete ! in is_valid_key_name
@@ -114,17 +114,17 @@
     }
 }
 
 fn is_valid_key_name(key: &str) -> bool {
     if key.is_empty() || key.len() > 200 {
         return false;
     }
 
-    if !key.chars().all(|c| c.is_ascii_alphanumeric() || c == '_') {
+    if  /* ~ changed by cargo-mutants ~ */key.chars().all(|c| c.is_ascii_alphanumeric() || c == '_') {
         return false;
     }
 
     true
 }
 
 #[derive(Error, Debug)]
 pub enum PersistentJsonKVSError {

---- persistent::tests::test_invalid_key_names stdout ----

thread 'persistent::tests::test_invalid_key_names' panicked at espanso-kvs/src/persistent.rs:149:9:
assertion failed: !is_valid_key_name("with space")

---- persistent::tests::test_valid_key_names stdout ----

thread 'persistent::tests::test_valid_key_names' panicked at espanso-kvs/src/persistent.rs:141:9:
assertion failed: is_valid_key_name("key")

---- tests::test_invalid_key_name stdout ----

thread 'tests::test_invalid_key_name' panicked at espanso-kvs/src/lib.rs:99:13:
assertion failed: kvs.get::<String>("invalid key name").is_err()

failures:
    persistent::tests::test_invalid_key_names
    persistent::tests::test_valid_key_names
    tests::test_base_types
    tests::test_delete_non_existing_key
    tests::test_invalid_key_name
    tests::test_type_mismatch

test result: FAILED. 0 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
