*** espanso-kvs/src/persistent.rs:55:12: delete ! in <impl KVS for PersistentJsonKVS>::get

*** mutation diff:
--- espanso-kvs/src/persistent.rs
+++ delete ! in <impl KVS for PersistentJsonKVS>::get
@@ -47,17 +47,17 @@
             kvs_dir,
             store: Arc::new(Mutex::new(HashMap::new())),
         })
     }
 }
 
 impl KVS for PersistentJsonKVS {
     fn get<T: serde::de::DeserializeOwned>(&self, key: &str) -> Result<Option<T>> {
-        if !is_valid_key_name(key) {
+        if  /* ~ changed by cargo-mutants ~ */is_valid_key_name(key) {
             return Err(PersistentJsonKVSError::InvalidKey(key.to_string()).into());
         }
 
         let mut lock = self.store.lock().expect("unable to obtain KVS read lock");
 
         if let Some(cached_value) = lock.get(key) {
             let converted_value = serde_json::from_value(cached_value.clone())?;
             return Ok(Some(converted_value));

---- tests::test_type_mismatch stdout ----

thread 'tests::test_type_mismatch' panicked at espanso-kvs/src/lib.rs:76:49:
called `Result::unwrap()` on an `Err` value: The provided key `my_key` is is invalid. Keys must only be composed of ascii letters, numbers and underscores.

---- tests::test_invalid_key_name stdout ----

thread 'tests::test_invalid_key_name' panicked at espanso-kvs/src/lib.rs:99:13:
assertion failed: kvs.get::<String>("invalid key name").is_err()

---- tests::test_base_types stdout ----

thread 'tests::test_base_types' panicked at espanso-kvs/src/lib.rs:55:49:
called `Result::unwrap()` on an `Err` value: The provided key `my_key` is is invalid. Keys must only be composed of ascii letters, numbers and underscores.

failures:
    tests::test_base_types
    tests::test_invalid_key_name
    tests::test_type_mismatch

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
