*** espanso-kvs/src/persistent.rs:55:9: replace <impl KVS for PersistentJsonKVS>::get -> Result<Option<T>> with Ok(None)

*** mutation diff:
--- espanso-kvs/src/persistent.rs
+++ replace <impl KVS for PersistentJsonKVS>::get -> Result<Option<T>> with Ok(None)
@@ -47,40 +47,17 @@
             kvs_dir,
             store: Arc::new(Mutex::new(HashMap::new())),
         })
     }
 }
 
 impl KVS for PersistentJsonKVS {
     fn get<T: serde::de::DeserializeOwned>(&self, key: &str) -> Result<Option<T>> {
-        if !is_valid_key_name(key) {
-            return Err(PersistentJsonKVSError::InvalidKey(key.to_string()).into());
-        }
-
-        let mut lock = self.store.lock().expect("unable to obtain KVS read lock");
-
-        if let Some(cached_value) = lock.get(key) {
-            let converted_value = serde_json::from_value(cached_value.clone())?;
-            return Ok(Some(converted_value));
-        }
-
-        // Not found in the cache, read from the file
-        let target_file = self.kvs_dir.join(key);
-        if target_file.is_file() {
-            let content = std::fs::read_to_string(&target_file)?;
-            let deserialized_value: Value = serde_json::from_str(&content)?;
-            let converted_value = serde_json::from_value(deserialized_value.clone())?;
-
-            lock.insert(key.to_string(), deserialized_value);
-
-            return Ok(Some(converted_value));
-        }
-
-        Ok(None)
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     fn set<T: serde::Serialize>(&self, key: &str, value: T) -> Result<()> {
         if !is_valid_key_name(key) {
             return Err(PersistentJsonKVSError::InvalidKey(key.to_string()).into());
         }
 
         let mut lock = self.store.lock().expect("unable to obtain KVS write lock");

---- tests::test_invalid_key_name stdout ----

thread 'tests::test_invalid_key_name' panicked at espanso-kvs/src/lib.rs:99:13:
assertion failed: kvs.get::<String>("invalid key name").is_err()

---- tests::test_type_mismatch stdout ----

thread 'tests::test_type_mismatch' panicked at espanso-kvs/src/lib.rs:80:13:
assertion failed: kvs.get::<bool>("my_key").is_err()

---- tests::test_base_types stdout ----

thread 'tests::test_base_types' panicked at espanso-kvs/src/lib.rs:61:61:
called `Option::unwrap()` on a `None` value

failures:
    tests::test_base_types
    tests::test_invalid_key_name
    tests::test_type_mismatch

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
