*** espanso-kvs/src/persistent.rs:82:12: delete ! in <impl KVS for PersistentJsonKVS>::set

*** mutation diff:
--- espanso-kvs/src/persistent.rs
+++ delete ! in <impl KVS for PersistentJsonKVS>::set
@@ -74,17 +74,17 @@
 
             return Ok(Some(converted_value));
         }
 
         Ok(None)
     }
 
     fn set<T: serde::Serialize>(&self, key: &str, value: T) -> Result<()> {
-        if !is_valid_key_name(key) {
+        if  /* ~ changed by cargo-mutants ~ */is_valid_key_name(key) {
             return Err(PersistentJsonKVSError::InvalidKey(key.to_string()).into());
         }
 
         let mut lock = self.store.lock().expect("unable to obtain KVS write lock");
 
         let serialized_value = serde_json::to_value(value)?;
         let serialized_string = serde_json::to_string(&serialized_value)?;

---- tests::test_type_mismatch stdout ----

thread 'tests::test_type_mismatch' panicked at espanso-kvs/src/lib.rs:78:51:
called `Result::unwrap()` on an `Err` value: The provided key `my_key` is is invalid. Keys must only be composed of ascii letters, numbers and underscores.

---- tests::test_base_types stdout ----

thread 'tests::test_base_types' panicked at espanso-kvs/src/lib.rs:58:51:
called `Result::unwrap()` on an `Err` value: The provided key `my_key` is is invalid. Keys must only be composed of ascii letters, numbers and underscores.

failures:
    tests::test_base_types
    tests::test_type_mismatch

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
