*** espanso-kvs/src/persistent.rs:82:9: replace <impl KVS for PersistentJsonKVS>::set -> Result<()> with Ok(())

*** mutation diff:
--- espanso-kvs/src/persistent.rs
+++ replace <impl KVS for PersistentJsonKVS>::set -> Result<()> with Ok(())
@@ -74,31 +74,17 @@
 
             return Ok(Some(converted_value));
         }
 
         Ok(None)
     }
 
     fn set<T: serde::Serialize>(&self, key: &str, value: T) -> Result<()> {
-        if !is_valid_key_name(key) {
-            return Err(PersistentJsonKVSError::InvalidKey(key.to_string()).into());
-        }
-
-        let mut lock = self.store.lock().expect("unable to obtain KVS write lock");
-
-        let serialized_value = serde_json::to_value(value)?;
-        let serialized_string = serde_json::to_string(&serialized_value)?;
-
-        lock.insert(key.to_string(), serialized_value);
-
-        let target_file = self.kvs_dir.join(key);
-        std::fs::write(target_file, serialized_string)?;
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn delete(&self, key: &str) -> Result<()> {
         if !is_valid_key_name(key) {
             return Err(PersistentJsonKVSError::InvalidKey(key.to_string()).into());
         }
 
         let mut lock = self.store.lock().expect("unable to obtain KVS delete lock");

---- tests::test_base_types stdout ----

thread 'tests::test_base_types' panicked at espanso-kvs/src/lib.rs:61:61:
called `Option::unwrap()` on a `None` value

---- tests::test_type_mismatch stdout ----

thread 'tests::test_type_mismatch' panicked at espanso-kvs/src/lib.rs:80:13:
assertion failed: kvs.get::<bool>("my_key").is_err()

failures:
    tests::test_base_types
    tests::test_type_mismatch

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
