*** espanso-mac-utils/src/lib.rs:108:5: replace convert_to_background_app with ()

*** mutation diff:
--- espanso-mac-utils/src/lib.rs
+++ replace convert_to_background_app with ()
@@ -100,19 +100,17 @@
 pub fn convert_to_foreground_app() {
     unsafe {
         ffi::mac_utils_transition_to_foreground_app();
     }
 }
 
 #[cfg(target_os = "macos")]
 pub fn convert_to_background_app() {
-    unsafe {
-        ffi::mac_utils_transition_to_background_app();
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "macos")]
 pub fn start_headless_eventloop() {
     unsafe {
         ffi::mac_utils_start_headless_eventloop();
     }
 }

*** result: Success
