*** espanso-mac-utils/src/lib.rs:79:5: replace get_app_name_from_path -> Option<String> with Some(String::new())

*** mutation diff:
--- espanso-mac-utils/src/lib.rs
+++ replace get_app_name_from_path -> Option<String> with Some(String::new())
@@ -71,24 +71,17 @@
         }
 
         None
     }
 }
 
 #[cfg(target_os = "macos")]
 fn get_app_name_from_path(path: &str) -> Option<String> {
-    use regex::Regex;
-    use std::sync::LazyLock;
-
-    static APP_REGEX: LazyLock<Regex> =
-        LazyLock::new(|| Regex::new("/([^/]+).(app|bundle)/").unwrap());
-
-    let caps = APP_REGEX.captures(path);
-    caps.map(|caps| caps.get(1).map_or("", |m| m.as_str()).to_owned())
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "macos")]
 pub fn check_accessibility() -> bool {
     unsafe { ffi::mac_utils_check_accessibility() > 0 }
 }
 
 #[cfg(target_os = "macos")]

---- tests::test_get_app_name_from_path_security_bundle stdout ----

thread 'tests::test_get_app_name_from_path_security_bundle' panicked at espanso-mac-utils/src/lib.rs:140:9:
assertion `left == right` failed
  left: ""
 right: "SecurityAgent"

---- tests::test_get_app_name_from_path stdout ----

thread 'tests::test_get_app_name_from_path' panicked at espanso-mac-utils/src/lib.rs:128:9:
assertion `left == right` failed
  left: ""
 right: "iTerm"

---- tests::test_get_app_name_from_path_no_app_name stdout ----

thread 'tests::test_get_app_name_from_path_no_app_name' panicked at espanso-mac-utils/src/lib.rs:134:9:
assertion failed: app_name.is_none()

failures:
    tests::test_get_app_name_from_path
    tests::test_get_app_name_from_path_no_app_name
    tests::test_get_app_name_from_path_security_bundle

test result: FAILED. 0 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
