*** espanso-mac-utils/src/lib.rs:91:5: replace check_accessibility -> bool with true

*** mutation diff:
--- espanso-mac-utils/src/lib.rs
+++ replace check_accessibility -> bool with true
@@ -83,17 +83,17 @@
         LazyLock::new(|| Regex::new("/([^/]+).(app|bundle)/").unwrap());
 
     let caps = APP_REGEX.captures(path);
     caps.map(|caps| caps.get(1).map_or("", |m| m.as_str()).to_owned())
 }
 
 #[cfg(target_os = "macos")]
 pub fn check_accessibility() -> bool {
-    unsafe { ffi::mac_utils_check_accessibility() > 0 }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "macos")]
 pub fn prompt_accessibility() -> bool {
     unsafe { ffi::mac_utils_prompt_accessibility() > 0 }
 }
 
 #[cfg(target_os = "macos")]

*** result: Success
