*** espanso-mac-utils/src/lib.rs:96:52: replace > with == in prompt_accessibility

*** mutation diff:
--- espanso-mac-utils/src/lib.rs
+++ replace > with == in prompt_accessibility
@@ -88,17 +88,17 @@
 
 #[cfg(target_os = "macos")]
 pub fn check_accessibility() -> bool {
     unsafe { ffi::mac_utils_check_accessibility() > 0 }
 }
 
 #[cfg(target_os = "macos")]
 pub fn prompt_accessibility() -> bool {
-    unsafe { ffi::mac_utils_prompt_accessibility() > 0 }
+    unsafe { ffi::mac_utils_prompt_accessibility() == /* ~ changed by cargo-mutants ~ */ 0 }
 }
 
 #[cfg(target_os = "macos")]
 pub fn convert_to_foreground_app() {
     unsafe {
         ffi::mac_utils_transition_to_foreground_app();
     }
 }

*** result: Success
