*** espanso-mac-utils/src/lib.rs:96:5: replace prompt_accessibility -> bool with false

*** mutation diff:
--- espanso-mac-utils/src/lib.rs
+++ replace prompt_accessibility -> bool with false
@@ -88,17 +88,17 @@
 
 #[cfg(target_os = "macos")]
 pub fn check_accessibility() -> bool {
     unsafe { ffi::mac_utils_check_accessibility() > 0 }
 }
 
 #[cfg(target_os = "macos")]
 pub fn prompt_accessibility() -> bool {
-    unsafe { ffi::mac_utils_prompt_accessibility() > 0 }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "macos")]
 pub fn convert_to_foreground_app() {
     unsafe {
         ffi::mac_utils_transition_to_foreground_app();
     }
 }

*** result: Success
