*** espanso-match/src/regex/mod.rs:107:28: delete ! in <impl Matcher<'a, RegexMatcherState, Id> for RegexMatcher<Id>>::process

*** mutation diff:
--- espanso-match/src/regex/mod.rs
+++ delete ! in <impl Matcher<'a, RegexMatcherState, Id> for RegexMatcher<Id>>::process
@@ -99,17 +99,17 @@
         // Find matches
         if self.regex_set.is_match(&buffer) {
             let mut matches = Vec::new();
 
             for index in self.regex_set.matches(&buffer) {
                 if let (Some(id), Some(regex)) = (self.ids.get(index), self.regexes.get(index)) {
                     if let Some(captures) = regex.captures(&buffer) {
                         let full_match = captures.get(0).map_or("", |m| m.as_str());
-                        if !full_match.is_empty() {
+                        if  /* ~ changed by cargo-mutants ~ */full_match.is_empty() {
                             // Now extract the captured names as variables
                             let variables: HashMap<String, String> = regex
                                 .capture_names()
                                 .flatten()
                                 .filter_map(|n| {
                                     Some((n.to_string(), captures.name(n)?.as_str().to_string()))
                                 })
                                 .collect();

---- regex::tests::matcher_with_variables stdout ----

thread 'regex::tests::matcher_with_variables' panicked at espanso-match/src/regex/mod.rs:235:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hello(mary)", left_separator: None, right_separator: None, vars: {"name": "mary"} }]

---- regex::tests::matcher_max_buffer_size stdout ----

thread 'regex::tests::matcher_max_buffer_size' panicked at espanso-match/src/regex/mod.rs:261:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hello(mary)", left_separator: None, right_separator: None, vars: {"name": "mary"} }]

---- regex::tests::matcher_simple_matches stdout ----

thread 'regex::tests::matcher_simple_matches' panicked at espanso-match/src/regex/mod.rs:206:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hello", left_separator: None, right_separator: None, vars: {} }]

failures:
    regex::tests::matcher_max_buffer_size
    regex::tests::matcher_simple_matches
    regex::tests::matcher_with_variables

test result: FAILED. 14 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
