*** espanso-match/src/regex/mod.rs:136:16: delete ! in <impl Matcher<'a, RegexMatcherState, Id> for RegexMatcher<Id>>::process

*** mutation diff:
--- espanso-match/src/regex/mod.rs
+++ delete ! in <impl Matcher<'a, RegexMatcherState, Id> for RegexMatcher<Id>>::process
@@ -128,17 +128,17 @@
                 } else {
                     error!(
                         "received inconsistent index from regex set with index: {}",
                         index
                     );
                 }
             }
 
-            if !matches.is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */matches.is_empty() {
                 return (RegexMatcherState::default(), matches);
             }
         }
 
         let current_state = RegexMatcherState { buffer };
         (current_state, Vec::new())
     }
 }

---- regex::tests::matcher_max_buffer_size stdout ----

thread 'regex::tests::matcher_max_buffer_size' panicked at espanso-match/src/regex/mod.rs:261:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hello(mary)", left_separator: None, right_separator: None, vars: {"name": "mary"} }]

---- regex::tests::matcher_with_variables stdout ----

thread 'regex::tests::matcher_with_variables' panicked at espanso-match/src/regex/mod.rs:235:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hello(mary)", left_separator: None, right_separator: None, vars: {"name": "mary"} }]

---- regex::tests::matcher_simple_matches stdout ----

thread 'regex::tests::matcher_simple_matches' panicked at espanso-match/src/regex/mod.rs:206:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hello", left_separator: None, right_separator: None, vars: {} }]

failures:
    regex::tests::matcher_max_buffer_size
    regex::tests::matcher_simple_matches
    regex::tests::matcher_with_variables

test result: FAILED. 14 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
