*** espanso-match/src/regex/mod.rs:95:25: replace > with < in <impl Matcher<'a, RegexMatcherState, Id> for RegexMatcher<Id>>::process

*** mutation diff:
--- espanso-match/src/regex/mod.rs
+++ replace > with < in <impl Matcher<'a, RegexMatcherState, Id> for RegexMatcher<Id>>::process
@@ -87,17 +87,17 @@
             key: _,
             chars: Some(chars),
         } = event
         {
             buffer.push_str(&chars);
         }
 
         // Keep the buffer length in check
-        if buffer.len() > self.max_buffer_size {
+        if buffer.len() < /* ~ changed by cargo-mutants ~ */ self.max_buffer_size {
             buffer.remove(0);
         }
 
         // Find matches
         if self.regex_set.is_match(&buffer) {
             let mut matches = Vec::new();
 
             for index in self.regex_set.matches(&buffer) {

---- regex::tests::matcher_max_buffer_size stdout ----

thread 'regex::tests::matcher_max_buffer_size' panicked at espanso-match/src/regex/mod.rs:261:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hello(mary)", left_separator: None, right_separator: None, vars: {"name": "mary"} }]

---- regex::tests::matcher_with_variables stdout ----

thread 'regex::tests::matcher_with_variables' panicked at espanso-match/src/regex/mod.rs:235:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hello(mary)", left_separator: None, right_separator: None, vars: {"name": "mary"} }]

---- regex::tests::matcher_simple_matches stdout ----

thread 'regex::tests::matcher_simple_matches' panicked at espanso-match/src/regex/mod.rs:206:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hello", left_separator: None, right_separator: None, vars: {} }]

failures:
    regex::tests::matcher_max_buffer_size
    regex::tests::matcher_simple_matches
    regex::tests::matcher_with_variables

test result: FAILED. 14 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
