*** espanso-match/src/rolling/matcher.rs:150:9: replace RollingMatcher<Id>::find_refs -> Vec<(&'a MatcherTreeRef<Id>, IsWordSeparator)> with vec![]

*** mutation diff:
--- espanso-match/src/rolling/matcher.rs
+++ replace RollingMatcher<Id>::find_refs -> Vec<(&'a MatcherTreeRef<Id>, IsWordSeparator)> with vec![]
@@ -142,57 +142,17 @@
     }
 
     fn find_refs<'a>(
         &'a self,
         node: &'a MatcherTreeNode<Id>,
         event: &Event,
         has_previous_state: bool,
     ) -> Vec<(&'a MatcherTreeRef<Id>, IsWordSeparator)> {
-        let mut refs = Vec::new();
-
-        if let Event::Key { key, chars } = event {
-            // Key matching
-            if let Some((_, node_ref)) = node.keys.iter().find(|(k, _)| k == key) {
-                refs.push((node_ref, false));
-            }
-
-            if let Some(char) = chars {
-                // Char matching
-                if let Some((_, node_ref)) = node.chars.iter().find(|(c, _)| c == char) {
-                    refs.push((node_ref, false));
-                }
-
-                // Char case-insensitive
-                let insensitive_char = UniCase::new(char);
-                if let Some((_, node_ref)) = node
-                    .chars_insensitive
-                    .iter()
-                    .find(|(c, _)| *c == insensitive_char)
-                {
-                    refs.push((node_ref, false));
-                }
-            }
-        }
-
-        if self.is_word_separator(event) {
-            if let Some(node_ref) = node.word_separators.as_ref() {
-                refs.push((node_ref, true));
-            }
-        }
-
-        // If there is no previous state, we handle it as a word separator, exploring a step forward
-        // in the state.
-        if !has_previous_state {
-            if let Some(MatcherTreeRef::Node(node)) = node.word_separators.as_ref() {
-                refs.extend(self.find_refs(node, event, true));
-            }
-        }
-
-        refs
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_word_separator(&self, event: &Event) -> bool {
         match event {
             Event::Key { key, chars } => {
                 if self.key_word_separators.contains(key) {
                     true
                 } else if let Some(char) = chars {

---- rolling::matcher::tests::matcher_process_word_matches stdout ----

thread 'rolling::matcher::tests::matcher_process_word_matches' panicked at espanso-match/src/rolling/matcher.rs:251:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi,", left_separator: None, right_separator: Some(","), vars: {} }]

---- rolling::matcher::tests::matcher_process_case_insensitive stdout ----

thread 'rolling::matcher::tests::matcher_process_case_insensitive' panicked at espanso-match/src/rolling/matcher.rs:289:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]

---- rolling::matcher::tests::matcher_process_simple_strings stdout ----

thread 'rolling::matcher::tests::matcher_process_simple_strings' panicked at espanso-match/src/rolling/matcher.rs:213:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }, MatchResult { id: 5, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]

failures:
    rolling::matcher::tests::matcher_process_case_insensitive
    rolling::matcher::tests::matcher_process_simple_strings
    rolling::matcher::tests::matcher_process_word_matches

test result: FAILED. 14 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
