*** espanso-match/src/rolling/matcher.rs:160:80: replace == with != in RollingMatcher<Id>::find_refs

*** mutation diff:
--- espanso-match/src/rolling/matcher.rs
+++ replace == with != in RollingMatcher<Id>::find_refs
@@ -152,17 +152,17 @@
         if let Event::Key { key, chars } = event {
             // Key matching
             if let Some((_, node_ref)) = node.keys.iter().find(|(k, _)| k == key) {
                 refs.push((node_ref, false));
             }
 
             if let Some(char) = chars {
                 // Char matching
-                if let Some((_, node_ref)) = node.chars.iter().find(|(c, _)| c == char) {
+                if let Some((_, node_ref)) = node.chars.iter().find(|(c, _)| c != /* ~ changed by cargo-mutants ~ */ char) {
                     refs.push((node_ref, false));
                 }
 
                 // Char case-insensitive
                 let insensitive_char = UniCase::new(char);
                 if let Some((_, node_ref)) = node
                     .chars_insensitive
                     .iter()

---- rolling::matcher::tests::matcher_process_word_matches stdout ----

thread 'rolling::matcher::tests::matcher_process_word_matches' panicked at espanso-match/src/rolling/matcher.rs:291:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi,", left_separator: None, right_separator: Some(","), vars: {} }]

---- rolling::matcher::tests::matcher_process_simple_strings stdout ----

thread 'rolling::matcher::tests::matcher_process_simple_strings' panicked at espanso-match/src/rolling/matcher.rs:253:9:
assertion `left == right` failed
  left: [MatchResult { id: 3, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]
 right: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }, MatchResult { id: 5, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]

---- rolling::matcher::tests::matcher_process_case_insensitive stdout ----

thread 'rolling::matcher::tests::matcher_process_case_insensitive' panicked at espanso-match/src/rolling/matcher.rs:341:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 3, trigger: "arty", left_separator: None, right_separator: None, vars: {} }]

failures:
    rolling::matcher::tests::matcher_process_case_insensitive
    rolling::matcher::tests::matcher_process_simple_strings
    rolling::matcher::tests::matcher_process_word_matches

test result: FAILED. 14 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
