*** espanso-match/src/rolling/matcher.rs:169:39: replace == with != in RollingMatcher<Id>::find_refs

*** mutation diff:
--- espanso-match/src/rolling/matcher.rs
+++ replace == with != in RollingMatcher<Id>::find_refs
@@ -161,17 +161,17 @@
                     refs.push((node_ref, false));
                 }
 
                 // Char case-insensitive
                 let insensitive_char = UniCase::new(char);
                 if let Some((_, node_ref)) = node
                     .chars_insensitive
                     .iter()
-                    .find(|(c, _)| *c == insensitive_char)
+                    .find(|(c, _)| *c != /* ~ changed by cargo-mutants ~ */ insensitive_char)
                 {
                     refs.push((node_ref, false));
                 }
             }
         }
 
         if self.is_word_separator(event) {
             if let Some(node_ref) = node.word_separators.as_ref() {

---- rolling::matcher::tests::matcher_process_case_insensitive stdout ----

thread 'rolling::matcher::tests::matcher_process_case_insensitive' panicked at espanso-match/src/rolling/matcher.rs:329:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]

failures:
    rolling::matcher::tests::matcher_process_case_insensitive

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
