*** espanso-match/src/rolling/matcher.rs:184:12: delete ! in RollingMatcher<Id>::find_refs

*** mutation diff:
--- espanso-match/src/rolling/matcher.rs
+++ delete ! in RollingMatcher<Id>::find_refs
@@ -176,17 +176,17 @@
         if self.is_word_separator(event) {
             if let Some(node_ref) = node.word_separators.as_ref() {
                 refs.push((node_ref, true));
             }
         }
 
         // If there is no previous state, we handle it as a word separator, exploring a step forward
         // in the state.
-        if !has_previous_state {
+        if  /* ~ changed by cargo-mutants ~ */has_previous_state {
             if let Some(MatcherTreeRef::Node(node)) = node.word_separators.as_ref() {
                 refs.extend(self.find_refs(node, event, true));
             }
         }
 
         refs
     }

---- rolling::matcher::tests::matcher_process_word_matches stdout ----

thread 'rolling::matcher::tests::matcher_process_word_matches' panicked at espanso-match/src/rolling/matcher.rs:291:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi,", left_separator: None, right_separator: Some(","), vars: {} }]

failures:
    rolling::matcher::tests::matcher_process_word_matches

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
