*** espanso-match/src/rolling/matcher.rs:194:9: replace RollingMatcher<Id>::is_word_separator -> bool with true

*** mutation diff:
--- espanso-match/src/rolling/matcher.rs
+++ replace RollingMatcher<Id>::is_word_separator -> bool with true
@@ -186,28 +186,17 @@
                 refs.extend(self.find_refs(node, event, true));
             }
         }
 
         refs
     }
 
     fn is_word_separator(&self, event: &Event) -> bool {
-        match event {
-            Event::Key { key, chars } => {
-                if self.key_word_separators.contains(key) {
-                    true
-                } else if let Some(char) = chars {
-                    self.char_word_separators.contains(char)
-                } else {
-                    false
-                }
-            }
-            Event::VirtualSeparator => true,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::rolling::StringMatchOptions;
     use crate::util::tests::get_matches_after_str;

*** result: Success
