*** espanso-match/src/rolling/matcher.rs:194:9: replace RollingMatcher<Id>::is_word_separator -> bool with false

*** mutation diff:
--- espanso-match/src/rolling/matcher.rs
+++ replace RollingMatcher<Id>::is_word_separator -> bool with false
@@ -186,28 +186,17 @@
                 refs.extend(self.find_refs(node, event, true));
             }
         }
 
         refs
     }
 
     fn is_word_separator(&self, event: &Event) -> bool {
-        match event {
-            Event::Key { key, chars } => {
-                if self.key_word_separators.contains(key) {
-                    true
-                } else if let Some(char) = chars {
-                    self.char_word_separators.contains(char)
-                } else {
-                    false
-                }
-            }
-            Event::VirtualSeparator => true,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::rolling::StringMatchOptions;
     use crate::util::tests::get_matches_after_str;

---- rolling::matcher::tests::matcher_process_word_matches stdout ----

thread 'rolling::matcher::tests::matcher_process_word_matches' panicked at espanso-match/src/rolling/matcher.rs:280:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi,", left_separator: None, right_separator: Some(","), vars: {} }]

failures:
    rolling::matcher::tests::matcher_process_word_matches

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
