*** espanso-match/src/rolling/matcher.rs:75:9: replace <impl Matcher<'a, RollingMatcherState<'a, Id>, Id> for RollingMatcher<Id>>::process -> (RollingMatcherState<'a, Id>, Vec<MatchResult<Id>>) with (RollingMatcherState::from(Default::default()), vec![])

*** mutation diff:
--- espanso-match/src/rolling/matcher.rs
+++ replace <impl Matcher<'a, RollingMatcherState<'a, Id>, Id> for RollingMatcher<Id>>::process -> (RollingMatcherState<'a, Id>, Vec<MatchResult<Id>>) with (RollingMatcherState::from(Default::default()), vec![])
@@ -67,72 +67,17 @@
 where
     Id: Clone,
 {
     fn process(
         &'a self,
         prev_state: Option<&RollingMatcherState<'a, Id>>,
         event: Event,
     ) -> (RollingMatcherState<'a, Id>, Vec<MatchResult<Id>>) {
-        let mut next_refs = Vec::new();
-
-        // First compute the old refs
-        if let Some(prev_state) = prev_state {
-            for node_path in &prev_state.paths {
-                next_refs.extend(
-                    self.find_refs(node_path.node, &event, true)
-                        .into_iter()
-                        .map(|(node_ref, is_word_separator)| {
-                            let mut new_events = node_path.events.clone();
-                            new_events.push((event.clone(), is_word_separator));
-                            (node_ref, new_events)
-                        }),
-                );
-            }
-        }
-
-        // Calculate new ones
-        let root_refs = self.find_refs(&self.root, &event, prev_state.is_some());
-        next_refs.extend(root_refs.into_iter().map(|(node_ref, is_word_separator)| {
-            (node_ref, vec![(event.clone(), is_word_separator)])
-        }));
-
-        let mut next_paths = Vec::new();
-
-        for (node_ref, events) in next_refs {
-            match node_ref {
-                MatcherTreeRef::Matches(matches) => {
-                    let (trigger, left_separator, right_separator) =
-                        extract_string_from_events(&events);
-                    let results = matches
-                        .iter()
-                        .map(|id| MatchResult {
-                            id: id.clone(),
-                            trigger: trigger.clone(),
-                            left_separator: left_separator.clone(),
-                            right_separator: right_separator.clone(),
-                            vars: HashMap::new(),
-                        })
-                        .collect();
-
-                    // Reset the state and return the matches
-                    return (RollingMatcherState::default(), results);
-                }
-                MatcherTreeRef::Node(node) => {
-                    next_paths.push(RollingMatcherStatePath {
-                        node: node.as_ref(),
-                        events,
-                    });
-                }
-            }
-        }
-
-        let current_state = RollingMatcherState { paths: next_paths };
-
-        (current_state, Vec::new())
+        (RollingMatcherState::from(Default::default()), vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<Id: Clone> RollingMatcher<Id> {
     pub fn new(matches: &[RollingMatch<Id>], opt: RollingMatcherOptions) -> Self {
         let root = MatcherTreeNode::from_matches(matches);
         Self {
             root,

---- rolling::matcher::tests::matcher_process_case_insensitive stdout ----

thread 'rolling::matcher::tests::matcher_process_case_insensitive' panicked at espanso-match/src/rolling/matcher.rs:274:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]

---- rolling::matcher::tests::matcher_process_word_matches stdout ----

thread 'rolling::matcher::tests::matcher_process_word_matches' panicked at espanso-match/src/rolling/matcher.rs:236:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi,", left_separator: None, right_separator: Some(","), vars: {} }]

---- rolling::matcher::tests::matcher_process_simple_strings stdout ----

thread 'rolling::matcher::tests::matcher_process_simple_strings' panicked at espanso-match/src/rolling/matcher.rs:198:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }, MatchResult { id: 5, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]

failures:
    rolling::matcher::tests::matcher_process_case_insensitive
    rolling::matcher::tests::matcher_process_simple_strings
    rolling::matcher::tests::matcher_process_word_matches

test result: FAILED. 14 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
