*** espanso-match/src/rolling/tree.rs:125:17: delete match arm

*** mutation diff:
--- espanso-match/src/rolling/tree.rs
+++ delete match arm
@@ -117,19 +117,17 @@
                     node.chars_insensitive
                         .push((uni_char, MatcherTreeRef::Matches(vec![id])));
                 }
             }
         }
     } else {
         match item {
             RollingItem::WordSeparator => match node.word_separators.as_mut() {
-                Some(MatcherTreeRef::Node(next_node)) => {
-                    insert_items_recursively(id, next_node.as_mut(), &items[1..]);
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 None => {
                     let mut next_node = Box::<MatcherTreeNode<Id>>::default();
                     insert_items_recursively(id, next_node.as_mut(), &items[1..]);
                     node.word_separators = Some(MatcherTreeRef::Node(next_node));
                 }
                 _ => {}
             },
             RollingItem::Key(key) => {

---- rolling::tree::tests::generate_tree_from_items_mixed stdout ----

thread 'rolling::tree::tests::generate_tree_from_items_mixed' panicked at espanso-match/src/rolling/tree.rs:302:9:
assertion `left == right` failed

failures:
    rolling::tree::tests::generate_tree_from_items_mixed

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
