*** espanso-match/src/rolling/tree.rs:128:17: delete match arm

*** mutation diff:
--- espanso-match/src/rolling/tree.rs
+++ delete match arm
@@ -120,21 +120,17 @@
             }
         }
     } else {
         match item {
             RollingItem::WordSeparator => match node.word_separators.as_mut() {
                 Some(MatcherTreeRef::Node(next_node)) => {
                     insert_items_recursively(id, next_node.as_mut(), &items[1..]);
                 }
-                None => {
-                    let mut next_node = Box::<MatcherTreeNode<Id>>::default();
-                    insert_items_recursively(id, next_node.as_mut(), &items[1..]);
-                    node.word_separators = Some(MatcherTreeRef::Node(next_node));
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => {}
             },
             RollingItem::Key(key) => {
                 if let Some(entry) = node.keys.iter_mut().find(|(k, _)| k == key) {
                     if let MatcherTreeRef::Node(next_node) = &mut entry.1 {
                         insert_items_recursively(id, next_node, &items[1..]);
                     }
                 } else {

---- rolling::tree::tests::generate_tree_from_items_mixed stdout ----

thread 'rolling::tree::tests::generate_tree_from_items_mixed' panicked at espanso-match/src/rolling/tree.rs:300:9:
assertion `left == right` failed

---- rolling::matcher::tests::matcher_process_word_matches stdout ----

thread 'rolling::matcher::tests::matcher_process_word_matches' panicked at espanso-match/src/rolling/matcher.rs:291:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi,", left_separator: None, right_separator: Some(","), vars: {} }]

failures:
    rolling::matcher::tests::matcher_process_word_matches
    rolling::tree::tests::generate_tree_from_items_mixed

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
