*** espanso-match/src/rolling/tree.rs:148:82: replace == with != in insert_items_recursively

*** mutation diff:
--- espanso-match/src/rolling/tree.rs
+++ replace == with != in insert_items_recursively
@@ -140,17 +140,17 @@
                 } else {
                     let mut next_node = Box::<MatcherTreeNode<Id>>::default();
                     insert_items_recursively(id, next_node.as_mut(), &items[1..]);
                     node.keys
                         .push((key.clone(), MatcherTreeRef::Node(next_node)));
                 }
             }
             RollingItem::Char(c) => {
-                if let Some(entry) = node.chars.iter_mut().find(|(char, _)| char == c) {
+                if let Some(entry) = node.chars.iter_mut().find(|(char, _)| char != /* ~ changed by cargo-mutants ~ */ c) {
                     if let MatcherTreeRef::Node(next_node) = &mut entry.1 {
                         insert_items_recursively(id, next_node, &items[1..]);
                     }
                 } else {
                     let mut next_node = Box::<MatcherTreeNode<Id>>::default();
                     insert_items_recursively(id, next_node.as_mut(), &items[1..]);
                     node.chars
                         .push((c.clone(), MatcherTreeRef::Node(next_node)));

---- rolling::matcher::tests::matcher_process_simple_strings stdout ----

thread 'rolling::matcher::tests::matcher_process_simple_strings' panicked at espanso-match/src/rolling/matcher.rs:253:9:
assertion `left == right` failed
  left: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]
 right: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }, MatchResult { id: 5, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]

---- rolling::tree::tests::generate_tree_from_items_mixed stdout ----

thread 'rolling::tree::tests::generate_tree_from_items_mixed' panicked at espanso-match/src/rolling/tree.rs:304:9:
assertion `left == right` failed

---- rolling::tree::tests::generate_tree_from_items_simple_strings stdout ----

thread 'rolling::tree::tests::generate_tree_from_items_simple_strings' panicked at espanso-match/src/rolling/tree.rs:194:9:
assertion `left == right` failed

failures:
    rolling::matcher::tests::matcher_process_simple_strings
    rolling::tree::tests::generate_tree_from_items_mixed
    rolling::tree::tests::generate_tree_from_items_simple_strings

test result: FAILED. 14 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
