*** espanso-match/src/rolling/tree.rs:164:38: replace == with != in insert_items_recursively

*** mutation diff:
--- espanso-match/src/rolling/tree.rs
+++ replace == with != in insert_items_recursively
@@ -156,17 +156,17 @@
                         .push((c.clone(), MatcherTreeRef::Node(next_node)));
                 }
             }
             RollingItem::CharInsensitive(c) => {
                 let uni_char = UniCase::new(c.clone());
                 if let Some(entry) = node
                     .chars_insensitive
                     .iter_mut()
-                    .find(|(c, _)| c == &uni_char)
+                    .find(|(c, _)| c != /* ~ changed by cargo-mutants ~ */ &uni_char)
                 {
                     if let MatcherTreeRef::Node(next_node) = &mut entry.1 {
                         insert_items_recursively(id, next_node, &items[1..]);
                     }
                 } else {
                     let mut next_node = Box::<MatcherTreeNode<Id>>::default();
                     insert_items_recursively(id, next_node.as_mut(), &items[1..]);
                     node.chars_insensitive

---- rolling::matcher::tests::matcher_process_case_insensitive stdout ----

thread 'rolling::matcher::tests::matcher_process_case_insensitive' panicked at espanso-match/src/rolling/matcher.rs:341:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 3, trigger: "arty", left_separator: None, right_separator: None, vars: {} }]

failures:
    rolling::matcher::tests::matcher_process_case_insensitive

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
