*** espanso-match/src/rolling/tree.rs:56:9: replace MatcherTreeNode<Id>::from_matches -> MatcherTreeNode<Id> with MatcherTreeNode::from(Default::default())

*** mutation diff:
--- espanso-match/src/rolling/tree.rs
+++ replace MatcherTreeNode<Id>::from_matches -> MatcherTreeNode<Id> with MatcherTreeNode::from(Default::default())
@@ -48,21 +48,17 @@
     }
 }
 
 impl<Id> MatcherTreeNode<Id>
 where
     Id: Clone,
 {
     pub fn from_matches(matches: &[RollingMatch<Id>]) -> MatcherTreeNode<Id> {
-        let mut root = MatcherTreeNode::default();
-        for m in matches {
-            insert_items_recursively(m.id.clone(), &mut root, &m.items);
-        }
-        root
+        MatcherTreeNode::from(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn insert_items_recursively<Id>(id: Id, node: &mut MatcherTreeNode<Id>, items: &[RollingItem]) {
     if items.is_empty() {
         return;
     }

---- rolling::matcher::tests::matcher_process_simple_strings stdout ----

thread 'rolling::matcher::tests::matcher_process_simple_strings' panicked at espanso-match/src/rolling/matcher.rs:253:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }, MatchResult { id: 5, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]

---- rolling::matcher::tests::matcher_process_case_insensitive stdout ----

thread 'rolling::matcher::tests::matcher_process_case_insensitive' panicked at espanso-match/src/rolling/matcher.rs:329:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]

---- rolling::matcher::tests::matcher_process_word_matches stdout ----

thread 'rolling::matcher::tests::matcher_process_word_matches' panicked at espanso-match/src/rolling/matcher.rs:291:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi,", left_separator: None, right_separator: Some(","), vars: {} }]

failures:
    rolling::matcher::tests::matcher_process_case_insensitive
    rolling::matcher::tests::matcher_process_simple_strings
    rolling::matcher::tests::matcher_process_word_matches
    rolling::tree::tests::generate_tree_from_items_keys
    rolling::tree::tests::generate_tree_from_items_mixed
    rolling::tree::tests::generate_tree_from_items_simple_strings

test result: FAILED. 11 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
