*** espanso-match/src/rolling/tree.rs:70:20: replace == with != in insert_items_recursively

*** mutation diff:
--- espanso-match/src/rolling/tree.rs
+++ replace == with != in insert_items_recursively
@@ -62,17 +62,17 @@
 }
 
 fn insert_items_recursively<Id>(id: Id, node: &mut MatcherTreeNode<Id>, items: &[RollingItem]) {
     if items.is_empty() {
         return;
     }
 
     let item = items.first().unwrap();
-    if items.len() == 1 {
+    if items.len() != /* ~ changed by cargo-mutants ~ */ 1 {
         match item {
             RollingItem::WordSeparator => {
                 let mut new_matches = Vec::new();
                 if let Some(MatcherTreeRef::Matches(matches)) = node.word_separators.take() {
                     new_matches.extend(matches);
                 }
                 new_matches.push(id);
                 node.word_separators = Some(MatcherTreeRef::Matches(new_matches));

---- rolling::matcher::tests::matcher_process_word_matches stdout ----

thread 'rolling::matcher::tests::matcher_process_word_matches' panicked at espanso-match/src/rolling/matcher.rs:291:9:
assertion `left == right` failed
  left: [MatchResult { id: 1, trigger: ",", left_separator: Some(","), right_separator: None, vars: {} }]
 right: [MatchResult { id: 1, trigger: "hi,", left_separator: None, right_separator: Some(","), vars: {} }]

---- rolling::matcher::tests::matcher_process_simple_strings stdout ----

thread 'rolling::matcher::tests::matcher_process_simple_strings' panicked at espanso-match/src/rolling/matcher.rs:253:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }, MatchResult { id: 5, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]

---- rolling::matcher::tests::matcher_process_case_insensitive stdout ----

thread 'rolling::matcher::tests::matcher_process_case_insensitive' panicked at espanso-match/src/rolling/matcher.rs:329:9:
assertion `left == right` failed
  left: []
 right: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]

failures:
    rolling::matcher::tests::matcher_process_case_insensitive
    rolling::matcher::tests::matcher_process_simple_strings
    rolling::matcher::tests::matcher_process_word_matches
    rolling::tree::tests::generate_tree_from_items_keys
    rolling::tree::tests::generate_tree_from_items_mixed
    rolling::tree::tests::generate_tree_from_items_simple_strings

test result: FAILED. 11 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
