*** espanso-match/src/rolling/tree.rs:81:75: replace == with != in insert_items_recursively

*** mutation diff:
--- espanso-match/src/rolling/tree.rs
+++ replace == with != in insert_items_recursively
@@ -73,17 +73,17 @@
                 let mut new_matches = Vec::new();
                 if let Some(MatcherTreeRef::Matches(matches)) = node.word_separators.take() {
                     new_matches.extend(matches);
                 }
                 new_matches.push(id);
                 node.word_separators = Some(MatcherTreeRef::Matches(new_matches));
             }
             RollingItem::Key(key) => {
-                if let Some(entry) = node.keys.iter_mut().find(|(k, _)| k == key) {
+                if let Some(entry) = node.keys.iter_mut().find(|(k, _)| k != /* ~ changed by cargo-mutants ~ */ key) {
                     if let MatcherTreeRef::Matches(matches) = &mut entry.1 {
                         matches.push(id);
                     } else {
                         entry.1 = MatcherTreeRef::Matches(vec![id]);
                     }
                 } else {
                     node.keys
                         .push((key.clone(), MatcherTreeRef::Matches(vec![id])));

---- rolling::tree::tests::generate_tree_from_items_keys stdout ----

thread 'rolling::tree::tests::generate_tree_from_items_keys' panicked at espanso-match/src/rolling/tree.rs:249:9:
assertion `left == right` failed
  left: MatcherTreeNode { word_separators: None, keys: [(ArrowUp, Node(MatcherTreeNode { word_separators: None, keys: [(ArrowLeft, Matches([1, 2]))], chars: [], chars_insensitive: [] }))], chars: [], chars_insensitive: [] }
 right: MatcherTreeNode { word_separators: None, keys: [(ArrowUp, Node(MatcherTreeNode { word_separators: None, keys: [(ArrowLeft, Matches([1])), (ArrowRight, Matches([2]))], chars: [], chars_insensitive: [] }))], chars: [], chars_insensitive: [] }

failures:
    rolling::tree::tests::generate_tree_from_items_keys

test result: FAILED. 16 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
