*** espanso-match/src/rolling/util.rs:27:5: replace extract_string_from_events -> (String, Option<String>, Option<String>) with (String::new(), None, Some(String::new()))

*** mutation diff:
--- espanso-match/src/rolling/util.rs
+++ replace extract_string_from_events -> (String, Option<String>, Option<String>) with (String::new(), None, Some(String::new()))
@@ -19,40 +19,17 @@
 
 use crate::Event;
 
 use super::matcher::IsWordSeparator;
 
 pub(crate) fn extract_string_from_events(
     events: &[(Event, IsWordSeparator)],
 ) -> (String, Option<String>, Option<String>) {
-    let mut string = String::new();
-
-    let mut left_separator = None;
-    let mut right_separator = None;
-
-    for (i, (event, is_word_separator)) in events.iter().enumerate() {
-        if let Event::Key {
-            key: _,
-            chars: Some(chars),
-        } = event
-        {
-            string.push_str(chars);
-
-            if *is_word_separator {
-                if i == 0 {
-                    left_separator = Some(chars.clone());
-                } else if i == (events.len() - 1) {
-                    right_separator = Some(chars.clone());
-                }
-            }
-        }
-    }
-
-    (string, left_separator, right_separator)
+    (String::new(), None, Some(String::new())) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::event::Key;
 
     #[test]

---- rolling::matcher::tests::matcher_process_word_matches stdout ----

thread 'rolling::matcher::tests::matcher_process_word_matches' panicked at espanso-match/src/rolling/matcher.rs:291:9:
assertion `left == right` failed
  left: [MatchResult { id: 1, trigger: "", left_separator: None, right_separator: Some(""), vars: {} }]
 right: [MatchResult { id: 1, trigger: "hi,", left_separator: None, right_separator: Some(","), vars: {} }]

---- rolling::matcher::tests::matcher_process_simple_strings stdout ----

thread 'rolling::matcher::tests::matcher_process_simple_strings' panicked at espanso-match/src/rolling/matcher.rs:253:9:
assertion `left == right` failed
  left: [MatchResult { id: 1, trigger: "", left_separator: None, right_separator: Some(""), vars: {} }, MatchResult { id: 5, trigger: "", left_separator: None, right_separator: Some(""), vars: {} }]
 right: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }, MatchResult { id: 5, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]

---- rolling::matcher::tests::matcher_process_case_insensitive stdout ----

thread 'rolling::matcher::tests::matcher_process_case_insensitive' panicked at espanso-match/src/rolling/matcher.rs:329:9:
assertion `left == right` failed
  left: [MatchResult { id: 1, trigger: "", left_separator: None, right_separator: Some(""), vars: {} }]
 right: [MatchResult { id: 1, trigger: "hi", left_separator: None, right_separator: None, vars: {} }]

failures:
    rolling::matcher::tests::matcher_process_case_insensitive
    rolling::matcher::tests::matcher_process_simple_strings
    rolling::matcher::tests::matcher_process_word_matches
    rolling::util::tests::extract_string_from_events_all_chars
    rolling::util::tests::extract_string_from_events_mixed
    rolling::util::tests::extract_string_from_events_no_chars
    rolling::util::tests::extract_string_from_events_word_separators

test result: FAILED. 10 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
