*** espanso-match/src/rolling/util.rs:41:22: replace == with != in extract_string_from_events

*** mutation diff:
--- espanso-match/src/rolling/util.rs
+++ replace == with != in extract_string_from_events
@@ -33,17 +33,17 @@
         if let Event::Key {
             key: _,
             chars: Some(chars),
         } = event
         {
             string.push_str(chars);
 
             if *is_word_separator {
-                if i == 0 {
+                if i != /* ~ changed by cargo-mutants ~ */ 0 {
                     left_separator = Some(chars.clone());
                 } else if i == (events.len() - 1) {
                     right_separator = Some(chars.clone());
                 }
             }
         }
     }

---- rolling::matcher::tests::matcher_process_word_matches stdout ----

thread 'rolling::matcher::tests::matcher_process_word_matches' panicked at espanso-match/src/rolling/matcher.rs:291:9:
assertion `left == right` failed
  left: [MatchResult { id: 1, trigger: "hi,", left_separator: Some(","), right_separator: None, vars: {} }]
 right: [MatchResult { id: 1, trigger: "hi,", left_separator: None, right_separator: Some(","), vars: {} }]

---- rolling::util::tests::extract_string_from_events_word_separators stdout ----

thread 'rolling::util::tests::extract_string_from_events_word_separators' panicked at espanso-match/src/rolling/util.rs:104:9:
assertion `left == right` failed
  left: (".hi,", Some(","), None)
 right: (".hi,", Some("."), Some(","))

failures:
    rolling::matcher::tests::matcher_process_word_matches
    rolling::util::tests::extract_string_from_events_word_separators

test result: FAILED. 15 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
