*** espanso-modulo/src/form/config.rs:161:5: replace default_type -> String with String::new()

*** mutation diff:
--- espanso-modulo/src/form/config.rs
+++ replace default_type -> String with String::new()
@@ -153,17 +153,17 @@
             }
         };
 
         Self { field_type }
     }
 }
 
 fn default_type() -> String {
-    "text".to_owned()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn default_default() -> Option<String> {
     None
 }
 
 fn default_multiline() -> bool {
     false

*** result: Success
