*** espanso-modulo/src/form/config.rs:24:5: replace default_title -> String with "xyzzy".into()

*** mutation diff:
--- espanso-modulo/src/form/config.rs
+++ replace default_title -> String with "xyzzy".into()
@@ -16,17 +16,17 @@
  * You should have received a copy of the GNU General Public License
  * along with modulo.  If not, see <https://www.gnu.org/licenses/>.
  */
 
 use serde::{Deserialize, Deserializer, Serialize};
 use std::collections::HashMap;
 
 fn default_title() -> String {
-    "espanso".to_owned()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn default_icon() -> Option<String> {
     None
 }
 
 fn default_fields() -> HashMap<String, FieldConfig> {
     HashMap::new()

*** result: Success
