*** espanso-modulo/src/form/config.rs:28:5: replace default_icon -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- espanso-modulo/src/form/config.rs
+++ replace default_icon -> Option<String> with Some("xyzzy".into())
@@ -20,17 +20,17 @@
 use serde::{Deserialize, Deserializer, Serialize};
 use std::collections::HashMap;
 
 fn default_title() -> String {
     "espanso".to_owned()
 }
 
 fn default_icon() -> Option<String> {
-    None
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn default_fields() -> HashMap<String, FieldConfig> {
     HashMap::new()
 }
 
 fn default_max_form_width() -> i32 {
     700

*** result: Success
