*** espanso-modulo/src/form/config.rs:40:5: replace default_max_form_height -> i32 with 0

*** mutation diff:
--- espanso-modulo/src/form/config.rs
+++ replace default_max_form_height -> i32 with 0
@@ -32,17 +32,17 @@
     HashMap::new()
 }
 
 fn default_max_form_width() -> i32 {
     700
 }
 
 fn default_max_form_height() -> i32 {
-    500
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Serialize, Deserialize, Clone)]
 pub struct FormConfig {
     #[serde(default = "default_title")]
     pub title: String,
 
     #[serde(default = "default_icon")]

*** result: Success
