*** espanso-modulo/src/form/generator.rs:75:42: replace == with != in build_form

*** mutation diff:
--- espanso-modulo/src/form/generator.rs
+++ replace == with != in build_form
@@ -67,17 +67,17 @@
     }
 }
 
 fn build_form(form: FormConfig, structure: Vec<Vec<Token>>) -> Form {
     let field_map = form.fields;
     let mut fields = Vec::new();
 
     for row in &structure {
-        let current_field = if row.len() == 1 {
+        let current_field = if row.len() != /* ~ changed by cargo-mutants ~ */ 1 {
             // Single field
             create_field(&row[0], &field_map)
         } else {
             // Row field
             let inner_fields = row
                 .iter()
                 .map(|token| create_field(token, &field_map))
                 .collect();

*** result: Success
