*** espanso-modulo/src/form/parser/layout.rs:35:5: replace parse_layout -> Vec<Vec<Token>> with vec![vec![]]

*** mutation diff:
--- espanso-modulo/src/form/parser/layout.rs
+++ replace parse_layout -> Vec<Vec<Token>> with vec![vec![]]
@@ -27,54 +27,17 @@
 
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum Token {
     Text(String),  // Text
     Field(String), // id: String
 }
 
 pub fn parse_layout(layout: &str) -> Vec<Vec<Token>> {
-    let mut rows = Vec::new();
-
-    for line in layout.lines() {
-        let line = line.trim();
-
-        // Skip empty lines
-        if line.is_empty() {
-            continue;
-        }
-
-        let mut row: Vec<Token> = Vec::new();
-
-        let splitter = SplitCaptures::new(&FIELD_REGEX, line);
-
-        // Get the individual tokens
-        for state in splitter {
-            match state {
-                SplitState::Unmatched(text) => {
-                    if !text.is_empty() {
-                        row.push(Token::Text(text.to_owned()));
-                    }
-                }
-                SplitState::Captured(caps) => {
-                    if let Some(name) = caps.get(1) {
-                        let name = name.as_str().to_owned();
-                        row.push(Token::Field(name));
-                    } else if let Some(name) = caps.get(2) {
-                        let name = name.as_str().to_owned();
-                        row.push(Token::Field(name));
-                    }
-                }
-            }
-        }
-
-        rows.push(row);
-    }
-
-    rows
+    vec![vec![]] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn test_parse_layout() {

---- form::parser::layout::tests::test_parse_layout stdout ----

thread 'form::parser::layout::tests::test_parse_layout' panicked at espanso-modulo/src/form/parser/layout.rs:46:9:
assertion `left == right` failed
  left: [[]]
 right: [[Text("Hey "), Field("name"), Text(",")], [Text("How are you?")], [Text("Cheers")]]

---- form::parser::layout::tests::test_parse_layout_legacy_syntax stdout ----

thread 'form::parser::layout::tests::test_parse_layout_legacy_syntax' panicked at espanso-modulo/src/form/parser/layout.rs:80:9:
assertion `left == right` failed
  left: [[]]
 right: [[Text("Hey "), Field("name"), Text(",")], [Text("How are you?")], [Text("Cheers")]]

---- form::parser::layout::tests::test_parse_layout_2 stdout ----

thread 'form::parser::layout::tests::test_parse_layout_2' panicked at espanso-modulo/src/form/parser/layout.rs:64:9:
assertion `left == right` failed
  left: [[]]
 right: [[Text("Hey "), Field("name"), Text(" "), Field("surname"), Text(",")]]

failures:
    form::parser::layout::tests::test_parse_layout
    form::parser::layout::tests::test_parse_layout_2
    form::parser::layout::tests::test_parse_layout_legacy_syntax

test result: FAILED. 0 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
