*** espanso-modulo/src/form/parser/layout.rs:53:24: delete ! in parse_layout

*** mutation diff:
--- espanso-modulo/src/form/parser/layout.rs
+++ delete ! in parse_layout
@@ -45,17 +45,17 @@
         let mut row: Vec<Token> = Vec::new();
 
         let splitter = SplitCaptures::new(&FIELD_REGEX, line);
 
         // Get the individual tokens
         for state in splitter {
             match state {
                 SplitState::Unmatched(text) => {
-                    if !text.is_empty() {
+                    if  /* ~ changed by cargo-mutants ~ */text.is_empty() {
                         row.push(Token::Text(text.to_owned()));
                     }
                 }
                 SplitState::Captured(caps) => {
                     if let Some(name) = caps.get(1) {
                         let name = name.as_str().to_owned();
                         row.push(Token::Field(name));
                     } else if let Some(name) = caps.get(2) {

---- form::parser::layout::tests::test_parse_layout stdout ----

thread 'form::parser::layout::tests::test_parse_layout' panicked at espanso-modulo/src/form/parser/layout.rs:83:9:
assertion `left == right` failed
  left: [[Field("name")], [], []]
 right: [[Text("Hey "), Field("name"), Text(",")], [Text("How are you?")], [Text("Cheers")]]

---- form::parser::layout::tests::test_parse_layout_legacy_syntax stdout ----

thread 'form::parser::layout::tests::test_parse_layout_legacy_syntax' panicked at espanso-modulo/src/form/parser/layout.rs:117:9:
assertion `left == right` failed
  left: [[Field("name")], [], []]
 right: [[Text("Hey "), Field("name"), Text(",")], [Text("How are you?")], [Text("Cheers")]]

---- form::parser::layout::tests::test_parse_layout_2 stdout ----

thread 'form::parser::layout::tests::test_parse_layout_2' panicked at espanso-modulo/src/form/parser/layout.rs:101:9:
assertion `left == right` failed
  left: [[Field("name"), Field("surname")]]
 right: [[Text("Hey "), Field("name"), Text(" "), Field("surname"), Text(",")]]

failures:
    form::parser::layout::tests::test_parse_layout
    form::parser::layout::tests::test_parse_layout_2
    form::parser::layout::tests::test_parse_layout_legacy_syntax

test result: FAILED. 0 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
