*** espanso-modulo/src/form/parser/split.rs:32:9: replace <impl Iterator for SplitCaptures<'_, 't>>::next -> Option<SplitState<'t>> with None

*** mutation diff:
--- espanso-modulo/src/form/parser/split.rs
+++ replace <impl Iterator for SplitCaptures<'_, 't>>::next -> Option<SplitState<'t>> with None
@@ -24,31 +24,11 @@
     Unmatched(&'t str),
     Captured(Captures<'t>),
 }
 
 impl<'t> Iterator for SplitCaptures<'_, 't> {
     type Item = SplitState<'t>;
 
     fn next(&mut self) -> Option<SplitState<'t>> {
-        if let Some(caps) = self.caps.take() {
-            return Some(SplitState::Captured(caps));
-        }
-        match self.finder.next() {
-            None => {
-                if self.last >= self.text.len() {
-                    None
-                } else {
-                    let s = &self.text[self.last..];
-                    self.last = self.text.len();
-                    Some(SplitState::Unmatched(s))
-                }
-            }
-            Some(caps) => {
-                let m = caps.get(0).unwrap();
-                let unmatched = &self.text[self.last..m.start()];
-                self.last = m.end();
-                self.caps = Some(caps);
-                Some(SplitState::Unmatched(unmatched))
-            }
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }

---- form::parser::layout::tests::test_parse_layout stdout ----

thread 'form::parser::layout::tests::test_parse_layout' panicked at espanso-modulo/src/form/parser/layout.rs:83:9:
assertion `left == right` failed
  left: [[], [], []]
 right: [[Text("Hey "), Field("name"), Text(",")], [Text("How are you?")], [Text("Cheers")]]

---- form::parser::layout::tests::test_parse_layout_2 stdout ----

thread 'form::parser::layout::tests::test_parse_layout_2' panicked at espanso-modulo/src/form/parser/layout.rs:101:9:
assertion `left == right` failed
  left: [[]]
 right: [[Text("Hey "), Field("name"), Text(" "), Field("surname"), Text(",")]]

---- form::parser::layout::tests::test_parse_layout_legacy_syntax stdout ----

thread 'form::parser::layout::tests::test_parse_layout_legacy_syntax' panicked at espanso-modulo/src/form/parser/layout.rs:117:9:
assertion `left == right` failed
  left: [[], [], []]
 right: [[Text("Hey "), Field("name"), Text(",")], [Text("How are you?")], [Text("Cheers")]]

failures:
    form::parser::layout::tests::test_parse_layout
    form::parser::layout::tests::test_parse_layout_2
    form::parser::layout::tests::test_parse_layout_legacy_syntax

test result: FAILED. 0 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
