*** espanso-modulo/src/form/parser/split.rs:37:30: replace >= with < in <impl Iterator for SplitCaptures<'_, 't>>::next

*** mutation diff:
--- espanso-modulo/src/form/parser/split.rs
+++ replace >= with < in <impl Iterator for SplitCaptures<'_, 't>>::next
@@ -29,17 +29,17 @@
     type Item = SplitState<'t>;
 
     fn next(&mut self) -> Option<SplitState<'t>> {
         if let Some(caps) = self.caps.take() {
             return Some(SplitState::Captured(caps));
         }
         match self.finder.next() {
             None => {
-                if self.last >= self.text.len() {
+                if self.last < /* ~ changed by cargo-mutants ~ */ self.text.len() {
                     None
                 } else {
                     let s = &self.text[self.last..];
                     self.last = self.text.len();
                     Some(SplitState::Unmatched(s))
                 }
             }
             Some(caps) => {

---- form::parser::layout::tests::test_parse_layout stdout ----

thread 'form::parser::layout::tests::test_parse_layout' panicked at espanso-modulo/src/form/parser/layout.rs:83:9:
assertion `left == right` failed
  left: [[Text("Hey "), Field("name")], [], []]
 right: [[Text("Hey "), Field("name"), Text(",")], [Text("How are you?")], [Text("Cheers")]]

---- form::parser::layout::tests::test_parse_layout_legacy_syntax stdout ----

thread 'form::parser::layout::tests::test_parse_layout_legacy_syntax' panicked at espanso-modulo/src/form/parser/layout.rs:117:9:
assertion `left == right` failed
  left: [[Text("Hey "), Field("name")], [], []]
 right: [[Text("Hey "), Field("name"), Text(",")], [Text("How are you?")], [Text("Cheers")]]

---- form::parser::layout::tests::test_parse_layout_2 stdout ----

thread 'form::parser::layout::tests::test_parse_layout_2' panicked at espanso-modulo/src/form/parser/layout.rs:101:9:
assertion `left == right` failed
  left: [[Text("Hey "), Field("name"), Text(" "), Field("surname")]]
 right: [[Text("Hey "), Field("name"), Text(" "), Field("surname"), Text(",")]]

failures:
    form::parser::layout::tests::test_parse_layout
    form::parser::layout::tests::test_parse_layout_2
    form::parser::layout::tests::test_parse_layout_legacy_syntax

test result: FAILED. 0 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
