*** espanso-modulo/src/search/algorithm.rs:29:9: delete match arm

*** mutation diff:
--- espanso-modulo/src/search/algorithm.rs
+++ delete match arm
@@ -21,17 +21,17 @@
 
 use crate::sys::search::types::SearchItem;
 
 type FilterCallback = dyn Fn(&str, &[SearchItem]) -> Vec<usize>;
 
 pub fn get_algorithm(name: &str, use_command_filter: bool) -> Box<FilterCallback> {
     let search_algorithm: Box<FilterCallback> = match name {
         "exact" => Box::new(exact_match),
-        "iexact" => Box::new(case_insensitive_exact_match),
+         /* ~ changed by cargo-mutants ~ */
         "ikey" => Box::new(case_insensitive_keyword),
         _ => panic!("unknown search algorithm: {name}"),
     };
 
     if use_command_filter {
         command_filter(search_algorithm)
     } else {
         search_algorithm

*** result: Success
