*** espanso-modulo/src/search/algorithm.rs:47:17: replace || with && in exact_match

*** mutation diff:
--- espanso-modulo/src/search/algorithm.rs
+++ replace || with && in exact_match
@@ -39,17 +39,17 @@
 }
 
 fn exact_match(query: &str, items: &[SearchItem]) -> Vec<usize> {
     items
         .iter()
         .enumerate()
         .filter(|(_, item)| {
             item.label.contains(query)
-                || item.trigger.as_deref().is_some_and(|t| t.contains(query))
+                && /* ~ changed by cargo-mutants ~ */ item.trigger.as_deref().is_some_and(|t| t.contains(query))
                 || item.search_terms.iter().any(|term| term.contains(query))
         })
         .map(|(i, _)| i)
         .collect()
 }
 
 fn case_insensitive_exact_match(query: &str, items: &[SearchItem]) -> Vec<usize> {
     let lowercase_query = query.to_lowercase();

*** result: Success
