*** espanso-modulo/src/search/algorithm.rs:61:17: replace || with && in case_insensitive_exact_match

*** mutation diff:
--- espanso-modulo/src/search/algorithm.rs
+++ replace || with && in case_insensitive_exact_match
@@ -53,17 +53,17 @@
 
 fn case_insensitive_exact_match(query: &str, items: &[SearchItem]) -> Vec<usize> {
     let lowercase_query = query.to_lowercase();
     items
         .iter()
         .enumerate()
         .filter(|(_, item)| {
             item.label.to_lowercase().contains(&lowercase_query)
-                || item
+                && /* ~ changed by cargo-mutants ~ */ item
                     .trigger
                     .as_deref()
                     .is_some_and(|t| t.to_lowercase().contains(query))
                 || item
                     .search_terms
                     .iter()
                     .any(|term| term.to_lowercase().contains(&lowercase_query))
         })

*** result: Success
