*** espanso-modulo/src/search/algorithm.rs:82:20: delete ! in case_insensitive_keyword

*** mutation diff:
--- espanso-modulo/src/search/algorithm.rs
+++ delete ! in case_insensitive_keyword
@@ -74,17 +74,17 @@
 fn case_insensitive_keyword(query: &str, items: &[SearchItem]) -> Vec<usize> {
     let lowercase_query = query.to_lowercase();
     let keywords: Vec<&str> = lowercase_query.split_whitespace().collect();
     items
         .iter()
         .enumerate()
         .filter(|(_, item)| {
             for keyword in &keywords {
-                if !item.label.to_lowercase().contains(keyword)
+                if  /* ~ changed by cargo-mutants ~ */item.label.to_lowercase().contains(keyword)
                     && !item
                         .trigger
                         .as_deref()
                         .is_some_and(|t| t.to_lowercase().contains(keyword))
                     && !item
                         .search_terms
                         .iter()
                         .any(|term| term.to_lowercase().contains(keyword))

*** result: Success
