*** espanso-modulo/src/search/algorithm.rs:87:21: replace && with || in case_insensitive_keyword

*** mutation diff:
--- espanso-modulo/src/search/algorithm.rs
+++ replace && with || in case_insensitive_keyword
@@ -79,17 +79,17 @@
         .enumerate()
         .filter(|(_, item)| {
             for keyword in &keywords {
                 if !item.label.to_lowercase().contains(keyword)
                     && !item
                         .trigger
                         .as_deref()
                         .is_some_and(|t| t.to_lowercase().contains(keyword))
-                    && !item
+                    || /* ~ changed by cargo-mutants ~ */ !item
                         .search_terms
                         .iter()
                         .any(|term| term.to_lowercase().contains(keyword))
                 {
                     return false;
                 }
             }

*** result: Success
