*** espanso-modulo/src/search/config.rs:23:5: replace default_title -> String with String::new()

*** mutation diff:
--- espanso-modulo/src/search/config.rs
+++ replace default_title -> String with String::new()
@@ -15,17 +15,17 @@
  *
  * You should have received a copy of the GNU General Public License
  * along with modulo.  If not, see <https://www.gnu.org/licenses/>.
  */
 
 use serde::{Deserialize, Serialize};
 
 fn default_title() -> String {
-    "espanso".to_owned()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn default_icon() -> Option<String> {
     None
 }
 
 fn default_items() -> Vec<SearchItem> {
     Vec::new()

*** result: Success
