*** espanso-modulo/src/sys/wizard/mod.rs:100:13: delete - in show::is_accessibility_enabled

*** mutation diff:
--- espanso-modulo/src/sys/wizard/mod.rs
+++ delete - in show::is_accessibility_enabled
@@ -92,17 +92,17 @@
     extern "C" fn is_accessibility_enabled() -> c_int {
         let lock = HANDLERS
             .lock()
             .expect("unable to acquire lock in is_accessibility_enabled method");
         let handlers_ref = (*lock).as_ref().expect("unable to unwrap handlers");
         if let Some(handler_ref) = handlers_ref.is_accessibility_enabled.as_ref() {
             i32::from((*handler_ref)())
         } else {
-            -1
+             /* ~ changed by cargo-mutants ~ */1
         }
     }
 
     extern "C" fn on_completed() {
         let lock = HANDLERS
             .lock()
             .expect("unable to acquire lock in on_completed method");
         let handlers_ref = (*lock).as_ref().expect("unable to unwrap handlers");

*** result: Success
