*** espanso-modulo/src/sys/wizard/mod.rs:48:9: replace show::is_legacy_version_running -> c_int with Default::default()

*** mutation diff:
--- espanso-modulo/src/sys/wizard/mod.rs
+++ replace show::is_legacy_version_running -> c_int with Default::default()
@@ -40,17 +40,17 @@
     let (_c_welcome_image, c_welcome_image_path_ptr) =
         convert_to_cstring_or_null(options.welcome_image_path);
     let (_c_accessibility_image_1_path, c_accessibility_image_1_path_ptr) =
         convert_to_cstring_or_null(options.accessibility_image_1_path);
     let (_c_accessibility_image_2_path, c_accessibility_image_2_path_ptr) =
         convert_to_cstring_or_null(options.accessibility_image_2_path);
 
     extern "C" fn is_legacy_version_running() -> c_int {
-        -1
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     extern "C" fn backup_and_migrate() -> c_int {
         3 // WIZARD_MIGRATE_RESULT_UNKNOWN_FAILURE
     }
 
     extern "C" fn auto_start(auto_start: c_int) -> c_int {
         let lock = HANDLERS

*** result: Success
