*** espanso-modulo/src/sys/wizard/mod.rs:61:49: replace != with == in show::auto_start

*** mutation diff:
--- espanso-modulo/src/sys/wizard/mod.rs
+++ replace != with == in show::auto_start
@@ -53,17 +53,17 @@
     }
 
     extern "C" fn auto_start(auto_start: c_int) -> c_int {
         let lock = HANDLERS
             .lock()
             .expect("unable to acquire lock in auto_start method");
         let handlers_ref = (*lock).as_ref().expect("unable to unwrap handlers");
         if let Some(handler_ref) = handlers_ref.auto_start.as_ref() {
-            i32::from((*handler_ref)(auto_start != 0))
+            i32::from((*handler_ref)(auto_start == /* ~ changed by cargo-mutants ~ */ 0))
         } else {
             -1
         }
     }
 
     extern "C" fn add_to_path() -> c_int {
         let lock = HANDLERS
             .lock()

*** result: Success
