*** espanso-modulo/src/sys/wizard/mod.rs:68:9: replace show::add_to_path -> c_int with Default::default()

*** mutation diff:
--- espanso-modulo/src/sys/wizard/mod.rs
+++ replace show::add_to_path -> c_int with Default::default()
@@ -60,25 +60,17 @@
         if let Some(handler_ref) = handlers_ref.auto_start.as_ref() {
             i32::from((*handler_ref)(auto_start != 0))
         } else {
             -1
         }
     }
 
     extern "C" fn add_to_path() -> c_int {
-        let lock = HANDLERS
-            .lock()
-            .expect("unable to acquire lock in add_to_path method");
-        let handlers_ref = (*lock).as_ref().expect("unable to unwrap handlers");
-        if let Some(handler_ref) = handlers_ref.add_to_path.as_ref() {
-            i32::from((*handler_ref)())
-        } else {
-            -1
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     extern "C" fn enable_accessibility() -> c_int {
         let lock = HANDLERS
             .lock()
             .expect("unable to acquire lock in enable_accessibility method");
         let handlers_ref = (*lock).as_ref().expect("unable to unwrap handlers");
         if let Some(handler_ref) = handlers_ref.enable_accessibility.as_ref() {

*** result: Success
