*** espanso-package/src/archive/default.rs:101:12: delete ! in <impl Archiver for DefaultArchiver>::get

*** mutation diff:
--- espanso-package/src/archive/default.rs
+++ delete ! in <impl Archiver for DefaultArchiver>::get
@@ -93,17 +93,17 @@
             .context("unable to load archived package")?;
 
         Ok(archived_package)
     }
 
     fn get(&self, name: &str) -> Result<StoredPackage> {
         let target_dir = self.package_dir.join(name);
 
-        if !target_dir.is_dir() {
+        if  /* ~ changed by cargo-mutants ~ */target_dir.is_dir() {
             bail!("package '{}' not found", name);
         }
 
         let manifest_path = target_dir.join("_manifest.yml");
         if !manifest_path.is_file() {
             return Ok(StoredPackage::Legacy(LegacyPackage {
                 name: name.to_string(),
             }));

---- archive::default::tests::test_list_packages stdout ----

thread 'archive::default::tests::test_list_packages' panicked at espanso-package/src/archive/default.rs:335:48:
called `Result::unwrap()` on an `Err` value: package 'z_legacypackage1' not found

failures:
    archive::default::tests::test_list_packages

test result: FAILED. 10 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
