*** espanso-package/src/archive/default.rs:106:12: delete ! in <impl Archiver for DefaultArchiver>::get

*** mutation diff:
--- espanso-package/src/archive/default.rs
+++ delete ! in <impl Archiver for DefaultArchiver>::get
@@ -98,17 +98,17 @@
     fn get(&self, name: &str) -> Result<StoredPackage> {
         let target_dir = self.package_dir.join(name);
 
         if !target_dir.is_dir() {
             bail!("package '{}' not found", name);
         }
 
         let manifest_path = target_dir.join("_manifest.yml");
-        if !manifest_path.is_file() {
+        if  /* ~ changed by cargo-mutants ~ */manifest_path.is_file() {
             return Ok(StoredPackage::Legacy(LegacyPackage {
                 name: name.to_string(),
             }));
         }
 
         let manifest =
             Manifest::parse(&manifest_path).context("unable to parse package manifest")?;

---- archive::default::tests::test_list_packages stdout ----

thread 'archive::default::tests::test_list_packages' panicked at espanso-package/src/archive/default.rs:335:48:
called `Result::unwrap()` on an `Err` value: unable to parse package manifest

Caused by:
    No such file or directory (os error 2)

failures:
    archive::default::tests::test_list_packages

test result: FAILED. 10 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
