*** espanso-package/src/archive/default.rs:123:9: replace <impl Archiver for DefaultArchiver>::list -> Result<Vec<StoredPackage>> with Ok(vec![])

*** mutation diff:
--- espanso-package/src/archive/default.rs
+++ replace <impl Archiver for DefaultArchiver>::list -> Result<Vec<StoredPackage>> with Ok(vec![])
@@ -115,32 +115,17 @@
         let source_path = target_dir.join(PACKAGE_SOURCE_FILE);
         let source =
             PackageSource::parse(&source_path).context("unable to parse package source file")?;
 
         Ok(StoredPackage::Modern(ArchivedPackage { manifest, source }))
     }
 
     fn list(&self) -> Result<Vec<StoredPackage>> {
-        let mut output = Vec::new();
-
-        for path in std::fs::read_dir(&self.package_dir)? {
-            let path = path?.path();
-            if !path.is_dir() {
-                continue;
-            }
-
-            if let Some(package_name) = path.file_name() {
-                let package_name = package_name.to_string_lossy().to_string();
-
-                output.push(self.get(&package_name)?);
-            }
-        }
-
-        Ok(output)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn delete(&self, name: &str) -> Result<()> {
         let target_dir = self.package_dir.join(name);
 
         if !target_dir.is_dir() {
             bail!("package {} not found", name);
         }

---- archive::default::tests::test_list_packages stdout ----

thread 'archive::default::tests::test_list_packages' panicked at espanso-package/src/archive/default.rs:322:13:
assertion failed: package_list.iter().any(|package|
        *package ==
            StoredPackage::Modern(ArchivedPackage {
                    manifest: Manifest::parse(&package_out_dir.join("_manifest.yml")).unwrap(),
                    source: PackageSource::parse(&package_out_dir.join(PACKAGE_SOURCE_FILE)).unwrap(),
                }))

failures:
    archive::default::tests::test_list_packages

test result: FAILED. 10 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
