*** espanso-package/src/archive/default.rs:127:16: delete ! in <impl Archiver for DefaultArchiver>::list

*** mutation diff:
--- espanso-package/src/archive/default.rs
+++ delete ! in <impl Archiver for DefaultArchiver>::list
@@ -119,17 +119,17 @@
         Ok(StoredPackage::Modern(ArchivedPackage { manifest, source }))
     }
 
     fn list(&self) -> Result<Vec<StoredPackage>> {
         let mut output = Vec::new();
 
         for path in std::fs::read_dir(&self.package_dir)? {
             let path = path?.path();
-            if !path.is_dir() {
+            if  /* ~ changed by cargo-mutants ~ */path.is_dir() {
                 continue;
             }
 
             if let Some(package_name) = path.file_name() {
                 let package_name = package_name.to_string_lossy().to_string();
 
                 output.push(self.get(&package_name)?);
             }

---- archive::default::tests::test_list_packages stdout ----

thread 'archive::default::tests::test_list_packages' panicked at espanso-package/src/archive/default.rs:337:13:
assertion failed: package_list.iter().any(|package|
        *package ==
            StoredPackage::Modern(ArchivedPackage {
                    manifest: Manifest::parse(&package_out_dir.join("_manifest.yml")).unwrap(),
                    source: PackageSource::parse(&package_out_dir.join(PACKAGE_SOURCE_FILE)).unwrap(),
                }))

failures:
    archive::default::tests::test_list_packages

test result: FAILED. 10 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
