*** espanso-package/src/archive/default.rs:142:9: replace <impl Archiver for DefaultArchiver>::delete -> Result<()> with Ok(())

*** mutation diff:
--- espanso-package/src/archive/default.rs
+++ replace <impl Archiver for DefaultArchiver>::delete -> Result<()> with Ok(())
@@ -134,25 +134,17 @@
                 output.push(self.get(&package_name)?);
             }
         }
 
         Ok(output)
     }
 
     fn delete(&self, name: &str) -> Result<()> {
-        let target_dir = self.package_dir.join(name);
-
-        if !target_dir.is_dir() {
-            bail!("package {} not found", name);
-        }
-
-        std::fs::remove_dir_all(&target_dir).context("unable to remove package directory")?;
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use std::fs::{create_dir_all, write};
     use tempdir::TempDir;

---- archive::default::tests::test_delete_package stdout ----

thread 'archive::default::tests::test_delete_package' panicked at espanso-package/src/archive/default.rs:298:13:
assertion failed: !package_out_dir.is_dir()

failures:
    archive::default::tests::test_delete_package

test result: FAILED. 10 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
