*** espanso-package/src/archive/mod.rs:90:9: replace <impl std::fmt::Display for PackageSource>::fmt -> std::fmt::Result with Ok(Default::default())

*** mutation diff:
--- espanso-package/src/archive/mod.rs
+++ replace <impl std::fmt::Display for PackageSource>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -82,24 +82,17 @@
     pub fn parse(source_path: &Path) -> Result<Self> {
         let source_str = std::fs::read_to_string(source_path)?;
         Ok(serde_yaml::from_str(&source_str)?)
     }
 }
 
 impl std::fmt::Display for PackageSource {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        match self {
-            PackageSource::Hub => write!(f, "espanso-hub"),
-            PackageSource::Git {
-                repo_url,
-                repo_branch: _,
-                use_native_git: _,
-            } => write!(f, "git: {repo_url}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<&PackageSpecifier> for PackageSource {
     fn from(package: &PackageSpecifier) -> Self {
         if let Some(git_repo_url) = package.git_repo_url.as_deref() {
             Self::Git {
                 repo_url: git_repo_url.to_string(),

*** result: Success
