*** espanso-package/src/archive/read.rs:30:8: delete ! in read_archived_package

*** mutation diff:
--- espanso-package/src/archive/read.rs
+++ delete ! in read_archived_package
@@ -22,17 +22,17 @@
 use anyhow::{bail, Context, Result};
 
 use crate::{manifest::Manifest, ArchivedPackage};
 
 use super::{PackageSource, PACKAGE_SOURCE_FILE};
 
 pub fn read_archived_package(containing_dir: &Path) -> Result<ArchivedPackage> {
     let manifest_path = containing_dir.join("_manifest.yml");
-    if !manifest_path.is_file() {
+    if  /* ~ changed by cargo-mutants ~ */manifest_path.is_file() {
         bail!("missing _manifest.yml file");
     }
 
     let source_path = containing_dir.join(PACKAGE_SOURCE_FILE);
     let source = if source_path.is_file() {
         let yaml = std::fs::read_to_string(&source_path)?;
         let source: PackageSource =
             serde_yaml::from_str(&yaml).context("unable to parse package source file.")?;

---- archive::default::tests::test_delete_package stdout ----

thread 'archive::default::tests::test_delete_package' panicked at espanso-package/src/archive/default.rs:299:13:
assertion failed: result.is_ok()

---- archive::default::tests::test_package_saved_correctly stdout ----

thread 'archive::default::tests::test_package_saved_correctly' panicked at espanso-package/src/archive/default.rs:233:13:
assertion failed: result.is_ok()

---- archive::default::tests::test_package_already_present stdout ----

thread 'archive::default::tests::test_package_already_present' panicked at espanso-package/src/archive/default.rs:278:13:
assertion failed: result.is_ok()

failures:
    archive::default::tests::test_delete_package
    archive::default::tests::test_list_packages
    archive::default::tests::test_package_already_present
    archive::default::tests::test_package_saved_correctly

test result: FAILED. 7 passed; 4 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
