*** espanso-package/src/archive/util.rs:30:5: replace copy_dir_without_dot_files -> Result<()> with Ok(())

*** mutation diff:
--- espanso-package/src/archive/util.rs
+++ replace copy_dir_without_dot_files -> Result<()> with Ok(())
@@ -22,38 +22,17 @@
 use anyhow::Result;
 use fs_extra::dir::CopyOptions;
 
 use crate::PackageSpecifier;
 
 use super::{PackageSource, PACKAGE_SOURCE_FILE};
 
 pub fn copy_dir_without_dot_files(source_dir: &Path, inside_dir: &Path) -> Result<()> {
-    fs_extra::dir::copy(
-        source_dir,
-        inside_dir,
-        &CopyOptions {
-            copy_inside: true,
-            content_only: true,
-            ..Default::default()
-        },
-    )?;
-
-    // Remove dot files and dirs (such as .git)
-    let mut to_be_removed = Vec::new();
-    for path in std::fs::read_dir(inside_dir)? {
-        let path = path?.path();
-        if path.starts_with(".") {
-            to_be_removed.push(path);
-        }
-    }
-
-    fs_extra::remove_items(&to_be_removed)?;
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn create_package_source_file(specifier: &PackageSpecifier, target_dir: &Path) -> Result<()> {
     let source: PackageSource = specifier.into();
     let yaml = serde_yaml::to_string(&source)?;
     std::fs::write(target_dir.join(PACKAGE_SOURCE_FILE), yaml)?;
     Ok(())
 }

---- archive::default::tests::test_list_packages stdout ----

thread 'archive::default::tests::test_list_packages' panicked at espanso-package/src/archive/default.rs:327:13:
assertion failed: result.is_ok()

---- archive::default::tests::test_package_saved_correctly stdout ----

thread 'archive::default::tests::test_package_saved_correctly' panicked at espanso-package/src/archive/default.rs:233:13:
assertion failed: result.is_ok()

---- archive::default::tests::test_delete_package stdout ----

thread 'archive::default::tests::test_delete_package' panicked at espanso-package/src/archive/default.rs:299:13:
assertion failed: result.is_ok()

failures:
    archive::default::tests::test_delete_package
    archive::default::tests::test_list_packages
    archive::default::tests::test_package_already_present
    archive::default::tests::test_package_saved_correctly

test result: FAILED. 7 passed; 4 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
