*** espanso-package/src/archive/util.rs:55:5: replace create_package_source_file -> Result<()> with Ok(())

*** mutation diff:
--- espanso-package/src/archive/util.rs
+++ replace create_package_source_file -> Result<()> with Ok(())
@@ -47,13 +47,10 @@
     }
 
     fs_extra::remove_items(&to_be_removed)?;
 
     Ok(())
 }
 
 pub fn create_package_source_file(specifier: &PackageSpecifier, target_dir: &Path) -> Result<()> {
-    let source: PackageSource = specifier.into();
-    let yaml = serde_yaml::to_string(&source)?;
-    std::fs::write(target_dir.join(PACKAGE_SOURCE_FILE), yaml)?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

---- archive::default::tests::test_package_saved_correctly stdout ----

thread 'archive::default::tests::test_package_saved_correctly' panicked at espanso-package/src/archive/default.rs:240:13:
assertion failed: package_out_dir.join("_pkgsource.yml").is_file()

---- archive::default::tests::test_list_packages stdout ----

thread 'archive::default::tests::test_list_packages' panicked at espanso-package/src/archive/default.rs:335:48:
called `Result::unwrap()` on an `Err` value: unable to parse package source file

Caused by:
    No such file or directory (os error 2)

failures:
    archive::default::tests::test_list_packages
    archive::default::tests::test_package_saved_correctly

test result: FAILED. 9 passed; 2 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
