*** espanso-package/src/lib.rs:79:39: delete ! in get_provider

*** mutation diff:
--- espanso-package/src/lib.rs
+++ delete ! in get_provider
@@ -71,17 +71,17 @@
             } else {
                 false
             };
 
             // Git repository seems to be in one of the known hosts, but the direct methods
             // couldn't retrieve its content. This might happen with private repos (as they are not
             // available to non-authenticated requests), so we check if a "git ls-remote" command
             // is able to access it.
-            if matches_known_hosts && !util::git::is_private_repo(git_repo_url) {
+            if matches_known_hosts &&  /* ~ changed by cargo-mutants ~ */util::git::is_private_repo(git_repo_url) {
                 bail!("could not access repository: {}, make sure it exists and that you have the necessary access rights.", git_repo_url);
             }
         }
 
         // Git repository is neither on Github or Gitlab
         // OR it's a private repository, which means we can't use the direct method
         // (because it's not authenticated)
         Ok(Box::new(provider::git::GitPackageProvider::new()))

*** result: Success
