*** espanso-package/src/package/default.rs:48:9: replace <impl Package for DefaultPackage>::name -> &str with "xyzzy"

*** mutation diff:
--- espanso-package/src/package/default.rs
+++ replace <impl Package for DefaultPackage>::name -> &str with "xyzzy"
@@ -40,17 +40,17 @@
             temp_dir,
             location,
         }
     }
 }
 
 impl Package for DefaultPackage {
     fn name(&self) -> &str {
-        self.manifest.name.as_str()
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn title(&self) -> &str {
         self.manifest.title.as_str()
     }
 
     fn description(&self) -> &str {
         self.manifest.description.as_str()

---- archive::default::tests::test_package_already_present stdout ----

thread 'archive::default::tests::test_package_already_present' panicked at espanso-package/src/archive/default.rs:263:13:
assertion failed: result.is_err()

---- archive::default::tests::test_package_saved_correctly stdout ----

thread 'archive::default::tests::test_package_saved_correctly' panicked at espanso-package/src/archive/default.rs:236:13:
assertion failed: package_out_dir.is_dir()

---- archive::default::tests::test_list_packages stdout ----

thread 'archive::default::tests::test_list_packages' panicked at espanso-package/src/archive/default.rs:330:13:
assertion failed: package_out_dir.is_dir()

failures:
    archive::default::tests::test_delete_package
    archive::default::tests::test_list_packages
    archive::default::tests::test_package_already_present
    archive::default::tests::test_package_saved_correctly

test result: FAILED. 7 passed; 4 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
