*** espanso-package/src/package/default.rs:56:9: replace <impl Package for DefaultPackage>::description -> &str with ""

*** mutation diff:
--- espanso-package/src/package/default.rs
+++ replace <impl Package for DefaultPackage>::description -> &str with ""
@@ -48,17 +48,17 @@
         self.manifest.name.as_str()
     }
 
     fn title(&self) -> &str {
         self.manifest.title.as_str()
     }
 
     fn description(&self) -> &str {
-        self.manifest.description.as_str()
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn version(&self) -> &str {
         self.manifest.version.as_str()
     }
 
     fn author(&self) -> &str {
         self.manifest.author.as_str()

*** result: Success
