*** espanso-package/src/provider/git.rs:70:9: replace <impl PackageProvider for GitPackageProvider>::name -> String with String::new()

*** mutation diff:
--- espanso-package/src/provider/git.rs
+++ replace <impl PackageProvider for GitPackageProvider>::name -> String with String::new()
@@ -62,17 +62,17 @@
             bail!("git command exited with non-zero status: {}", stderr);
         }
         Ok(())
     }
 }
 
 impl PackageProvider for GitPackageProvider {
     fn name(&self) -> String {
-        "git".to_string()
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     fn download(&self, package: &PackageSpecifier) -> Result<Box<dyn Package>> {
         if !Self::is_git_installed() {
             bail!("unable to invoke 'git' command, please make sure it is installed and visible in PATH");
         }
 
         let repo_url = package

*** result: Success
