*** espanso-package/src/provider/git.rs:74:12: delete ! in <impl PackageProvider for GitPackageProvider>::download

*** mutation diff:
--- espanso-package/src/provider/git.rs
+++ delete ! in <impl PackageProvider for GitPackageProvider>::download
@@ -66,17 +66,17 @@
 }
 
 impl PackageProvider for GitPackageProvider {
     fn name(&self) -> String {
         "git".to_string()
     }
 
     fn download(&self, package: &PackageSpecifier) -> Result<Box<dyn Package>> {
-        if !Self::is_git_installed() {
+        if  /* ~ changed by cargo-mutants ~ */Self::is_git_installed() {
             bail!("unable to invoke 'git' command, please make sure it is installed and visible in PATH");
         }
 
         let repo_url = package
             .git_repo_url
             .as_deref()
             .ok_or_else(|| anyhow!("missing git repository url"))?;
         let repo_branch = package.git_branch.as_deref();

*** result: Success
