*** espanso-package/src/provider/hub.rs:102:16: delete ! in EspansoHubPackageProvider::get_index

*** mutation diff:
--- espanso-package/src/provider/hub.rs
+++ delete ! in EspansoHubPackageProvider::get_index
@@ -94,17 +94,17 @@
     }
 }
 
 impl EspansoHubPackageProvider {
     fn get_index(&self, force_update: bool) -> Result<PackageIndex> {
         let old_index = self.get_index_from_cache()?;
 
         if let Some(old_index) = old_index {
-            if !force_update {
+            if  /* ~ changed by cargo-mutants ~ */force_update {
                 let current_time = std::time::SystemTime::now().duration_since(UNIX_EPOCH)?;
                 let current_unix = current_time.as_secs();
                 if old_index.cached_at >= (current_unix - PACKAGE_INDEX_CACHE_INVALIDATION_SECONDS)
                 {
                     info_println!("using cached package index");
                     return Ok(old_index.index);
                 }
             }

*** result: Success
