*** espanso-package/src/provider/hub.rs:105:40: replace >= with < in EspansoHubPackageProvider::get_index

*** mutation diff:
--- espanso-package/src/provider/hub.rs
+++ replace >= with < in EspansoHubPackageProvider::get_index
@@ -97,17 +97,17 @@
 impl EspansoHubPackageProvider {
     fn get_index(&self, force_update: bool) -> Result<PackageIndex> {
         let old_index = self.get_index_from_cache()?;
 
         if let Some(old_index) = old_index {
             if !force_update {
                 let current_time = std::time::SystemTime::now().duration_since(UNIX_EPOCH)?;
                 let current_unix = current_time.as_secs();
-                if old_index.cached_at >= (current_unix - PACKAGE_INDEX_CACHE_INVALIDATION_SECONDS)
+                if old_index.cached_at < /* ~ changed by cargo-mutants ~ */ (current_unix - PACKAGE_INDEX_CACHE_INVALIDATION_SECONDS)
                 {
                     info_println!("using cached package index");
                     return Ok(old_index.index);
                 }
             }
         }
 
         let new_index = EspansoHubPackageProvider::download_index()?;

*** result: Success
