*** espanso-package/src/provider/hub.rs:140:9: replace EspansoHubPackageProvider::save_index_to_cache -> Result<()> with Ok(())

*** mutation diff:
--- espanso-package/src/provider/hub.rs
+++ replace EspansoHubPackageProvider::save_index_to_cache -> Result<()> with Ok(())
@@ -132,26 +132,17 @@
 
         let content =
             std::fs::read_to_string(&target_file).context("unable to read package index cache")?;
         let index: CachedPackageIndex = serde_json::from_str(&content)?;
         Ok(Some(index))
     }
 
     fn save_index_to_cache(&self, index: PackageIndex) -> Result<()> {
-        let target_file = self.runtime_dir.join(PACKAGE_INDEX_CACHE_FILE);
-        let current_time = std::time::SystemTime::now().duration_since(UNIX_EPOCH)?;
-        let current_unix = current_time.as_secs();
-        let cached_index = CachedPackageIndex {
-            cached_at: current_unix,
-            index,
-        };
-        let serialized = serde_json::to_string(&cached_index)?;
-        std::fs::write(target_file, serialized)?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Serialize, Deserialize)]
 struct CachedPackageIndex {
     cached_at: u64,
     index: PackageIndex,
 }

*** result: Success
