*** espanso-package/src/resolver.rs:41:49: replace == with != in resolve_package

*** mutation diff:
--- espanso-package/src/resolver.rs
+++ replace == with != in resolve_package
@@ -33,17 +33,17 @@
     base_dir: &Path,
     name: &str,
     version: Option<&str>,
 ) -> Result<ResolvedPackage> {
     let packages = resolve_all_packages(base_dir)?;
 
     let mut matching_packages: Vec<ResolvedPackage> = packages
         .into_iter()
-        .filter(|package| package.manifest.name == name)
+        .filter(|package| package.manifest.name != /* ~ changed by cargo-mutants ~ */ name)
         .collect();
 
     if matching_packages.is_empty() {
         bail!("no package found with name: {}", name);
     }
 
     matching_packages.sort_by(|a, b| natord::compare(&a.manifest.version, &b.manifest.version));

---- resolver::tests::test_resolve_package stdout ----

thread 'resolver::tests::test_resolve_package' panicked at espanso-package/src/resolver.rs:284:13:
assertion `left == right` failed
  left: ResolvedPackage { manifest: Manifest { name: "package2", title: "Package 2", description: "Another awesome package", version: "2.0.0", author: "Federico" }, base_dir: "/var/folders/6f/_7411vhs4c58v7633qtsvlwc0000gn/T/espanso-package.a3RWFlwaM0YS/package2" }
 right: ResolvedPackage { manifest: Manifest { name: "package1", title: "Package 1", description: "An awesome package", version: "0.1.1", author: "Federico" }, base_dir: "/var/folders/6f/_7411vhs4c58v7633qtsvlwc0000gn/T/espanso-package.a3RWFlwaM0YS/package1/0.1.1" }

failures:
    resolver::tests::test_resolve_package

test result: FAILED. 10 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
