*** espanso-package/src/resolver.rs:53:54: replace == with != in resolve_package

*** mutation diff:
--- espanso-package/src/resolver.rs
+++ replace == with != in resolve_package
@@ -45,17 +45,17 @@
         bail!("no package found with name: {}", name);
     }
 
     matching_packages.sort_by(|a, b| natord::compare(&a.manifest.version, &b.manifest.version));
 
     let matching_package = if let Some(explicit_version) = version {
         matching_packages
             .into_iter()
-            .find(|package| package.manifest.version == explicit_version)
+            .find(|package| package.manifest.version != /* ~ changed by cargo-mutants ~ */ explicit_version)
     } else {
         matching_packages.into_iter().next_back()
     };
 
     if let Some(matching_package) = matching_package {
         Ok(matching_package)
     } else {
         bail!(

---- resolver::tests::test_resolve_package stdout ----

thread 'resolver::tests::test_resolve_package' panicked at espanso-package/src/resolver.rs:298:13:
assertion `left == right` failed
  left: ResolvedPackage { manifest: Manifest { name: "package1", title: "Package 1", description: "An awesome package", version: "0.1.1", author: "Federico" }, base_dir: "/var/folders/6f/_7411vhs4c58v7633qtsvlwc0000gn/T/espanso-package.8f0i2lNvjYjl/package1/0.1.1" }
 right: ResolvedPackage { manifest: Manifest { name: "package1", title: "Package 1", description: "An awesome package", version: "0.1.0", author: "Federico" }, base_dir: "/var/folders/6f/_7411vhs4c58v7633qtsvlwc0000gn/T/espanso-package.8f0i2lNvjYjl/package1/0.1.0" }

failures:
    resolver::tests::test_resolve_package

test result: FAILED. 10 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
