*** espanso-package/src/resolver.rs:70:5: replace resolve_all_packages -> Result<Vec<ResolvedPackage>> with Ok(vec![])

*** mutation diff:
--- espanso-package/src/resolver.rs
+++ replace resolve_all_packages -> Result<Vec<ResolvedPackage>> with Ok(vec![])
@@ -62,34 +62,17 @@
             "unable to find version: {} for package: {}",
             version.unwrap_or_default(),
             name
         );
     }
 }
 
 pub fn resolve_all_packages(base_dir: &Path) -> Result<Vec<ResolvedPackage>> {
-    let manifest_files = find_all_manifests(base_dir)?;
-
-    if manifest_files.is_empty() {
-        bail!("no manifests found in base_dir");
-    }
-
-    let mut manifests = Vec::new();
-
-    for manifest_file in manifest_files {
-        let base_dir = manifest_file
-            .parent()
-            .ok_or_else(|| anyhow!("unable to determine base_dir from manifest path"))?
-            .to_owned();
-        let manifest = Manifest::parse(&manifest_file).context("manifest YAML parsing error")?;
-        manifests.push(ResolvedPackage { manifest, base_dir });
-    }
-
-    Ok(manifests)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn find_all_manifests(base_dir: &Path) -> Result<Vec<PathBuf>> {
     let pattern = format!("{}/{}", base_dir.to_string_lossy(), "**/_manifest.yml");
 
     let mut manifests = Vec::new();
 
     for entry in glob::glob(&pattern)? {

---- resolver::tests::test_no_manifest_error stdout ----

thread 'resolver::tests::test_no_manifest_error' panicked at espanso-package/src/resolver.rs:317:13:
assertion failed: resolve_all_packages(base_dir).is_err()

---- resolver::tests::test_malformed_manifest stdout ----

thread 'resolver::tests::test_malformed_manifest' panicked at espanso-package/src/resolver.rs:334:13:
assertion failed: resolve_all_packages(base_dir).is_err()

---- resolver::tests::test_read_manifest_base_dir stdout ----

thread 'resolver::tests::test_read_manifest_base_dir' panicked at espanso-package/src/resolver.rs:111:13:
assertion `left == right` failed
  left: []
 right: [ResolvedPackage { manifest: Manifest { name: "package1", title: "Package 1", description: "An awesome package", version: "0.1.0", author: "Federico" }, base_dir: "/var/folders/6f/_7411vhs4c58v7633qtsvlwc0000gn/T/espanso-package.QhydwSmeQoVf" }]

failures:
    resolver::tests::test_malformed_manifest
    resolver::tests::test_no_manifest_error
    resolver::tests::test_read_manifest_base_dir
    resolver::tests::test_read_manifests_nested_dirs
    resolver::tests::test_resolve_package

test result: FAILED. 6 passed; 5 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
