*** espanso-package/src/resolver.rs:91:5: replace find_all_manifests -> Result<Vec<PathBuf>> with Ok(vec![Default::default()])

*** mutation diff:
--- espanso-package/src/resolver.rs
+++ replace find_all_manifests -> Result<Vec<PathBuf>> with Ok(vec![Default::default()])
@@ -83,26 +83,17 @@
         let manifest = Manifest::parse(&manifest_file).context("manifest YAML parsing error")?;
         manifests.push(ResolvedPackage { manifest, base_dir });
     }
 
     Ok(manifests)
 }
 
 fn find_all_manifests(base_dir: &Path) -> Result<Vec<PathBuf>> {
-    let pattern = format!("{}/{}", base_dir.to_string_lossy(), "**/_manifest.yml");
-
-    let mut manifests = Vec::new();
-
-    for entry in glob::glob(&pattern)? {
-        let path = entry?;
-        manifests.push(path);
-    }
-
-    Ok(manifests)
+    Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use std::fs::create_dir_all;
 
     use crate::tests::run_with_temp_dir;

---- resolver::tests::test_read_manifest_base_dir stdout ----

thread 'resolver::tests::test_read_manifest_base_dir' panicked at espanso-package/src/resolver.rs:117:59:
called `Result::unwrap()` on an `Err` value: unable to determine base_dir from manifest path

---- resolver::tests::test_resolve_package stdout ----

thread 'resolver::tests::test_resolve_package' panicked at espanso-package/src/resolver.rs:276:61:
called `Result::unwrap()` on an `Err` value: unable to determine base_dir from manifest path

---- resolver::tests::test_read_manifests_nested_dirs stdout ----

thread 'resolver::tests::test_read_manifests_nested_dirs' panicked at espanso-package/src/resolver.rs:185:59:
called `Result::unwrap()` on an `Err` value: unable to determine base_dir from manifest path

failures:
    resolver::tests::test_read_manifest_base_dir
    resolver::tests::test_read_manifests_nested_dirs
    resolver::tests::test_resolve_package

test result: FAILED. 8 passed; 3 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
