*** espanso-package/src/util/download.rs:37:12: delete ! in download_and_extract_zip_verify_sha256

*** mutation diff:
--- espanso-package/src/util/download.rs
+++ delete ! in download_and_extract_zip_verify_sha256
@@ -29,17 +29,17 @@
 pub fn download_and_extract_zip_verify_sha256(
     url: &str,
     dest_dir: &Path,
     sha256: Option<&str>,
 ) -> Result<()> {
     let data = download(url).context("error downloading archive")?;
     if let Some(sha256) = sha256 {
         info_println!("validating sha256 signature...");
-        if !verify_sha256(&data, sha256) {
+        if  /* ~ changed by cargo-mutants ~ */verify_sha256(&data, sha256) {
             bail!("signature mismatch");
         }
     }
     extract_zip(data, dest_dir).context("error extracting archive")
 }
 
 pub fn read_string_from_url(url: &str) -> Result<String> {
     let client = reqwest::blocking::Client::builder();

*** result: Success
