*** espanso-package/src/util/download.rs:69:10: replace == with != in verify_sha256

*** mutation diff:
--- espanso-package/src/util/download.rs
+++ replace == with != in verify_sha256
@@ -61,17 +61,17 @@
     Ok(buffer)
 }
 
 fn verify_sha256(data: &[u8], sha256: &str) -> bool {
     let mut hasher = Sha256::new();
     hasher.update(data);
     let result = hasher.finalize();
     let hash = hex::encode(result);
-    hash == sha256
+    hash != /* ~ changed by cargo-mutants ~ */ sha256
 }
 
 // Adapted from zip-rs extract.rs example
 fn extract_zip(data: Vec<u8>, dest_dir: &Path) -> Result<()> {
     let reader = Cursor::new(data);
 
     let mut archive = zip::ZipArchive::new(reader)?;

*** result: Success
