*** espanso-package/src/util/download.rs:74:5: replace extract_zip -> Result<()> with Ok(())

*** mutation diff:
--- espanso-package/src/util/download.rs
+++ replace extract_zip -> Result<()> with Ok(())
@@ -66,34 +66,10 @@
     hasher.update(data);
     let result = hasher.finalize();
     let hash = hex::encode(result);
     hash == sha256
 }
 
 // Adapted from zip-rs extract.rs example
 fn extract_zip(data: Vec<u8>, dest_dir: &Path) -> Result<()> {
-    let reader = Cursor::new(data);
-
-    let mut archive = zip::ZipArchive::new(reader)?;
-
-    for i in 0..archive.len() {
-        let mut file = archive.by_index(i)?;
-        let outpath = match file.enclosed_name() {
-            Some(path) => dest_dir.join(path),
-            None => continue,
-        };
-
-        if file.name().ends_with('/') {
-            std::fs::create_dir_all(&outpath)?;
-        } else {
-            if let Some(p) = outpath.parent() {
-                if !p.exists() {
-                    std::fs::create_dir_all(p)?;
-                }
-            }
-            let mut outfile = std::fs::File::create(&outpath)?;
-            copy(&mut file, &mut outfile)?;
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
