*** espanso-package/src/util/download.rs:89:20: delete ! in extract_zip

*** mutation diff:
--- espanso-package/src/util/download.rs
+++ delete ! in extract_zip
@@ -81,17 +81,17 @@
             Some(path) => dest_dir.join(path),
             None => continue,
         };
 
         if file.name().ends_with('/') {
             std::fs::create_dir_all(&outpath)?;
         } else {
             if let Some(p) = outpath.parent() {
-                if !p.exists() {
+                if  /* ~ changed by cargo-mutants ~ */p.exists() {
                     std::fs::create_dir_all(p)?;
                 }
             }
             let mut outfile = std::fs::File::create(&outpath)?;
             copy(&mut file, &mut outfile)?;
         }
     }

*** result: Success
