*** espanso-package/src/util/github.rs:37:5: replace extract_github_url_parts -> Option<GitHubParts> with None

*** mutation diff:
--- espanso-package/src/util/github.rs
+++ replace extract_github_url_parts -> Option<GitHubParts> with None
@@ -29,24 +29,17 @@
 
 #[derive(Debug, PartialEq, Eq)]
 pub struct GitHubParts {
     author: String,
     name: String,
 }
 
 pub fn extract_github_url_parts(url: &str) -> Option<GitHubParts> {
-    let captures = GITHUB_REGEX.captures(url)?;
-    let author = captures.name("author")?;
-    let name = captures.name("name")?;
-
-    Some(GitHubParts {
-        author: author.as_str().to_string(),
-        name: name.as_str().to_string(),
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 pub struct ResolvedRepoScheme {
     pub author: String,
     pub name: String,
     pub branch: String,
 }

---- util::github::tests::test_extract_github_url_parts stdout ----

thread 'util::github::tests::test_extract_github_url_parts' panicked at espanso-package/src/util/github.rs:102:76:
called `Option::unwrap()` on a `None` value

failures:
    util::github::tests::test_extract_github_url_parts

test result: FAILED. 10 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
