*** espanso-package/src/util/github.rs:87:5: replace check_repo_with_branch -> Result<bool> with Ok(true)

*** mutation diff:
--- espanso-package/src/util/github.rs
+++ replace check_repo_with_branch -> Result<bool> with Ok(true)
@@ -79,22 +79,17 @@
             }));
         }
     }
 
     Ok(None)
 }
 
 pub fn check_repo_with_branch(parts: &GitHubParts, branch: &str) -> Result<bool> {
-    let client = reqwest::blocking::Client::new();
-
-    let url = generate_github_download_url(parts, branch);
-    let response = client.head(url).send()?;
-
-    Ok(response.status() == StatusCode::FOUND || response.status() == StatusCode::OK)
+    Ok(true) /* ~ changed by cargo-mutants ~ */
 }
 
 fn generate_github_download_url(parts: &GitHubParts, branch: &str) -> String {
     format!(
         "https://github.com/{}/{}/archive/refs/heads/{}.zip",
         parts.author, parts.name, branch
     )
 }

*** result: Success
