*** espanso-package/src/util/gitlab.rs:38:5: replace extract_gitlab_url_parts -> Option<GitLabParts> with None

*** mutation diff:
--- espanso-package/src/util/gitlab.rs
+++ replace extract_gitlab_url_parts -> Option<GitLabParts> with None
@@ -30,24 +30,17 @@
 
 #[derive(Debug, PartialEq, Eq)]
 pub struct GitLabParts {
     author: String,
     name: String,
 }
 
 pub fn extract_gitlab_url_parts(url: &str) -> Option<GitLabParts> {
-    let captures = GITLAB_REGEX.captures(url)?;
-    let author = captures.name("author")?;
-    let name = captures.name("name")?;
-
-    Some(GitLabParts {
-        author: author.as_str().to_string(),
-        name: name.as_str().to_string(),
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 pub struct ResolvedRepoScheme {
     pub author: String,
     pub name: String,
     pub branch: String,
 }

---- util::gitlab::tests::test_extract_gitlab_url_parts stdout ----

thread 'util::gitlab::tests::test_extract_gitlab_url_parts' panicked at espanso-package/src/util/gitlab.rs:104:18:
called `Option::unwrap()` on a `None` value

failures:
    util::gitlab::tests::test_extract_gitlab_url_parts

test result: FAILED. 10 passed; 1 failed; 1 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
