*** espanso-package/src/util/gitlab.rs:58:5: replace resolve_repo_scheme -> Result<Option<ResolvedRepoScheme>> with Ok(None)

*** mutation diff:
--- espanso-package/src/util/gitlab.rs
+++ replace resolve_repo_scheme -> Result<Option<ResolvedRepoScheme>> with Ok(None)
@@ -50,43 +50,17 @@
     pub name: String,
     pub branch: String,
 }
 
 pub fn resolve_repo_scheme(
     parts: GitLabParts,
     force_branch: Option<&str>,
 ) -> Result<Option<ResolvedRepoScheme>> {
-    if let Some(force_branch) = force_branch {
-        if check_repo_with_branch(&parts, force_branch)? {
-            return Ok(Some(ResolvedRepoScheme {
-                author: parts.author,
-                name: parts.name,
-                branch: force_branch.to_string(),
-            }));
-        }
-    } else {
-        if check_repo_with_branch(&parts, "main")? {
-            return Ok(Some(ResolvedRepoScheme {
-                author: parts.author,
-                name: parts.name,
-                branch: "main".to_string(),
-            }));
-        }
-
-        if check_repo_with_branch(&parts, "master")? {
-            return Ok(Some(ResolvedRepoScheme {
-                author: parts.author,
-                name: parts.name,
-                branch: "master".to_string(),
-            }));
-        }
-    }
-
-    Ok(None)
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn check_repo_with_branch(parts: &GitLabParts, branch: &str) -> Result<bool> {
     let client = reqwest::blocking::Client::new();
 
     let url = generate_gitlab_download_url(parts, branch);
     let response = client.head(url).send()?;

*** result: Success
