*** espanso-render/src/extension/clipboard.rs:40:9: replace <impl Extension for ClipboardExtension<'_>>::name -> &'static str with ""

*** mutation diff:
--- espanso-render/src/extension/clipboard.rs
+++ replace <impl Extension for ClipboardExtension<'_>>::name -> &'static str with ""
@@ -32,17 +32,17 @@
 impl<'a> ClipboardExtension<'a> {
     pub fn new(provider: &'a dyn ClipboardProvider) -> Self {
         Self { provider }
     }
 }
 
 impl Extension for ClipboardExtension<'_> {
     fn name(&self) -> &'static str {
-        "clipboard"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn calculate(
         &self,
         _: &crate::Context,
         _: &crate::Scope,
         _: &Params,
     ) -> crate::ExtensionResult {

*** result: Success
