*** espanso-render/src/extension/date.rs:107:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -99,17 +99,17 @@
     }
 }
 
 fn convert_locale_string_to_locale(locale_str: &str) -> Option<Locale> {
     match locale_str {
         "aa-DJ" => Some(Locale::aa_DJ),
         "aa-ER" => Some(Locale::aa_ER),
         "aa-ET" => Some(Locale::aa_ET),
-        "af-ZA" => Some(Locale::af_ZA),
+         /* ~ changed by cargo-mutants ~ */
         "agr-PE" => Some(Locale::agr_PE),
         "ak-GH" => Some(Locale::ak_GH),
         "am-ET" => Some(Locale::am_ET),
         "an-ES" => Some(Locale::an_ES),
         "anp-IN" => Some(Locale::anp_IN),
         "ar-AE" => Some(Locale::ar_AE),
         "ar-BH" => Some(Locale::ar_BH),
         "ar-DZ" => Some(Locale::ar_DZ),

*** result: Success
