*** espanso-render/src/extension/date.rs:113:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -105,17 +105,17 @@
         "aa-ER" => Some(Locale::aa_ER),
         "aa-ET" => Some(Locale::aa_ET),
         "af-ZA" => Some(Locale::af_ZA),
         "agr-PE" => Some(Locale::agr_PE),
         "ak-GH" => Some(Locale::ak_GH),
         "am-ET" => Some(Locale::am_ET),
         "an-ES" => Some(Locale::an_ES),
         "anp-IN" => Some(Locale::anp_IN),
-        "ar-AE" => Some(Locale::ar_AE),
+         /* ~ changed by cargo-mutants ~ */
         "ar-BH" => Some(Locale::ar_BH),
         "ar-DZ" => Some(Locale::ar_DZ),
         "ar-EG" => Some(Locale::ar_EG),
         "ar-IN" => Some(Locale::ar_IN),
         "ar-IQ" => Some(Locale::ar_IQ),
         "ar-JO" => Some(Locale::ar_JO),
         "ar-KW" => Some(Locale::ar_KW),
         "ar-LB" => Some(Locale::ar_LB),

*** result: Success
