*** espanso-render/src/extension/date.rs:126:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -118,17 +118,17 @@
         "ar-IQ" => Some(Locale::ar_IQ),
         "ar-JO" => Some(Locale::ar_JO),
         "ar-KW" => Some(Locale::ar_KW),
         "ar-LB" => Some(Locale::ar_LB),
         "ar-LY" => Some(Locale::ar_LY),
         "ar-MA" => Some(Locale::ar_MA),
         "ar-OM" => Some(Locale::ar_OM),
         "ar-QA" => Some(Locale::ar_QA),
-        "ar-SA" => Some(Locale::ar_SA),
+         /* ~ changed by cargo-mutants ~ */
         "ar-SD" => Some(Locale::ar_SD),
         "ar-SS" => Some(Locale::ar_SS),
         "ar-SY" => Some(Locale::ar_SY),
         "ar-TN" => Some(Locale::ar_TN),
         "ar-YE" => Some(Locale::ar_YE),
         "as-IN" => Some(Locale::as_IN),
         "ast-ES" => Some(Locale::ast_ES),
         "ayc-PE" => Some(Locale::ayc_PE),

*** result: Success
