*** espanso-render/src/extension/date.rs:128:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -120,17 +120,17 @@
         "ar-KW" => Some(Locale::ar_KW),
         "ar-LB" => Some(Locale::ar_LB),
         "ar-LY" => Some(Locale::ar_LY),
         "ar-MA" => Some(Locale::ar_MA),
         "ar-OM" => Some(Locale::ar_OM),
         "ar-QA" => Some(Locale::ar_QA),
         "ar-SA" => Some(Locale::ar_SA),
         "ar-SD" => Some(Locale::ar_SD),
-        "ar-SS" => Some(Locale::ar_SS),
+         /* ~ changed by cargo-mutants ~ */
         "ar-SY" => Some(Locale::ar_SY),
         "ar-TN" => Some(Locale::ar_TN),
         "ar-YE" => Some(Locale::ar_YE),
         "as-IN" => Some(Locale::as_IN),
         "ast-ES" => Some(Locale::ast_ES),
         "ayc-PE" => Some(Locale::ayc_PE),
         "az-AZ" => Some(Locale::az_AZ),
         "az-IR" => Some(Locale::az_IR),

*** result: Success
