*** espanso-render/src/extension/date.rs:132:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -124,17 +124,17 @@
         "ar-OM" => Some(Locale::ar_OM),
         "ar-QA" => Some(Locale::ar_QA),
         "ar-SA" => Some(Locale::ar_SA),
         "ar-SD" => Some(Locale::ar_SD),
         "ar-SS" => Some(Locale::ar_SS),
         "ar-SY" => Some(Locale::ar_SY),
         "ar-TN" => Some(Locale::ar_TN),
         "ar-YE" => Some(Locale::ar_YE),
-        "as-IN" => Some(Locale::as_IN),
+         /* ~ changed by cargo-mutants ~ */
         "ast-ES" => Some(Locale::ast_ES),
         "ayc-PE" => Some(Locale::ayc_PE),
         "az-AZ" => Some(Locale::az_AZ),
         "az-IR" => Some(Locale::az_IR),
         "be-BY" => Some(Locale::be_BY),
         "bem-ZM" => Some(Locale::bem_ZM),
         "ber-DZ" => Some(Locale::ber_DZ),
         "ber-MA" => Some(Locale::ber_MA),

*** result: Success
