*** espanso-render/src/extension/date.rs:137:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -129,17 +129,17 @@
         "ar-SY" => Some(Locale::ar_SY),
         "ar-TN" => Some(Locale::ar_TN),
         "ar-YE" => Some(Locale::ar_YE),
         "as-IN" => Some(Locale::as_IN),
         "ast-ES" => Some(Locale::ast_ES),
         "ayc-PE" => Some(Locale::ayc_PE),
         "az-AZ" => Some(Locale::az_AZ),
         "az-IR" => Some(Locale::az_IR),
-        "be-BY" => Some(Locale::be_BY),
+         /* ~ changed by cargo-mutants ~ */
         "bem-ZM" => Some(Locale::bem_ZM),
         "ber-DZ" => Some(Locale::ber_DZ),
         "ber-MA" => Some(Locale::ber_MA),
         "bg-BG" => Some(Locale::bg_BG),
         "bhb-IN" => Some(Locale::bhb_IN),
         "bho-IN" => Some(Locale::bho_IN),
         "bho-NP" => Some(Locale::bho_NP),
         "bi-VU" => Some(Locale::bi_VU),

*** result: Success
