*** espanso-render/src/extension/date.rs:147:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -139,17 +139,17 @@
         "ber-DZ" => Some(Locale::ber_DZ),
         "ber-MA" => Some(Locale::ber_MA),
         "bg-BG" => Some(Locale::bg_BG),
         "bhb-IN" => Some(Locale::bhb_IN),
         "bho-IN" => Some(Locale::bho_IN),
         "bho-NP" => Some(Locale::bho_NP),
         "bi-VU" => Some(Locale::bi_VU),
         "bn-BD" => Some(Locale::bn_BD),
-        "bn-IN" => Some(Locale::bn_IN),
+         /* ~ changed by cargo-mutants ~ */
         "bo-CN" => Some(Locale::bo_CN),
         "bo-IN" => Some(Locale::bo_IN),
         "br-FR" => Some(Locale::br_FR),
         "brx-IN" => Some(Locale::brx_IN),
         "bs-BA" => Some(Locale::bs_BA),
         "byn-ER" => Some(Locale::byn_ER),
         "ca-AD" => Some(Locale::ca_AD),
         "ca-ES" => Some(Locale::ca_ES),

*** result: Success
