*** espanso-render/src/extension/date.rs:149:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -141,17 +141,17 @@
         "bg-BG" => Some(Locale::bg_BG),
         "bhb-IN" => Some(Locale::bhb_IN),
         "bho-IN" => Some(Locale::bho_IN),
         "bho-NP" => Some(Locale::bho_NP),
         "bi-VU" => Some(Locale::bi_VU),
         "bn-BD" => Some(Locale::bn_BD),
         "bn-IN" => Some(Locale::bn_IN),
         "bo-CN" => Some(Locale::bo_CN),
-        "bo-IN" => Some(Locale::bo_IN),
+         /* ~ changed by cargo-mutants ~ */
         "br-FR" => Some(Locale::br_FR),
         "brx-IN" => Some(Locale::brx_IN),
         "bs-BA" => Some(Locale::bs_BA),
         "byn-ER" => Some(Locale::byn_ER),
         "ca-AD" => Some(Locale::ca_AD),
         "ca-ES" => Some(Locale::ca_ES),
         "ca-FR" => Some(Locale::ca_FR),
         "ca-IT" => Some(Locale::ca_IT),

*** result: Success
