*** espanso-render/src/extension/date.rs:154:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -146,17 +146,17 @@
         "bn-BD" => Some(Locale::bn_BD),
         "bn-IN" => Some(Locale::bn_IN),
         "bo-CN" => Some(Locale::bo_CN),
         "bo-IN" => Some(Locale::bo_IN),
         "br-FR" => Some(Locale::br_FR),
         "brx-IN" => Some(Locale::brx_IN),
         "bs-BA" => Some(Locale::bs_BA),
         "byn-ER" => Some(Locale::byn_ER),
-        "ca-AD" => Some(Locale::ca_AD),
+         /* ~ changed by cargo-mutants ~ */
         "ca-ES" => Some(Locale::ca_ES),
         "ca-FR" => Some(Locale::ca_FR),
         "ca-IT" => Some(Locale::ca_IT),
         "ce-RU" => Some(Locale::ce_RU),
         "chr-US" => Some(Locale::chr_US),
         "cmn-TW" => Some(Locale::cmn_TW),
         "crh-UA" => Some(Locale::crh_UA),
         "cs-CZ" => Some(Locale::cs_CZ),

*** result: Success
