*** espanso-render/src/extension/date.rs:158:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -150,17 +150,17 @@
         "br-FR" => Some(Locale::br_FR),
         "brx-IN" => Some(Locale::brx_IN),
         "bs-BA" => Some(Locale::bs_BA),
         "byn-ER" => Some(Locale::byn_ER),
         "ca-AD" => Some(Locale::ca_AD),
         "ca-ES" => Some(Locale::ca_ES),
         "ca-FR" => Some(Locale::ca_FR),
         "ca-IT" => Some(Locale::ca_IT),
-        "ce-RU" => Some(Locale::ce_RU),
+         /* ~ changed by cargo-mutants ~ */
         "chr-US" => Some(Locale::chr_US),
         "cmn-TW" => Some(Locale::cmn_TW),
         "crh-UA" => Some(Locale::crh_UA),
         "cs-CZ" => Some(Locale::cs_CZ),
         "csb-PL" => Some(Locale::csb_PL),
         "cv-RU" => Some(Locale::cv_RU),
         "cy-GB" => Some(Locale::cy_GB),
         "da-DK" => Some(Locale::da_DK),

*** result: Success
