*** espanso-render/src/extension/date.rs:163:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -155,17 +155,17 @@
         "ca-ES" => Some(Locale::ca_ES),
         "ca-FR" => Some(Locale::ca_FR),
         "ca-IT" => Some(Locale::ca_IT),
         "ce-RU" => Some(Locale::ce_RU),
         "chr-US" => Some(Locale::chr_US),
         "cmn-TW" => Some(Locale::cmn_TW),
         "crh-UA" => Some(Locale::crh_UA),
         "cs-CZ" => Some(Locale::cs_CZ),
-        "csb-PL" => Some(Locale::csb_PL),
+         /* ~ changed by cargo-mutants ~ */
         "cv-RU" => Some(Locale::cv_RU),
         "cy-GB" => Some(Locale::cy_GB),
         "da-DK" => Some(Locale::da_DK),
         "de-AT" => Some(Locale::de_AT),
         "de-BE" => Some(Locale::de_BE),
         "de-CH" => Some(Locale::de_CH),
         "de-DE" => Some(Locale::de_DE),
         "de-IT" => Some(Locale::de_IT),

*** result: Success
