*** espanso-render/src/extension/date.rs:169:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -161,17 +161,17 @@
         "crh-UA" => Some(Locale::crh_UA),
         "cs-CZ" => Some(Locale::cs_CZ),
         "csb-PL" => Some(Locale::csb_PL),
         "cv-RU" => Some(Locale::cv_RU),
         "cy-GB" => Some(Locale::cy_GB),
         "da-DK" => Some(Locale::da_DK),
         "de-AT" => Some(Locale::de_AT),
         "de-BE" => Some(Locale::de_BE),
-        "de-CH" => Some(Locale::de_CH),
+         /* ~ changed by cargo-mutants ~ */
         "de-DE" => Some(Locale::de_DE),
         "de-IT" => Some(Locale::de_IT),
         "de-LI" => Some(Locale::de_LI),
         "de-LU" => Some(Locale::de_LU),
         "doi-IN" => Some(Locale::doi_IN),
         "dsb-DE" => Some(Locale::dsb_DE),
         "dv-MV" => Some(Locale::dv_MV),
         "dz-BT" => Some(Locale::dz_BT),

*** result: Success
