*** espanso-render/src/extension/date.rs:173:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -165,17 +165,17 @@
         "cy-GB" => Some(Locale::cy_GB),
         "da-DK" => Some(Locale::da_DK),
         "de-AT" => Some(Locale::de_AT),
         "de-BE" => Some(Locale::de_BE),
         "de-CH" => Some(Locale::de_CH),
         "de-DE" => Some(Locale::de_DE),
         "de-IT" => Some(Locale::de_IT),
         "de-LI" => Some(Locale::de_LI),
-        "de-LU" => Some(Locale::de_LU),
+         /* ~ changed by cargo-mutants ~ */
         "doi-IN" => Some(Locale::doi_IN),
         "dsb-DE" => Some(Locale::dsb_DE),
         "dv-MV" => Some(Locale::dv_MV),
         "dz-BT" => Some(Locale::dz_BT),
         "el-CY" => Some(Locale::el_CY),
         "el-GR" => Some(Locale::el_GR),
         "en-AG" => Some(Locale::en_AG),
         "en-AU" => Some(Locale::en_AU),

*** result: Success
