*** espanso-render/src/extension/date.rs:178:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -170,17 +170,17 @@
         "de-DE" => Some(Locale::de_DE),
         "de-IT" => Some(Locale::de_IT),
         "de-LI" => Some(Locale::de_LI),
         "de-LU" => Some(Locale::de_LU),
         "doi-IN" => Some(Locale::doi_IN),
         "dsb-DE" => Some(Locale::dsb_DE),
         "dv-MV" => Some(Locale::dv_MV),
         "dz-BT" => Some(Locale::dz_BT),
-        "el-CY" => Some(Locale::el_CY),
+         /* ~ changed by cargo-mutants ~ */
         "el-GR" => Some(Locale::el_GR),
         "en-AG" => Some(Locale::en_AG),
         "en-AU" => Some(Locale::en_AU),
         "en-BW" => Some(Locale::en_BW),
         "en-CA" => Some(Locale::en_CA),
         "en-DK" => Some(Locale::en_DK),
         "en-GB" => Some(Locale::en_GB),
         "en-HK" => Some(Locale::en_HK),

*** result: Success
