*** espanso-render/src/extension/date.rs:185:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -177,17 +177,17 @@
         "dz-BT" => Some(Locale::dz_BT),
         "el-CY" => Some(Locale::el_CY),
         "el-GR" => Some(Locale::el_GR),
         "en-AG" => Some(Locale::en_AG),
         "en-AU" => Some(Locale::en_AU),
         "en-BW" => Some(Locale::en_BW),
         "en-CA" => Some(Locale::en_CA),
         "en-DK" => Some(Locale::en_DK),
-        "en-GB" => Some(Locale::en_GB),
+         /* ~ changed by cargo-mutants ~ */
         "en-HK" => Some(Locale::en_HK),
         "en-IE" => Some(Locale::en_IE),
         "en-IL" => Some(Locale::en_IL),
         "en-IN" => Some(Locale::en_IN),
         "en-NG" => Some(Locale::en_NG),
         "en-NZ" => Some(Locale::en_NZ),
         "en-PH" => Some(Locale::en_PH),
         "en-SC" => Some(Locale::en_SC),

*** result: Success
