*** espanso-render/src/extension/date.rs:188:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -180,17 +180,17 @@
         "en-AG" => Some(Locale::en_AG),
         "en-AU" => Some(Locale::en_AU),
         "en-BW" => Some(Locale::en_BW),
         "en-CA" => Some(Locale::en_CA),
         "en-DK" => Some(Locale::en_DK),
         "en-GB" => Some(Locale::en_GB),
         "en-HK" => Some(Locale::en_HK),
         "en-IE" => Some(Locale::en_IE),
-        "en-IL" => Some(Locale::en_IL),
+         /* ~ changed by cargo-mutants ~ */
         "en-IN" => Some(Locale::en_IN),
         "en-NG" => Some(Locale::en_NG),
         "en-NZ" => Some(Locale::en_NZ),
         "en-PH" => Some(Locale::en_PH),
         "en-SC" => Some(Locale::en_SC),
         "en-SG" => Some(Locale::en_SG),
         "en-US" => Some(Locale::en_US),
         "en-ZA" => Some(Locale::en_ZA),

*** result: Success
