*** espanso-render/src/extension/date.rs:195:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -187,17 +187,17 @@
         "en-IE" => Some(Locale::en_IE),
         "en-IL" => Some(Locale::en_IL),
         "en-IN" => Some(Locale::en_IN),
         "en-NG" => Some(Locale::en_NG),
         "en-NZ" => Some(Locale::en_NZ),
         "en-PH" => Some(Locale::en_PH),
         "en-SC" => Some(Locale::en_SC),
         "en-SG" => Some(Locale::en_SG),
-        "en-US" => Some(Locale::en_US),
+         /* ~ changed by cargo-mutants ~ */
         "en-ZA" => Some(Locale::en_ZA),
         "en-ZM" => Some(Locale::en_ZM),
         "en-ZW" => Some(Locale::en_ZW),
         "eo" => Some(Locale::eo),
         "es-AR" => Some(Locale::es_AR),
         "es-BO" => Some(Locale::es_BO),
         "es-CL" => Some(Locale::es_CL),
         "es-CO" => Some(Locale::es_CO),

*** result: Success
