*** espanso-render/src/extension/date.rs:196:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -188,17 +188,17 @@
         "en-IL" => Some(Locale::en_IL),
         "en-IN" => Some(Locale::en_IN),
         "en-NG" => Some(Locale::en_NG),
         "en-NZ" => Some(Locale::en_NZ),
         "en-PH" => Some(Locale::en_PH),
         "en-SC" => Some(Locale::en_SC),
         "en-SG" => Some(Locale::en_SG),
         "en-US" => Some(Locale::en_US),
-        "en-ZA" => Some(Locale::en_ZA),
+         /* ~ changed by cargo-mutants ~ */
         "en-ZM" => Some(Locale::en_ZM),
         "en-ZW" => Some(Locale::en_ZW),
         "eo" => Some(Locale::eo),
         "es-AR" => Some(Locale::es_AR),
         "es-BO" => Some(Locale::es_BO),
         "es-CL" => Some(Locale::es_CL),
         "es-CO" => Some(Locale::es_CO),
         "es-CR" => Some(Locale::es_CR),

*** result: Success
