*** espanso-render/src/extension/date.rs:200:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -192,17 +192,17 @@
         "en-PH" => Some(Locale::en_PH),
         "en-SC" => Some(Locale::en_SC),
         "en-SG" => Some(Locale::en_SG),
         "en-US" => Some(Locale::en_US),
         "en-ZA" => Some(Locale::en_ZA),
         "en-ZM" => Some(Locale::en_ZM),
         "en-ZW" => Some(Locale::en_ZW),
         "eo" => Some(Locale::eo),
-        "es-AR" => Some(Locale::es_AR),
+         /* ~ changed by cargo-mutants ~ */
         "es-BO" => Some(Locale::es_BO),
         "es-CL" => Some(Locale::es_CL),
         "es-CO" => Some(Locale::es_CO),
         "es-CR" => Some(Locale::es_CR),
         "es-CU" => Some(Locale::es_CU),
         "es-DO" => Some(Locale::es_DO),
         "es-EC" => Some(Locale::es_EC),
         "es-ES" => Some(Locale::es_ES),

*** result: Success
