*** espanso-render/src/extension/date.rs:203:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -195,17 +195,17 @@
         "en-US" => Some(Locale::en_US),
         "en-ZA" => Some(Locale::en_ZA),
         "en-ZM" => Some(Locale::en_ZM),
         "en-ZW" => Some(Locale::en_ZW),
         "eo" => Some(Locale::eo),
         "es-AR" => Some(Locale::es_AR),
         "es-BO" => Some(Locale::es_BO),
         "es-CL" => Some(Locale::es_CL),
-        "es-CO" => Some(Locale::es_CO),
+         /* ~ changed by cargo-mutants ~ */
         "es-CR" => Some(Locale::es_CR),
         "es-CU" => Some(Locale::es_CU),
         "es-DO" => Some(Locale::es_DO),
         "es-EC" => Some(Locale::es_EC),
         "es-ES" => Some(Locale::es_ES),
         "es-GT" => Some(Locale::es_GT),
         "es-HN" => Some(Locale::es_HN),
         "es-MX" => Some(Locale::es_MX),

*** result: Success
