*** espanso-render/src/extension/date.rs:204:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -196,17 +196,17 @@
         "en-ZA" => Some(Locale::en_ZA),
         "en-ZM" => Some(Locale::en_ZM),
         "en-ZW" => Some(Locale::en_ZW),
         "eo" => Some(Locale::eo),
         "es-AR" => Some(Locale::es_AR),
         "es-BO" => Some(Locale::es_BO),
         "es-CL" => Some(Locale::es_CL),
         "es-CO" => Some(Locale::es_CO),
-        "es-CR" => Some(Locale::es_CR),
+         /* ~ changed by cargo-mutants ~ */
         "es-CU" => Some(Locale::es_CU),
         "es-DO" => Some(Locale::es_DO),
         "es-EC" => Some(Locale::es_EC),
         "es-ES" => Some(Locale::es_ES),
         "es-GT" => Some(Locale::es_GT),
         "es-HN" => Some(Locale::es_HN),
         "es-MX" => Some(Locale::es_MX),
         "es-NI" => Some(Locale::es_NI),

*** result: Success
