*** espanso-render/src/extension/date.rs:213:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -205,17 +205,17 @@
         "es-CU" => Some(Locale::es_CU),
         "es-DO" => Some(Locale::es_DO),
         "es-EC" => Some(Locale::es_EC),
         "es-ES" => Some(Locale::es_ES),
         "es-GT" => Some(Locale::es_GT),
         "es-HN" => Some(Locale::es_HN),
         "es-MX" => Some(Locale::es_MX),
         "es-NI" => Some(Locale::es_NI),
-        "es-PA" => Some(Locale::es_PA),
+         /* ~ changed by cargo-mutants ~ */
         "es-PE" => Some(Locale::es_PE),
         "es-PR" => Some(Locale::es_PR),
         "es-PY" => Some(Locale::es_PY),
         "es-SV" => Some(Locale::es_SV),
         "es-US" => Some(Locale::es_US),
         "es-UY" => Some(Locale::es_UY),
         "es-VE" => Some(Locale::es_VE),
         "et-EE" => Some(Locale::et_EE),

*** result: Success
