*** espanso-render/src/extension/date.rs:216:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -208,17 +208,17 @@
         "es-ES" => Some(Locale::es_ES),
         "es-GT" => Some(Locale::es_GT),
         "es-HN" => Some(Locale::es_HN),
         "es-MX" => Some(Locale::es_MX),
         "es-NI" => Some(Locale::es_NI),
         "es-PA" => Some(Locale::es_PA),
         "es-PE" => Some(Locale::es_PE),
         "es-PR" => Some(Locale::es_PR),
-        "es-PY" => Some(Locale::es_PY),
+         /* ~ changed by cargo-mutants ~ */
         "es-SV" => Some(Locale::es_SV),
         "es-US" => Some(Locale::es_US),
         "es-UY" => Some(Locale::es_UY),
         "es-VE" => Some(Locale::es_VE),
         "et-EE" => Some(Locale::et_EE),
         "eu-ES" => Some(Locale::eu_ES),
         "fa-IR" => Some(Locale::fa_IR),
         "ff-SN" => Some(Locale::ff_SN),

*** result: Success
