*** espanso-render/src/extension/date.rs:220:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -212,17 +212,17 @@
         "es-NI" => Some(Locale::es_NI),
         "es-PA" => Some(Locale::es_PA),
         "es-PE" => Some(Locale::es_PE),
         "es-PR" => Some(Locale::es_PR),
         "es-PY" => Some(Locale::es_PY),
         "es-SV" => Some(Locale::es_SV),
         "es-US" => Some(Locale::es_US),
         "es-UY" => Some(Locale::es_UY),
-        "es-VE" => Some(Locale::es_VE),
+         /* ~ changed by cargo-mutants ~ */
         "et-EE" => Some(Locale::et_EE),
         "eu-ES" => Some(Locale::eu_ES),
         "fa-IR" => Some(Locale::fa_IR),
         "ff-SN" => Some(Locale::ff_SN),
         "fi-FI" => Some(Locale::fi_FI),
         "fil-PH" => Some(Locale::fil_PH),
         "fo-FO" => Some(Locale::fo_FO),
         "fr-BE" => Some(Locale::fr_BE),

*** result: Success
