*** espanso-render/src/extension/date.rs:227:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -219,17 +219,17 @@
         "es-UY" => Some(Locale::es_UY),
         "es-VE" => Some(Locale::es_VE),
         "et-EE" => Some(Locale::et_EE),
         "eu-ES" => Some(Locale::eu_ES),
         "fa-IR" => Some(Locale::fa_IR),
         "ff-SN" => Some(Locale::ff_SN),
         "fi-FI" => Some(Locale::fi_FI),
         "fil-PH" => Some(Locale::fil_PH),
-        "fo-FO" => Some(Locale::fo_FO),
+         /* ~ changed by cargo-mutants ~ */
         "fr-BE" => Some(Locale::fr_BE),
         "fr-CA" => Some(Locale::fr_CA),
         "fr-CH" => Some(Locale::fr_CH),
         "fr-FR" => Some(Locale::fr_FR),
         "fr-LU" => Some(Locale::fr_LU),
         "fur-IT" => Some(Locale::fur_IT),
         "fy-DE" => Some(Locale::fy_DE),
         "fy-NL" => Some(Locale::fy_NL),

*** result: Success
