*** espanso-render/src/extension/date.rs:231:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -223,17 +223,17 @@
         "fa-IR" => Some(Locale::fa_IR),
         "ff-SN" => Some(Locale::ff_SN),
         "fi-FI" => Some(Locale::fi_FI),
         "fil-PH" => Some(Locale::fil_PH),
         "fo-FO" => Some(Locale::fo_FO),
         "fr-BE" => Some(Locale::fr_BE),
         "fr-CA" => Some(Locale::fr_CA),
         "fr-CH" => Some(Locale::fr_CH),
-        "fr-FR" => Some(Locale::fr_FR),
+         /* ~ changed by cargo-mutants ~ */
         "fr-LU" => Some(Locale::fr_LU),
         "fur-IT" => Some(Locale::fur_IT),
         "fy-DE" => Some(Locale::fy_DE),
         "fy-NL" => Some(Locale::fy_NL),
         "ga-IE" => Some(Locale::ga_IE),
         "gd-GB" => Some(Locale::gd_GB),
         "gez-ER" => Some(Locale::gez_ER),
         "gez-ET" => Some(Locale::gez_ET),

*** result: Success
