*** espanso-render/src/extension/date.rs:234:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -226,17 +226,17 @@
         "fil-PH" => Some(Locale::fil_PH),
         "fo-FO" => Some(Locale::fo_FO),
         "fr-BE" => Some(Locale::fr_BE),
         "fr-CA" => Some(Locale::fr_CA),
         "fr-CH" => Some(Locale::fr_CH),
         "fr-FR" => Some(Locale::fr_FR),
         "fr-LU" => Some(Locale::fr_LU),
         "fur-IT" => Some(Locale::fur_IT),
-        "fy-DE" => Some(Locale::fy_DE),
+         /* ~ changed by cargo-mutants ~ */
         "fy-NL" => Some(Locale::fy_NL),
         "ga-IE" => Some(Locale::ga_IE),
         "gd-GB" => Some(Locale::gd_GB),
         "gez-ER" => Some(Locale::gez_ER),
         "gez-ET" => Some(Locale::gez_ET),
         "gl-ES" => Some(Locale::gl_ES),
         "gu-IN" => Some(Locale::gu_IN),
         "gv-GB" => Some(Locale::gv_GB),

*** result: Success
