*** espanso-render/src/extension/date.rs:236:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -228,17 +228,17 @@
         "fr-BE" => Some(Locale::fr_BE),
         "fr-CA" => Some(Locale::fr_CA),
         "fr-CH" => Some(Locale::fr_CH),
         "fr-FR" => Some(Locale::fr_FR),
         "fr-LU" => Some(Locale::fr_LU),
         "fur-IT" => Some(Locale::fur_IT),
         "fy-DE" => Some(Locale::fy_DE),
         "fy-NL" => Some(Locale::fy_NL),
-        "ga-IE" => Some(Locale::ga_IE),
+         /* ~ changed by cargo-mutants ~ */
         "gd-GB" => Some(Locale::gd_GB),
         "gez-ER" => Some(Locale::gez_ER),
         "gez-ET" => Some(Locale::gez_ET),
         "gl-ES" => Some(Locale::gl_ES),
         "gu-IN" => Some(Locale::gu_IN),
         "gv-GB" => Some(Locale::gv_GB),
         "ha-NG" => Some(Locale::ha_NG),
         "hak-TW" => Some(Locale::hak_TW),

*** result: Success
