*** espanso-render/src/extension/date.rs:243:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -235,17 +235,17 @@
         "fy-NL" => Some(Locale::fy_NL),
         "ga-IE" => Some(Locale::ga_IE),
         "gd-GB" => Some(Locale::gd_GB),
         "gez-ER" => Some(Locale::gez_ER),
         "gez-ET" => Some(Locale::gez_ET),
         "gl-ES" => Some(Locale::gl_ES),
         "gu-IN" => Some(Locale::gu_IN),
         "gv-GB" => Some(Locale::gv_GB),
-        "ha-NG" => Some(Locale::ha_NG),
+         /* ~ changed by cargo-mutants ~ */
         "hak-TW" => Some(Locale::hak_TW),
         "he-IL" => Some(Locale::he_IL),
         "hi-IN" => Some(Locale::hi_IN),
         "hif-FJ" => Some(Locale::hif_FJ),
         "hne-IN" => Some(Locale::hne_IN),
         "hr-HR" => Some(Locale::hr_HR),
         "hsb-DE" => Some(Locale::hsb_DE),
         "ht-HT" => Some(Locale::ht_HT),

*** result: Success
