*** espanso-render/src/extension/date.rs:251:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -243,17 +243,17 @@
         "ha-NG" => Some(Locale::ha_NG),
         "hak-TW" => Some(Locale::hak_TW),
         "he-IL" => Some(Locale::he_IL),
         "hi-IN" => Some(Locale::hi_IN),
         "hif-FJ" => Some(Locale::hif_FJ),
         "hne-IN" => Some(Locale::hne_IN),
         "hr-HR" => Some(Locale::hr_HR),
         "hsb-DE" => Some(Locale::hsb_DE),
-        "ht-HT" => Some(Locale::ht_HT),
+         /* ~ changed by cargo-mutants ~ */
         "hu-HU" => Some(Locale::hu_HU),
         "hy-AM" => Some(Locale::hy_AM),
         "ia-FR" => Some(Locale::ia_FR),
         "id-ID" => Some(Locale::id_ID),
         "ig-NG" => Some(Locale::ig_NG),
         "ik-CA" => Some(Locale::ik_CA),
         "is-IS" => Some(Locale::is_IS),
         "it-CH" => Some(Locale::it_CH),

*** result: Success
