*** espanso-render/src/extension/date.rs:256:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -248,17 +248,17 @@
         "hne-IN" => Some(Locale::hne_IN),
         "hr-HR" => Some(Locale::hr_HR),
         "hsb-DE" => Some(Locale::hsb_DE),
         "ht-HT" => Some(Locale::ht_HT),
         "hu-HU" => Some(Locale::hu_HU),
         "hy-AM" => Some(Locale::hy_AM),
         "ia-FR" => Some(Locale::ia_FR),
         "id-ID" => Some(Locale::id_ID),
-        "ig-NG" => Some(Locale::ig_NG),
+         /* ~ changed by cargo-mutants ~ */
         "ik-CA" => Some(Locale::ik_CA),
         "is-IS" => Some(Locale::is_IS),
         "it-CH" => Some(Locale::it_CH),
         "it-IT" => Some(Locale::it_IT),
         "iu-CA" => Some(Locale::iu_CA),
         "ja-JP" => Some(Locale::ja_JP),
         "ka-GE" => Some(Locale::ka_GE),
         "kab-DZ" => Some(Locale::kab_DZ),

*** result: Success
