*** espanso-render/src/extension/date.rs:260:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -252,17 +252,17 @@
         "hu-HU" => Some(Locale::hu_HU),
         "hy-AM" => Some(Locale::hy_AM),
         "ia-FR" => Some(Locale::ia_FR),
         "id-ID" => Some(Locale::id_ID),
         "ig-NG" => Some(Locale::ig_NG),
         "ik-CA" => Some(Locale::ik_CA),
         "is-IS" => Some(Locale::is_IS),
         "it-CH" => Some(Locale::it_CH),
-        "it-IT" => Some(Locale::it_IT),
+         /* ~ changed by cargo-mutants ~ */
         "iu-CA" => Some(Locale::iu_CA),
         "ja-JP" => Some(Locale::ja_JP),
         "ka-GE" => Some(Locale::ka_GE),
         "kab-DZ" => Some(Locale::kab_DZ),
         "kk-KZ" => Some(Locale::kk_KZ),
         "kl-GL" => Some(Locale::kl_GL),
         "km-KH" => Some(Locale::km_KH),
         "kn-IN" => Some(Locale::kn_IN),

---- extension::date::tests::override_locale stdout ----

thread 'extension::date::tests::override_locale' panicked at espanso-render/src/extension/date.rs:537:9:
assertion `left == right` failed
  left: Single("Tuesday")
 right: Single("martedì")

---- extension::date::tests::default_locale_works_correctly stdout ----

thread 'extension::date::tests::default_locale_works_correctly' panicked at espanso-render/src/extension/date.rs:498:9:
assertion `left == right` failed
  left: Single("Tuesday")
 right: Single("martedì")

failures:
    extension::date::tests::default_locale_works_correctly
    extension::date::tests::override_locale

test result: FAILED. 51 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
