*** espanso-render/src/extension/date.rs:264:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -256,17 +256,17 @@
         "ig-NG" => Some(Locale::ig_NG),
         "ik-CA" => Some(Locale::ik_CA),
         "is-IS" => Some(Locale::is_IS),
         "it-CH" => Some(Locale::it_CH),
         "it-IT" => Some(Locale::it_IT),
         "iu-CA" => Some(Locale::iu_CA),
         "ja-JP" => Some(Locale::ja_JP),
         "ka-GE" => Some(Locale::ka_GE),
-        "kab-DZ" => Some(Locale::kab_DZ),
+         /* ~ changed by cargo-mutants ~ */
         "kk-KZ" => Some(Locale::kk_KZ),
         "kl-GL" => Some(Locale::kl_GL),
         "km-KH" => Some(Locale::km_KH),
         "kn-IN" => Some(Locale::kn_IN),
         "ko-KR" => Some(Locale::ko_KR),
         "kok-IN" => Some(Locale::kok_IN),
         "ks-IN" => Some(Locale::ks_IN),
         "ku-TR" => Some(Locale::ku_TR),

*** result: Success
