*** espanso-render/src/extension/date.rs:274:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -266,17 +266,17 @@
         "kl-GL" => Some(Locale::kl_GL),
         "km-KH" => Some(Locale::km_KH),
         "kn-IN" => Some(Locale::kn_IN),
         "ko-KR" => Some(Locale::ko_KR),
         "kok-IN" => Some(Locale::kok_IN),
         "ks-IN" => Some(Locale::ks_IN),
         "ku-TR" => Some(Locale::ku_TR),
         "kw-GB" => Some(Locale::kw_GB),
-        "ky-KG" => Some(Locale::ky_KG),
+         /* ~ changed by cargo-mutants ~ */
         "lb-LU" => Some(Locale::lb_LU),
         "lg-UG" => Some(Locale::lg_UG),
         "li-BE" => Some(Locale::li_BE),
         "li-NL" => Some(Locale::li_NL),
         "lij-IT" => Some(Locale::lij_IT),
         "ln-CD" => Some(Locale::ln_CD),
         "lo-LA" => Some(Locale::lo_LA),
         "lt-LT" => Some(Locale::lt_LT),

*** result: Success
