*** espanso-render/src/extension/date.rs:279:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -271,17 +271,17 @@
         "ks-IN" => Some(Locale::ks_IN),
         "ku-TR" => Some(Locale::ku_TR),
         "kw-GB" => Some(Locale::kw_GB),
         "ky-KG" => Some(Locale::ky_KG),
         "lb-LU" => Some(Locale::lb_LU),
         "lg-UG" => Some(Locale::lg_UG),
         "li-BE" => Some(Locale::li_BE),
         "li-NL" => Some(Locale::li_NL),
-        "lij-IT" => Some(Locale::lij_IT),
+         /* ~ changed by cargo-mutants ~ */
         "ln-CD" => Some(Locale::ln_CD),
         "lo-LA" => Some(Locale::lo_LA),
         "lt-LT" => Some(Locale::lt_LT),
         "lv-LV" => Some(Locale::lv_LV),
         "lzh-TW" => Some(Locale::lzh_TW),
         "mag-IN" => Some(Locale::mag_IN),
         "mai-IN" => Some(Locale::mai_IN),
         "mai-NP" => Some(Locale::mai_NP),

*** result: Success
