*** espanso-render/src/extension/date.rs:282:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -274,17 +274,17 @@
         "ky-KG" => Some(Locale::ky_KG),
         "lb-LU" => Some(Locale::lb_LU),
         "lg-UG" => Some(Locale::lg_UG),
         "li-BE" => Some(Locale::li_BE),
         "li-NL" => Some(Locale::li_NL),
         "lij-IT" => Some(Locale::lij_IT),
         "ln-CD" => Some(Locale::ln_CD),
         "lo-LA" => Some(Locale::lo_LA),
-        "lt-LT" => Some(Locale::lt_LT),
+         /* ~ changed by cargo-mutants ~ */
         "lv-LV" => Some(Locale::lv_LV),
         "lzh-TW" => Some(Locale::lzh_TW),
         "mag-IN" => Some(Locale::mag_IN),
         "mai-IN" => Some(Locale::mai_IN),
         "mai-NP" => Some(Locale::mai_NP),
         "mfe-MU" => Some(Locale::mfe_MU),
         "mg-MG" => Some(Locale::mg_MG),
         "mhr-RU" => Some(Locale::mhr_RU),

*** result: Success
