*** espanso-render/src/extension/date.rs:285:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -277,17 +277,17 @@
         "li-BE" => Some(Locale::li_BE),
         "li-NL" => Some(Locale::li_NL),
         "lij-IT" => Some(Locale::lij_IT),
         "ln-CD" => Some(Locale::ln_CD),
         "lo-LA" => Some(Locale::lo_LA),
         "lt-LT" => Some(Locale::lt_LT),
         "lv-LV" => Some(Locale::lv_LV),
         "lzh-TW" => Some(Locale::lzh_TW),
-        "mag-IN" => Some(Locale::mag_IN),
+         /* ~ changed by cargo-mutants ~ */
         "mai-IN" => Some(Locale::mai_IN),
         "mai-NP" => Some(Locale::mai_NP),
         "mfe-MU" => Some(Locale::mfe_MU),
         "mg-MG" => Some(Locale::mg_MG),
         "mhr-RU" => Some(Locale::mhr_RU),
         "mi-NZ" => Some(Locale::mi_NZ),
         "miq-NI" => Some(Locale::miq_NI),
         "mjw-IN" => Some(Locale::mjw_IN),

*** result: Success
