*** espanso-render/src/extension/date.rs:287:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -279,17 +279,17 @@
         "lij-IT" => Some(Locale::lij_IT),
         "ln-CD" => Some(Locale::ln_CD),
         "lo-LA" => Some(Locale::lo_LA),
         "lt-LT" => Some(Locale::lt_LT),
         "lv-LV" => Some(Locale::lv_LV),
         "lzh-TW" => Some(Locale::lzh_TW),
         "mag-IN" => Some(Locale::mag_IN),
         "mai-IN" => Some(Locale::mai_IN),
-        "mai-NP" => Some(Locale::mai_NP),
+         /* ~ changed by cargo-mutants ~ */
         "mfe-MU" => Some(Locale::mfe_MU),
         "mg-MG" => Some(Locale::mg_MG),
         "mhr-RU" => Some(Locale::mhr_RU),
         "mi-NZ" => Some(Locale::mi_NZ),
         "miq-NI" => Some(Locale::miq_NI),
         "mjw-IN" => Some(Locale::mjw_IN),
         "mk-MK" => Some(Locale::mk_MK),
         "ml-IN" => Some(Locale::ml_IN),

*** result: Success
