*** espanso-render/src/extension/date.rs:289:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -281,17 +281,17 @@
         "lo-LA" => Some(Locale::lo_LA),
         "lt-LT" => Some(Locale::lt_LT),
         "lv-LV" => Some(Locale::lv_LV),
         "lzh-TW" => Some(Locale::lzh_TW),
         "mag-IN" => Some(Locale::mag_IN),
         "mai-IN" => Some(Locale::mai_IN),
         "mai-NP" => Some(Locale::mai_NP),
         "mfe-MU" => Some(Locale::mfe_MU),
-        "mg-MG" => Some(Locale::mg_MG),
+         /* ~ changed by cargo-mutants ~ */
         "mhr-RU" => Some(Locale::mhr_RU),
         "mi-NZ" => Some(Locale::mi_NZ),
         "miq-NI" => Some(Locale::miq_NI),
         "mjw-IN" => Some(Locale::mjw_IN),
         "mk-MK" => Some(Locale::mk_MK),
         "ml-IN" => Some(Locale::ml_IN),
         "mn-MN" => Some(Locale::mn_MN),
         "mni-IN" => Some(Locale::mni_IN),

*** result: Success
