*** espanso-render/src/extension/date.rs:291:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -283,17 +283,17 @@
         "lv-LV" => Some(Locale::lv_LV),
         "lzh-TW" => Some(Locale::lzh_TW),
         "mag-IN" => Some(Locale::mag_IN),
         "mai-IN" => Some(Locale::mai_IN),
         "mai-NP" => Some(Locale::mai_NP),
         "mfe-MU" => Some(Locale::mfe_MU),
         "mg-MG" => Some(Locale::mg_MG),
         "mhr-RU" => Some(Locale::mhr_RU),
-        "mi-NZ" => Some(Locale::mi_NZ),
+         /* ~ changed by cargo-mutants ~ */
         "miq-NI" => Some(Locale::miq_NI),
         "mjw-IN" => Some(Locale::mjw_IN),
         "mk-MK" => Some(Locale::mk_MK),
         "ml-IN" => Some(Locale::ml_IN),
         "mn-MN" => Some(Locale::mn_MN),
         "mni-IN" => Some(Locale::mni_IN),
         "mnw-MM" => Some(Locale::mnw_MM),
         "mr-IN" => Some(Locale::mr_IN),

*** result: Success
