*** espanso-render/src/extension/date.rs:296:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -288,17 +288,17 @@
         "mfe-MU" => Some(Locale::mfe_MU),
         "mg-MG" => Some(Locale::mg_MG),
         "mhr-RU" => Some(Locale::mhr_RU),
         "mi-NZ" => Some(Locale::mi_NZ),
         "miq-NI" => Some(Locale::miq_NI),
         "mjw-IN" => Some(Locale::mjw_IN),
         "mk-MK" => Some(Locale::mk_MK),
         "ml-IN" => Some(Locale::ml_IN),
-        "mn-MN" => Some(Locale::mn_MN),
+         /* ~ changed by cargo-mutants ~ */
         "mni-IN" => Some(Locale::mni_IN),
         "mnw-MM" => Some(Locale::mnw_MM),
         "mr-IN" => Some(Locale::mr_IN),
         "ms-MY" => Some(Locale::ms_MY),
         "mt-MT" => Some(Locale::mt_MT),
         "my-MM" => Some(Locale::my_MM),
         "nan-TW" => Some(Locale::nan_TW),
         "nb-NO" => Some(Locale::nb_NO),

*** result: Success
