*** espanso-render/src/extension/date.rs:298:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -290,17 +290,17 @@
         "mhr-RU" => Some(Locale::mhr_RU),
         "mi-NZ" => Some(Locale::mi_NZ),
         "miq-NI" => Some(Locale::miq_NI),
         "mjw-IN" => Some(Locale::mjw_IN),
         "mk-MK" => Some(Locale::mk_MK),
         "ml-IN" => Some(Locale::ml_IN),
         "mn-MN" => Some(Locale::mn_MN),
         "mni-IN" => Some(Locale::mni_IN),
-        "mnw-MM" => Some(Locale::mnw_MM),
+         /* ~ changed by cargo-mutants ~ */
         "mr-IN" => Some(Locale::mr_IN),
         "ms-MY" => Some(Locale::ms_MY),
         "mt-MT" => Some(Locale::mt_MT),
         "my-MM" => Some(Locale::my_MM),
         "nan-TW" => Some(Locale::nan_TW),
         "nb-NO" => Some(Locale::nb_NO),
         "nds-DE" => Some(Locale::nds_DE),
         "nds-NL" => Some(Locale::nds_NL),

*** result: Success
