*** espanso-render/src/extension/date.rs:300:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -292,17 +292,17 @@
         "miq-NI" => Some(Locale::miq_NI),
         "mjw-IN" => Some(Locale::mjw_IN),
         "mk-MK" => Some(Locale::mk_MK),
         "ml-IN" => Some(Locale::ml_IN),
         "mn-MN" => Some(Locale::mn_MN),
         "mni-IN" => Some(Locale::mni_IN),
         "mnw-MM" => Some(Locale::mnw_MM),
         "mr-IN" => Some(Locale::mr_IN),
-        "ms-MY" => Some(Locale::ms_MY),
+         /* ~ changed by cargo-mutants ~ */
         "mt-MT" => Some(Locale::mt_MT),
         "my-MM" => Some(Locale::my_MM),
         "nan-TW" => Some(Locale::nan_TW),
         "nb-NO" => Some(Locale::nb_NO),
         "nds-DE" => Some(Locale::nds_DE),
         "nds-NL" => Some(Locale::nds_NL),
         "ne-NP" => Some(Locale::ne_NP),
         "nhn-MX" => Some(Locale::nhn_MX),

*** result: Success
