*** espanso-render/src/extension/date.rs:303:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -295,17 +295,17 @@
         "ml-IN" => Some(Locale::ml_IN),
         "mn-MN" => Some(Locale::mn_MN),
         "mni-IN" => Some(Locale::mni_IN),
         "mnw-MM" => Some(Locale::mnw_MM),
         "mr-IN" => Some(Locale::mr_IN),
         "ms-MY" => Some(Locale::ms_MY),
         "mt-MT" => Some(Locale::mt_MT),
         "my-MM" => Some(Locale::my_MM),
-        "nan-TW" => Some(Locale::nan_TW),
+         /* ~ changed by cargo-mutants ~ */
         "nb-NO" => Some(Locale::nb_NO),
         "nds-DE" => Some(Locale::nds_DE),
         "nds-NL" => Some(Locale::nds_NL),
         "ne-NP" => Some(Locale::ne_NP),
         "nhn-MX" => Some(Locale::nhn_MX),
         "niu-NU" => Some(Locale::niu_NU),
         "niu-NZ" => Some(Locale::niu_NZ),
         "nl-AW" => Some(Locale::nl_AW),

*** result: Success
