*** espanso-render/src/extension/date.rs:316:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -308,17 +308,17 @@
         "nhn-MX" => Some(Locale::nhn_MX),
         "niu-NU" => Some(Locale::niu_NU),
         "niu-NZ" => Some(Locale::niu_NZ),
         "nl-AW" => Some(Locale::nl_AW),
         "nl-BE" => Some(Locale::nl_BE),
         "nl-NL" => Some(Locale::nl_NL),
         "nn-NO" => Some(Locale::nn_NO),
         "nr-ZA" => Some(Locale::nr_ZA),
-        "nso-ZA" => Some(Locale::nso_ZA),
+         /* ~ changed by cargo-mutants ~ */
         "oc-FR" => Some(Locale::oc_FR),
         "om-ET" => Some(Locale::om_ET),
         "om-KE" => Some(Locale::om_KE),
         "or-IN" => Some(Locale::or_IN),
         "os-RU" => Some(Locale::os_RU),
         "pa-IN" => Some(Locale::pa_IN),
         "pa-PK" => Some(Locale::pa_PK),
         "pap-AW" => Some(Locale::pap_AW),

*** result: Success
