*** espanso-render/src/extension/date.rs:324:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -316,17 +316,17 @@
         "nso-ZA" => Some(Locale::nso_ZA),
         "oc-FR" => Some(Locale::oc_FR),
         "om-ET" => Some(Locale::om_ET),
         "om-KE" => Some(Locale::om_KE),
         "or-IN" => Some(Locale::or_IN),
         "os-RU" => Some(Locale::os_RU),
         "pa-IN" => Some(Locale::pa_IN),
         "pa-PK" => Some(Locale::pa_PK),
-        "pap-AW" => Some(Locale::pap_AW),
+         /* ~ changed by cargo-mutants ~ */
         "pap-CW" => Some(Locale::pap_CW),
         "pl-PL" => Some(Locale::pl_PL),
         "ps-AF" => Some(Locale::ps_AF),
         "pt-BR" => Some(Locale::pt_BR),
         "pt-PT" => Some(Locale::pt_PT),
         "quz-PE" => Some(Locale::quz_PE),
         "raj-IN" => Some(Locale::raj_IN),
         "ro-RO" => Some(Locale::ro_RO),

*** result: Success
