*** espanso-render/src/extension/date.rs:333:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -325,17 +325,17 @@
         "pap-CW" => Some(Locale::pap_CW),
         "pl-PL" => Some(Locale::pl_PL),
         "ps-AF" => Some(Locale::ps_AF),
         "pt-BR" => Some(Locale::pt_BR),
         "pt-PT" => Some(Locale::pt_PT),
         "quz-PE" => Some(Locale::quz_PE),
         "raj-IN" => Some(Locale::raj_IN),
         "ro-RO" => Some(Locale::ro_RO),
-        "ru-RU" => Some(Locale::ru_RU),
+         /* ~ changed by cargo-mutants ~ */
         "ru-UA" => Some(Locale::ru_UA),
         "rw-RW" => Some(Locale::rw_RW),
         "sa-IN" => Some(Locale::sa_IN),
         "sah-RU" => Some(Locale::sah_RU),
         "sat-IN" => Some(Locale::sat_IN),
         "sc-IT" => Some(Locale::sc_IT),
         "sd-IN" => Some(Locale::sd_IN),
         "se-NO" => Some(Locale::se_NO),

*** result: Success
