*** espanso-render/src/extension/date.rs:344:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -336,17 +336,17 @@
         "sa-IN" => Some(Locale::sa_IN),
         "sah-RU" => Some(Locale::sah_RU),
         "sat-IN" => Some(Locale::sat_IN),
         "sc-IT" => Some(Locale::sc_IT),
         "sd-IN" => Some(Locale::sd_IN),
         "se-NO" => Some(Locale::se_NO),
         "sgs-LT" => Some(Locale::sgs_LT),
         "shn-MM" => Some(Locale::shn_MM),
-        "shs-CA" => Some(Locale::shs_CA),
+         /* ~ changed by cargo-mutants ~ */
         "si-LK" => Some(Locale::si_LK),
         "sid-ET" => Some(Locale::sid_ET),
         "sk-SK" => Some(Locale::sk_SK),
         "sl-SI" => Some(Locale::sl_SI),
         "sm-WS" => Some(Locale::sm_WS),
         "so-DJ" => Some(Locale::so_DJ),
         "so-ET" => Some(Locale::so_ET),
         "so-KE" => Some(Locale::so_KE),

*** result: Success
