*** espanso-render/src/extension/date.rs:346:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -338,17 +338,17 @@
         "sat-IN" => Some(Locale::sat_IN),
         "sc-IT" => Some(Locale::sc_IT),
         "sd-IN" => Some(Locale::sd_IN),
         "se-NO" => Some(Locale::se_NO),
         "sgs-LT" => Some(Locale::sgs_LT),
         "shn-MM" => Some(Locale::shn_MM),
         "shs-CA" => Some(Locale::shs_CA),
         "si-LK" => Some(Locale::si_LK),
-        "sid-ET" => Some(Locale::sid_ET),
+         /* ~ changed by cargo-mutants ~ */
         "sk-SK" => Some(Locale::sk_SK),
         "sl-SI" => Some(Locale::sl_SI),
         "sm-WS" => Some(Locale::sm_WS),
         "so-DJ" => Some(Locale::so_DJ),
         "so-ET" => Some(Locale::so_ET),
         "so-KE" => Some(Locale::so_KE),
         "so-SO" => Some(Locale::so_SO),
         "sq-AL" => Some(Locale::sq_AL),

*** result: Success
