*** espanso-render/src/extension/date.rs:353:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -345,17 +345,17 @@
         "si-LK" => Some(Locale::si_LK),
         "sid-ET" => Some(Locale::sid_ET),
         "sk-SK" => Some(Locale::sk_SK),
         "sl-SI" => Some(Locale::sl_SI),
         "sm-WS" => Some(Locale::sm_WS),
         "so-DJ" => Some(Locale::so_DJ),
         "so-ET" => Some(Locale::so_ET),
         "so-KE" => Some(Locale::so_KE),
-        "so-SO" => Some(Locale::so_SO),
+         /* ~ changed by cargo-mutants ~ */
         "sq-AL" => Some(Locale::sq_AL),
         "sq-MK" => Some(Locale::sq_MK),
         "sr-ME" => Some(Locale::sr_ME),
         "sr-RS" => Some(Locale::sr_RS),
         "ss-ZA" => Some(Locale::ss_ZA),
         "st-ZA" => Some(Locale::st_ZA),
         "sv-FI" => Some(Locale::sv_FI),
         "sv-SE" => Some(Locale::sv_SE),

*** result: Success
