*** espanso-render/src/extension/date.rs:359:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -351,17 +351,17 @@
         "so-ET" => Some(Locale::so_ET),
         "so-KE" => Some(Locale::so_KE),
         "so-SO" => Some(Locale::so_SO),
         "sq-AL" => Some(Locale::sq_AL),
         "sq-MK" => Some(Locale::sq_MK),
         "sr-ME" => Some(Locale::sr_ME),
         "sr-RS" => Some(Locale::sr_RS),
         "ss-ZA" => Some(Locale::ss_ZA),
-        "st-ZA" => Some(Locale::st_ZA),
+         /* ~ changed by cargo-mutants ~ */
         "sv-FI" => Some(Locale::sv_FI),
         "sv-SE" => Some(Locale::sv_SE),
         "sw-KE" => Some(Locale::sw_KE),
         "sw-TZ" => Some(Locale::sw_TZ),
         "szl-PL" => Some(Locale::szl_PL),
         "ta-IN" => Some(Locale::ta_IN),
         "ta-LK" => Some(Locale::ta_LK),
         "tcy-IN" => Some(Locale::tcy_IN),

*** result: Success
