*** espanso-render/src/extension/date.rs:369:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -361,17 +361,17 @@
         "sv-SE" => Some(Locale::sv_SE),
         "sw-KE" => Some(Locale::sw_KE),
         "sw-TZ" => Some(Locale::sw_TZ),
         "szl-PL" => Some(Locale::szl_PL),
         "ta-IN" => Some(Locale::ta_IN),
         "ta-LK" => Some(Locale::ta_LK),
         "tcy-IN" => Some(Locale::tcy_IN),
         "te-IN" => Some(Locale::te_IN),
-        "tg-TJ" => Some(Locale::tg_TJ),
+         /* ~ changed by cargo-mutants ~ */
         "th-TH" => Some(Locale::th_TH),
         "the-NP" => Some(Locale::the_NP),
         "ti-ER" => Some(Locale::ti_ER),
         "ti-ET" => Some(Locale::ti_ET),
         "tig-ER" => Some(Locale::tig_ER),
         "tk-TM" => Some(Locale::tk_TM),
         "tl-PH" => Some(Locale::tl_PH),
         "tn-ZA" => Some(Locale::tn_ZA),

*** result: Success
