*** espanso-render/src/extension/date.rs:372:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -364,17 +364,17 @@
         "szl-PL" => Some(Locale::szl_PL),
         "ta-IN" => Some(Locale::ta_IN),
         "ta-LK" => Some(Locale::ta_LK),
         "tcy-IN" => Some(Locale::tcy_IN),
         "te-IN" => Some(Locale::te_IN),
         "tg-TJ" => Some(Locale::tg_TJ),
         "th-TH" => Some(Locale::th_TH),
         "the-NP" => Some(Locale::the_NP),
-        "ti-ER" => Some(Locale::ti_ER),
+         /* ~ changed by cargo-mutants ~ */
         "ti-ET" => Some(Locale::ti_ET),
         "tig-ER" => Some(Locale::tig_ER),
         "tk-TM" => Some(Locale::tk_TM),
         "tl-PH" => Some(Locale::tl_PH),
         "tn-ZA" => Some(Locale::tn_ZA),
         "to-TO" => Some(Locale::to_TO),
         "tpi-PG" => Some(Locale::tpi_PG),
         "tr-CY" => Some(Locale::tr_CY),

*** result: Success
