*** espanso-render/src/extension/date.rs:376:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -368,17 +368,17 @@
         "te-IN" => Some(Locale::te_IN),
         "tg-TJ" => Some(Locale::tg_TJ),
         "th-TH" => Some(Locale::th_TH),
         "the-NP" => Some(Locale::the_NP),
         "ti-ER" => Some(Locale::ti_ER),
         "ti-ET" => Some(Locale::ti_ET),
         "tig-ER" => Some(Locale::tig_ER),
         "tk-TM" => Some(Locale::tk_TM),
-        "tl-PH" => Some(Locale::tl_PH),
+         /* ~ changed by cargo-mutants ~ */
         "tn-ZA" => Some(Locale::tn_ZA),
         "to-TO" => Some(Locale::to_TO),
         "tpi-PG" => Some(Locale::tpi_PG),
         "tr-CY" => Some(Locale::tr_CY),
         "tr-TR" => Some(Locale::tr_TR),
         "ts-ZA" => Some(Locale::ts_ZA),
         "tt-RU" => Some(Locale::tt_RU),
         "ug-CN" => Some(Locale::ug_CN),

*** result: Success
