*** espanso-render/src/extension/date.rs:384:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -376,17 +376,17 @@
         "tl-PH" => Some(Locale::tl_PH),
         "tn-ZA" => Some(Locale::tn_ZA),
         "to-TO" => Some(Locale::to_TO),
         "tpi-PG" => Some(Locale::tpi_PG),
         "tr-CY" => Some(Locale::tr_CY),
         "tr-TR" => Some(Locale::tr_TR),
         "ts-ZA" => Some(Locale::ts_ZA),
         "tt-RU" => Some(Locale::tt_RU),
-        "ug-CN" => Some(Locale::ug_CN),
+         /* ~ changed by cargo-mutants ~ */
         "uk-UA" => Some(Locale::uk_UA),
         "unm-US" => Some(Locale::unm_US),
         "ur-IN" => Some(Locale::ur_IN),
         "ur-PK" => Some(Locale::ur_PK),
         "uz-UZ" => Some(Locale::uz_UZ),
         "ve-ZA" => Some(Locale::ve_ZA),
         "vi-VN" => Some(Locale::vi_VN),
         "wa-BE" => Some(Locale::wa_BE),

*** result: Success
