*** espanso-render/src/extension/date.rs:388:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -380,17 +380,17 @@
         "tr-CY" => Some(Locale::tr_CY),
         "tr-TR" => Some(Locale::tr_TR),
         "ts-ZA" => Some(Locale::ts_ZA),
         "tt-RU" => Some(Locale::tt_RU),
         "ug-CN" => Some(Locale::ug_CN),
         "uk-UA" => Some(Locale::uk_UA),
         "unm-US" => Some(Locale::unm_US),
         "ur-IN" => Some(Locale::ur_IN),
-        "ur-PK" => Some(Locale::ur_PK),
+         /* ~ changed by cargo-mutants ~ */
         "uz-UZ" => Some(Locale::uz_UZ),
         "ve-ZA" => Some(Locale::ve_ZA),
         "vi-VN" => Some(Locale::vi_VN),
         "wa-BE" => Some(Locale::wa_BE),
         "wae-CH" => Some(Locale::wae_CH),
         "wal-ET" => Some(Locale::wal_ET),
         "wo-SN" => Some(Locale::wo_SN),
         "xh-ZA" => Some(Locale::xh_ZA),

*** result: Success
