*** espanso-render/src/extension/date.rs:404:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -396,17 +396,17 @@
         "xh-ZA" => Some(Locale::xh_ZA),
         "yi-US" => Some(Locale::yi_US),
         "yo-NG" => Some(Locale::yo_NG),
         "yue-HK" => Some(Locale::yue_HK),
         "yuw-PG" => Some(Locale::yuw_PG),
         "zh-CN" => Some(Locale::zh_CN),
         "zh-HK" => Some(Locale::zh_HK),
         "zh-SG" => Some(Locale::zh_SG),
-        "zh-TW" => Some(Locale::zh_TW),
+         /* ~ changed by cargo-mutants ~ */
         "zu-ZA" => Some(Locale::zu_ZA),
         _ => None,
     }
 }
 
 pub struct DefaultLocaleProvider {}
 impl LocaleProvider for DefaultLocaleProvider {
     fn get_system_locale(&self) -> String {

*** result: Success
