*** espanso-render/src/extension/date.rs:405:9: delete match arm

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ delete match arm
@@ -397,17 +397,17 @@
         "yi-US" => Some(Locale::yi_US),
         "yo-NG" => Some(Locale::yo_NG),
         "yue-HK" => Some(Locale::yue_HK),
         "yuw-PG" => Some(Locale::yuw_PG),
         "zh-CN" => Some(Locale::zh_CN),
         "zh-HK" => Some(Locale::zh_HK),
         "zh-SG" => Some(Locale::zh_SG),
         "zh-TW" => Some(Locale::zh_TW),
-        "zu-ZA" => Some(Locale::zu_ZA),
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 pub struct DefaultLocaleProvider {}
 impl LocaleProvider for DefaultLocaleProvider {
     fn get_system_locale(&self) -> String {
         sys_locale::get_locale().unwrap_or_else(|| String::from("en-US"))

*** result: Success
