*** espanso-render/src/extension/date.rs:413:9: replace <impl LocaleProvider for DefaultLocaleProvider>::get_system_locale -> String with String::new()

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ replace <impl LocaleProvider for DefaultLocaleProvider>::get_system_locale -> String with String::new()
@@ -405,17 +405,17 @@
         "zu-ZA" => Some(Locale::zu_ZA),
         _ => None,
     }
 }
 
 pub struct DefaultLocaleProvider {}
 impl LocaleProvider for DefaultLocaleProvider {
     fn get_system_locale(&self) -> String {
-        sys_locale::get_locale().unwrap_or_else(|| String::from("en-US"))
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 #[allow(clippy::new_without_default)]
 impl DefaultLocaleProvider {
     pub fn new() -> Self {
         Self {}
     }
 }

*** result: Success
