*** espanso-render/src/extension/date.rs:45:9: replace <impl Extension for DateExtension<'_>>::name -> &'static str with "xyzzy"

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ replace <impl Extension for DateExtension<'_>>::name -> &'static str with "xyzzy"
@@ -37,17 +37,17 @@
             fixed_date: None,
             locale_provider,
         }
     }
 }
 
 impl Extension for DateExtension<'_> {
     fn name(&self) -> &'static str {
-        "date"
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn calculate(
         &self,
         _: &crate::Context,
         _: &crate::Scope,
         params: &Params,
     ) -> crate::ExtensionResult {

*** result: Success
