*** espanso-render/src/extension/date.rs:60:23: replace + with - in <impl Extension for DateExtension<'_>>::calculate

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ replace + with - in <impl Extension for DateExtension<'_>>::calculate
@@ -52,17 +52,17 @@
         params: &Params,
     ) -> crate::ExtensionResult {
         let mut now = self.get_date();
 
         // Compute the given offset
         let offset = params.get("offset");
         if let Some(Value::Number(Number::Integer(offset))) = offset {
             let offset = Duration::seconds(*offset);
-            now = now + offset;
+            now = now - /* ~ changed by cargo-mutants ~ */ offset;
         }
 
         let format = params.get("format");
         let locale = params
             .get("locale")
             .and_then(|val| val.as_string())
             .map_or_else(|| self.locale_provider.get_system_locale(), String::from);

---- extension::date::tests::offset_works_correctly stdout ----

thread 'extension::date::tests::offset_works_correctly' panicked at espanso-render/src/extension/date.rs:480:9:
assertion `left == right` failed
  left: Single("08:10:11")
 right: Single("10:10:11")

failures:
    extension::date::tests::offset_works_correctly

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
