*** espanso-render/src/extension/date.rs:89:9: replace DateExtension<'_>::format_date_with_locale -> String with String::new()

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ replace DateExtension<'_>::format_date_with_locale -> String with String::new()
@@ -81,17 +81,17 @@
         if let Some(fixed_date) = self.fixed_date {
             fixed_date
         } else {
             Local::now()
         }
     }
 
     fn format_date_with_locale(date: DateTime<Local>, format: &str, locale: Locale) -> String {
-        date.format_localized(format, locale).to_string()
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     fn format_date_with_locale_string(
         date: DateTime<Local>,
         format: &str,
         locale_str: &str,
     ) -> String {
         let locale = convert_locale_string_to_locale(locale_str).unwrap_or(Locale::en_US);

---- extension::date::tests::default_locale_works_correctly stdout ----

thread 'extension::date::tests::default_locale_works_correctly' panicked at espanso-render/src/extension/date.rs:498:9:
assertion `left == right` failed
  left: Single("")
 right: Single("martedì")

---- extension::date::tests::date_formatted_correctly stdout ----

thread 'extension::date::tests::date_formatted_correctly' panicked at espanso-render/src/extension/date.rs:459:9:
assertion `left == right` failed
  left: Single("")
 right: Single("09:10:11")

---- extension::date::tests::invalid_locale_should_default_to_en_us stdout ----

thread 'extension::date::tests::invalid_locale_should_default_to_en_us' panicked at espanso-render/src/extension/date.rs:516:9:
assertion `left == right` failed
  left: Single("")
 right: Single("Tuesday")

failures:
    extension::date::tests::date_formatted_correctly
    extension::date::tests::default_locale_works_correctly
    extension::date::tests::invalid_locale_should_default_to_en_us
    extension::date::tests::offset_works_correctly
    extension::date::tests::override_locale

test result: FAILED. 48 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.42s

*** result: Failure(101)
