*** espanso-render/src/extension/date.rs:97:9: replace DateExtension<'_>::format_date_with_locale_string -> String with String::new()

*** mutation diff:
--- espanso-render/src/extension/date.rs
+++ replace DateExtension<'_>::format_date_with_locale_string -> String with String::new()
@@ -89,18 +89,17 @@
         date.format_localized(format, locale).to_string()
     }
 
     fn format_date_with_locale_string(
         date: DateTime<Local>,
         format: &str,
         locale_str: &str,
     ) -> String {
-        let locale = convert_locale_string_to_locale(locale_str).unwrap_or(Locale::en_US);
-        Self::format_date_with_locale(date, format, locale)
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn convert_locale_string_to_locale(locale_str: &str) -> Option<Locale> {
     match locale_str {
         "aa-DJ" => Some(Locale::aa_DJ),
         "aa-ER" => Some(Locale::aa_ER),
         "aa-ET" => Some(Locale::aa_ET),

---- extension::date::tests::offset_works_correctly stdout ----

thread 'extension::date::tests::offset_works_correctly' panicked at espanso-render/src/extension/date.rs:479:9:
assertion `left == right` failed
  left: Single("")
 right: Single("10:10:11")

---- extension::date::tests::date_formatted_correctly stdout ----

thread 'extension::date::tests::date_formatted_correctly' panicked at espanso-render/src/extension/date.rs:458:9:
assertion `left == right` failed
  left: Single("")
 right: Single("09:10:11")

---- extension::date::tests::override_locale stdout ----

thread 'extension::date::tests::override_locale' panicked at espanso-render/src/extension/date.rs:536:9:
assertion `left == right` failed
  left: Single("")
 right: Single("martedì")

failures:
    extension::date::tests::date_formatted_correctly
    extension::date::tests::default_locale_works_correctly
    extension::date::tests::invalid_locale_should_default_to_en_us
    extension::date::tests::offset_works_correctly
    extension::date::tests::override_locale

test result: FAILED. 48 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
