*** espanso-render/src/extension/echo.rs:44:9: replace <impl Extension for EchoExtension>::name -> &str with "xyzzy"

*** mutation diff:
--- espanso-render/src/extension/echo.rs
+++ replace <impl Extension for EchoExtension>::name -> &str with "xyzzy"
@@ -36,17 +36,17 @@
         Self {
             alias: alias.to_string(),
         }
     }
 }
 
 impl Extension for EchoExtension {
     fn name(&self) -> &str {
-        self.alias.as_str()
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn calculate(
         &self,
         _: &crate::Context,
         _: &crate::Scope,
         params: &Params,
     ) -> crate::ExtensionResult {

---- extension::echo::tests::alias stdout ----

thread 'extension::echo::tests::alias' panicked at espanso-render/src/extension/echo.rs:105:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "echo"

failures:
    extension::echo::tests::alias

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.42s

*** result: Failure(101)
