*** espanso-render/src/extension/exec_util.rs:30:5: replace determine_path_env_variable_override -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- espanso-render/src/extension/exec_util.rs
+++ replace determine_path_env_variable_override -> Option<String> with Some("xyzzy".into())
@@ -22,40 +22,17 @@
     Nu,
     Pwsh,
     Sh,
     Zsh,
 }
 
 // Determine the PATH env variable value for macOS available inside a regular terminal session
 pub fn determine_path_env_variable_override(explicit_shell: Option<MacShell>) -> Option<String> {
-    if cfg!(not(target_os = "macos")) {
-        return None;
-    }
-    let shell: MacShell = explicit_shell.or_else(determine_default_macos_shell)?;
-
-    match shell {
-        MacShell::Bash => launch_command_and_get_output(
-            "bash",
-            &["--login", "-c", "source ~/.bashrc; echo $PATH"],
-        ),
-        MacShell::Nu => launch_command_and_get_output("nu", &["--login", "-c", "$env.PATH"]),
-        MacShell::Pwsh => launch_command_and_get_output(
-            "pwsh",
-            &[
-                "-Login",
-                "-Command",
-                "if(Test-Path \"$PROFILE\") { . \"$PROFILE\" }; Write-Host $env:PATH",
-            ],
-        ),
-        MacShell::Sh => launch_command_and_get_output("sh", &["--login", "-c", "echo $PATH"]),
-        MacShell::Zsh => {
-            launch_command_and_get_output("zsh", &["--login", "-c", "source ~/.zshrc; echo $PATH"])
-        }
-    }
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn determine_default_macos_shell() -> Option<MacShell> {
     if cfg!(not(target_os = "macos")) {
         return None;
     }
     use regex::Regex;
     use std::process::Command;

---- extension::shell::tests::shell_not_trimmed stdout ----

thread 'extension::shell::tests::shell_not_trimmed' panicked at espanso-render/src/extension/shell.rs:344:22:
called `Result::unwrap()` on an `Err` value: Error(could not execute command: '`echo "hello world"`', error: '`No such file or directory (os error 2)`')

---- extension::shell::tests::pipes stdout ----

thread 'extension::shell::tests::pipes' panicked at espanso-render/src/extension/shell.rs:385:18:
called `Result::unwrap()` on an `Err` value: Error(could not execute command: '`echo "hello world" | cat`', error: '`No such file or directory (os error 2)`')

---- extension::shell::tests::shell_trimmed stdout ----

thread 'extension::shell::tests::shell_trimmed' panicked at espanso-render/src/extension/shell.rs:365:18:
called `Result::unwrap()` on an `Err` value: Error(could not execute command: '`echo "hello world"`', error: '`No such file or directory (os error 2)`')

failures:
    extension::shell::tests::pipes
    extension::shell::tests::shell_not_trimmed
    extension::shell::tests::shell_trimmed
    extension::shell::tests::var_injection

test result: FAILED. 49 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
