*** espanso-render/src/extension/exec_util.rs:98:5: replace launch_command_and_get_output -> Option<String> with Some("xyzzy".into())

*** mutation diff:
--- espanso-render/src/extension/exec_util.rs
+++ replace launch_command_and_get_output -> Option<String> with Some("xyzzy".into())
@@ -90,19 +90,10 @@
     } else if shell.ends_with("/zsh") {
         Some(MacShell::Zsh)
     } else {
         None
     }
 }
 
 fn launch_command_and_get_output(command: &str, args: &[&str]) -> Option<String> {
-    use std::process::Command;
-
-    let output = Command::new(command).args(args).output().ok()?;
-
-    if !output.status.success() {
-        return None;
-    }
-
-    let output_str = String::from_utf8_lossy(&output.stdout);
-    Some(output_str.to_string())
+    Some("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }

---- extension::shell::tests::var_injection stdout ----

thread 'extension::shell::tests::var_injection' panicked at espanso-render/src/extension/shell.rs:418:18:
called `Result::unwrap()` on an `Err` value: Error(could not execute command: '`echo $ESPANSO_VAR1`', error: '`No such file or directory (os error 2)`')

---- extension::shell::tests::shell_not_trimmed stdout ----

thread 'extension::shell::tests::shell_not_trimmed' panicked at espanso-render/src/extension/shell.rs:344:22:
called `Result::unwrap()` on an `Err` value: Error(could not execute command: '`echo "hello world"`', error: '`No such file or directory (os error 2)`')

---- extension::shell::tests::shell_trimmed stdout ----

thread 'extension::shell::tests::shell_trimmed' panicked at espanso-render/src/extension/shell.rs:365:18:
called `Result::unwrap()` on an `Err` value: Error(could not execute command: '`echo "hello world"`', error: '`No such file or directory (os error 2)`')

failures:
    extension::shell::tests::pipes
    extension::shell::tests::shell_not_trimmed
    extension::shell::tests::shell_trimmed
    extension::shell::tests::var_injection

test result: FAILED. 49 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
