*** espanso-render/src/extension/exec_util.rs:98:5: replace launch_command_and_get_output -> Option<String> with None

*** mutation diff:
--- espanso-render/src/extension/exec_util.rs
+++ replace launch_command_and_get_output -> Option<String> with None
@@ -90,19 +90,10 @@
     } else if shell.ends_with("/zsh") {
         Some(MacShell::Zsh)
     } else {
         None
     }
 }
 
 fn launch_command_and_get_output(command: &str, args: &[&str]) -> Option<String> {
-    use std::process::Command;
-
-    let output = Command::new(command).args(args).output().ok()?;
-
-    if !output.status.success() {
-        return None;
-    }
-
-    let output_str = String::from_utf8_lossy(&output.stdout);
-    Some(output_str.to_string())
+    None /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
