*** espanso-render/src/extension/form.rs:51:9: replace <impl Extension for FormExtension<'_>>::name -> &'static str with ""

*** mutation diff:
--- espanso-render/src/extension/form.rs
+++ replace <impl Extension for FormExtension<'_>>::name -> &'static str with ""
@@ -43,17 +43,17 @@
 impl<'a> FormExtension<'a> {
     pub fn new(provider: &'a dyn FormProvider) -> Self {
         Self { provider }
     }
 }
 
 impl Extension for FormExtension<'_> {
     fn name(&self) -> &'static str {
-        "form"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn calculate(
         &self,
         _: &crate::Context,
         _: &crate::Scope,
         params: &Params,
     ) -> crate::ExtensionResult {

*** result: Success
