*** espanso-render/src/extension/script.rs:129:24: delete ! in <impl Extension for ScriptExtension>::calculate

*** mutation diff:
--- espanso-render/src/extension/script.rs
+++ delete ! in <impl Extension for ScriptExtension>::calculate
@@ -121,17 +121,17 @@
                     }
 
                     let ignore_error = params
                         .get("ignore_error")
                         .and_then(|v| v.as_bool())
                         .copied()
                         .unwrap_or(false);
 
-                    if !output.status.success() || !error_str.trim().is_empty() {
+                    if  /* ~ changed by cargo-mutants ~ */output.status.success() || !error_str.trim().is_empty() {
                         warn!(
                             "script command exited with code: {} and error: {}",
                             output.status, error_str
                         );
 
                         if !ignore_error {
                             return ExtensionResult::Error(
                                 ScriptExtensionError::ExecutionError(error_str.to_string()).into(),

---- extension::script::tests::basic_no_trim stdout ----

thread 'extension::script::tests::basic_no_trim' panicked at espanso-render/src/extension/script.rs:243:22:
called `Result::unwrap()` on an `Err` value: Error(script reported error: '``')

---- extension::script::tests::basic stdout ----

thread 'extension::script::tests::basic' panicked at espanso-render/src/extension/script.rs:208:18:
called `Result::unwrap()` on an `Err` value: Error(script reported error: '``')

---- extension::script::tests::var_injection stdout ----

thread 'extension::script::tests::var_injection' panicked at espanso-render/src/extension/script.rs:270:18:
called `Result::unwrap()` on an `Err` value: Error(script reported error: '``')

failures:
    extension::script::tests::basic
    extension::script::tests::basic_no_trim
    extension::script::tests::exit_error
    extension::script::tests::var_injection

test result: FAILED. 49 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
