*** espanso-render/src/extension/script.rs:129:49: replace || with && in <impl Extension for ScriptExtension>::calculate

*** mutation diff:
--- espanso-render/src/extension/script.rs
+++ replace || with && in <impl Extension for ScriptExtension>::calculate
@@ -121,17 +121,17 @@
                     }
 
                     let ignore_error = params
                         .get("ignore_error")
                         .and_then(|v| v.as_bool())
                         .copied()
                         .unwrap_or(false);
 
-                    if !output.status.success() || !error_str.trim().is_empty() {
+                    if !output.status.success() && /* ~ changed by cargo-mutants ~ */ !error_str.trim().is_empty() {
                         warn!(
                             "script command exited with code: {} and error: {}",
                             output.status, error_str
                         );
 
                         if !ignore_error {
                             return ExtensionResult::Error(
                                 ScriptExtensionError::ExecutionError(error_str.to_string()).into(),

---- extension::script::tests::exit_error stdout ----

thread 'extension::script::tests::exit_error' panicked at espanso-render/src/extension/script.rs:306:9:
assertion failed: matches!(extension.calculate(&crate::Context::default(), &HashMap::default(),
    &param), ExtensionResult::Error(_))

failures:
    extension::script::tests::exit_error

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
