*** espanso-render/src/extension/script.rs:135:28: delete ! in <impl Extension for ScriptExtension>::calculate

*** mutation diff:
--- espanso-render/src/extension/script.rs
+++ delete ! in <impl Extension for ScriptExtension>::calculate
@@ -127,17 +127,17 @@
                         .unwrap_or(false);
 
                     if !output.status.success() || !error_str.trim().is_empty() {
                         warn!(
                             "script command exited with code: {} and error: {}",
                             output.status, error_str
                         );
 
-                        if !ignore_error {
+                        if  /* ~ changed by cargo-mutants ~ */ignore_error {
                             return ExtensionResult::Error(
                                 ScriptExtensionError::ExecutionError(error_str.to_string()).into(),
                             );
                         }
                     }
 
                     let trim = params
                         .get("trim")

---- extension::script::tests::exit_error stdout ----

thread 'extension::script::tests::exit_error' panicked at espanso-render/src/extension/script.rs:306:9:
assertion failed: matches!(extension.calculate(&crate::Context::default(), &HashMap::default(),
    &param), ExtensionResult::Error(_))

---- extension::script::tests::ignore_error stdout ----

thread 'extension::script::tests::ignore_error' panicked at espanso-render/src/extension/script.rs:334:18:
called `Result::unwrap()` on an `Err` value: Error(script reported error: '``')

failures:
    extension::script::tests::exit_error
    extension::script::tests::ignore_error

test result: FAILED. 51 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
