*** espanso-render/src/extension/script.rs:48:9: replace <impl Extension for ScriptExtension>::name -> &'static str with ""

*** mutation diff:
--- espanso-render/src/extension/script.rs
+++ replace <impl Extension for ScriptExtension>::name -> &'static str with ""
@@ -40,17 +40,17 @@
             home_path: home_path.to_owned(),
             packages_path: packages_path.to_owned(),
         }
     }
 }
 
 impl Extension for ScriptExtension {
     fn name(&self) -> &'static str {
-        "script"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn calculate(
         &self,
         _: &crate::Context,
         scope: &crate::Scope,
         params: &Params,
     ) -> crate::ExtensionResult {

*** result: Success
