*** espanso-render/src/extension/script.rs:96:40: replace > with == in <impl Extension for ScriptExtension>::calculate

*** mutation diff:
--- espanso-render/src/extension/script.rs
+++ replace > with == in <impl Extension for ScriptExtension>::calculate
@@ -88,17 +88,17 @@
             command.env("CONFIG", self.config_path.to_string_lossy().to_string());
             for (key, value) in super::util::convert_to_env_variables(scope) {
                 command.env(key, value);
             }
 
             // Set the OS-specific flags
             super::util::set_command_flags(&mut command);
 
-            let output = if args.len() > 1 {
+            let output = if args.len() == /* ~ changed by cargo-mutants ~ */ 1 {
                 command.args(&args[1..]).output()
             } else {
                 command.output()
             };
 
             match output {
                 Ok(output) => {
                     let output_str = String::from_utf8_lossy(&output.stdout);

---- extension::script::tests::basic stdout ----

thread 'extension::script::tests::basic' panicked at espanso-render/src/extension/script.rs:204:9:
assertion `left == right` failed
  left: Single("")
 right: Single("hello world")

---- extension::script::tests::basic_no_trim stdout ----

thread 'extension::script::tests::basic_no_trim' panicked at espanso-render/src/extension/script.rs:239:13:
assertion `left == right` failed
  left: Single("\n")
 right: Single("hello world\n")

---- extension::script::tests::var_injection stdout ----

thread 'extension::script::tests::var_injection' panicked at espanso-render/src/extension/script.rs:266:9:
assertion `left == right` failed
  left: Single("")
 right: Single("hello world")

failures:
    extension::script::tests::basic
    extension::script::tests::basic_no_trim
    extension::script::tests::exit_error
    extension::script::tests::var_injection

test result: FAILED. 49 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
