*** espanso-render/src/extension/shell.rs:119:38: replace && with || in Shell::execute_cmd

*** mutation diff:
--- espanso-render/src/extension/shell.rs
+++ replace && with || in Shell::execute_cmd
@@ -111,17 +111,17 @@
 
         // If Espanso is executed as an app bundle on macOS, it doesn't inherit the
         // PATH environment variables that are available inside a terminal, and this
         // can be confusing for users.
         // For example, one might use "jq" inside the terminal but then it throws an
         // error with "command not found" if launched through the Espanso shell
         // extension. For this reason, Espanso tries to obtain the same PATH value by
         // spawning a login shell and extracting the PATH after the processing.
-        if cfg!(target_os = "macos") && override_path_on_macos {
+        if cfg!(target_os = "macos") || /* ~ changed by cargo-mutants ~ */ override_path_on_macos {
             let supported_mac_shell = match self {
                 Shell::Bash => Some(MacShell::Bash),
                 Shell::Nu => Some(MacShell::Nu),
                 Shell::Pwsh => Some(MacShell::Pwsh),
                 Shell::Sh => Some(MacShell::Sh),
                 Shell::Zsh => Some(MacShell::Zsh),
                 _ => None,
             };

*** result: Success
