*** espanso-render/src/extension/shell.rs:156:13: delete match arm

*** mutation diff:
--- espanso-render/src/extension/shell.rs
+++ delete match arm
@@ -148,17 +148,17 @@
             command.env("WSLENV", wsl_env);
         }
 
         command.output()
     }
 
     fn from_string(shell: &str) -> Option<Shell> {
         match shell {
-            "bash" => Some(Shell::Bash),
+             /* ~ changed by cargo-mutants ~ */
             "cmd" => Some(Shell::Cmd),
             "nu" => Some(Shell::Nu),
             "powershell" => Some(Shell::Powershell),
             "pwsh" => Some(Shell::Pwsh),
             "sh" => Some(Shell::Sh),
             "wsl" => Some(Shell::WSL),
             "wsl2" => Some(Shell::WSL2),
             "zsh" => Some(Shell::Zsh),

*** result: Success
