*** espanso-render/src/extension/shell.rs:159:13: delete match arm

*** mutation diff:
--- espanso-render/src/extension/shell.rs
+++ delete match arm
@@ -151,17 +151,17 @@
         command.output()
     }
 
     fn from_string(shell: &str) -> Option<Shell> {
         match shell {
             "bash" => Some(Shell::Bash),
             "cmd" => Some(Shell::Cmd),
             "nu" => Some(Shell::Nu),
-            "powershell" => Some(Shell::Powershell),
+             /* ~ changed by cargo-mutants ~ */
             "pwsh" => Some(Shell::Pwsh),
             "sh" => Some(Shell::Sh),
             "wsl" => Some(Shell::WSL),
             "wsl2" => Some(Shell::WSL2),
             "zsh" => Some(Shell::Zsh),
             _ => None,
         }
     }

*** result: Success
