*** espanso-render/src/extension/shell.rs:160:13: delete match arm

*** mutation diff:
--- espanso-render/src/extension/shell.rs
+++ delete match arm
@@ -152,17 +152,17 @@
     }
 
     fn from_string(shell: &str) -> Option<Shell> {
         match shell {
             "bash" => Some(Shell::Bash),
             "cmd" => Some(Shell::Cmd),
             "nu" => Some(Shell::Nu),
             "powershell" => Some(Shell::Powershell),
-            "pwsh" => Some(Shell::Pwsh),
+             /* ~ changed by cargo-mutants ~ */
             "sh" => Some(Shell::Sh),
             "wsl" => Some(Shell::WSL),
             "wsl2" => Some(Shell::WSL2),
             "zsh" => Some(Shell::Zsh),
             _ => None,
         }
     }
 }

*** result: Success
