*** espanso-render/src/extension/shell.rs:208:9: replace <impl Extension for ShellExtension>::name -> &'static str with ""

*** mutation diff:
--- espanso-render/src/extension/shell.rs
+++ replace <impl Extension for ShellExtension>::name -> &'static str with ""
@@ -200,17 +200,17 @@
         Self {
             config_path: config_path.to_owned(),
         }
     }
 }
 
 impl Extension for ShellExtension {
     fn name(&self) -> &'static str {
-        "shell"
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn calculate(
         &self,
         _: &crate::Context,
         scope: &crate::Scope,
         params: &Params,
     ) -> crate::ExtensionResult {

*** result: Success
