*** espanso-render/src/extension/util.rs:46:5: replace set_command_flags with ()

*** mutation diff:
--- espanso-render/src/extension/util.rs
+++ replace set_command_flags with ()
@@ -38,20 +38,17 @@
         }
     }
 
     output
 }
 
 #[cfg(target_os = "windows")]
 pub fn set_command_flags(command: &mut Command) {
-    use std::os::windows::process::CommandExt;
-    // Avoid showing the shell window
-    // See: https://github.com/espanso/espanso/issues/249
-    command.creation_flags(0x0800_0000);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(target_os = "windows"))]
 pub fn set_command_flags(_: &mut Command) {
     // NOOP on Linux and macOS
 }
 
 #[cfg(test)]

*** result: Success
