*** espanso-render/src/renderer/mod.rs:216:5: replace get_matching_template -> Option<&'a Template> with None

*** mutation diff:
--- espanso-render/src/renderer/mod.rs
+++ replace get_matching_template -> Option<&'a Template> with None
@@ -208,25 +208,17 @@
     }
 }
 
 fn get_matching_template<'a>(
     variable: &Variable,
     templates: &'a [&Template],
 ) -> Option<&'a Template> {
     // Find matching template
-    let id = variable.params.get("trigger")?;
-    if let Value::String(id) = id {
-        templates
-            .iter()
-            .find(|template| template.ids.contains(id))
-            .copied()
-    } else {
-        None
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn log_new_form_syntax_tip() {
     error!("");
     error!("TIP: This error might be happening because since version 2.1.0-alpha, Espanso changed");
     error!("the syntax to define form controls. Instead of `{{{{control}}}}` you need to use");
     error!("[[control]] (using square brackets instead of curly brackets).");
     error!("");

---- renderer::tests::nested_match stdout ----

thread 'renderer::tests::nested_match' panicked at espanso-render/src/renderer/mod.rs:675:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

failures:
    renderer::tests::nested_match

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
