*** espanso-render/src/renderer/mod.rs:74:45: replace == with != in <impl Renderer for DefaultRenderer<'_>>::render

*** mutation diff:
--- espanso-render/src/renderer/mod.rs
+++ replace == with != in <impl Renderer for DefaultRenderer<'_>>::render
@@ -66,17 +66,17 @@
                         .global_vars
                         .iter()
                         .map(|var| (&*var.name, *var))
                         .collect();
                     template
                         .vars
                         .iter()
                         .filter_map(|var| {
-                            if var.var_type == "global" {
+                            if var.var_type != /* ~ changed by cargo-mutants ~ */ "global" {
                                 global_vars.get(&*var.name).copied()
                             } else {
                                 Some(var)
                             }
                         })
                         .collect()
                 } else {
                     template.vars.iter().collect()

---- renderer::tests::global_variable_explicit_ordering stdout ----

thread 'renderer::tests::global_variable_explicit_ordering' panicked at espanso-render/src/renderer/mod.rs:511:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello Bob Bob")

---- renderer::tests::variable_injection_with_global_variable stdout ----

thread 'renderer::tests::variable_injection_with_global_variable' panicked at espanso-render/src/renderer/mod.rs:902:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello global")

failures:
    renderer::tests::global_variable_explicit_ordering
    renderer::tests::variable_injection_with_global_variable

test result: FAILED. 51 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
