*** espanso-render/src/renderer/mod.rs:99:38: replace == with != in <impl Renderer for DefaultRenderer<'_>>::render

*** mutation diff:
--- espanso-render/src/renderer/mod.rs
+++ replace == with != in <impl Renderer for DefaultRenderer<'_>>::render
@@ -91,17 +91,17 @@
             ) {
                 Ok(variables) => variables,
                 Err(err) => return RenderResult::Error(err),
             };
 
             // Compute the variable outputs
             let mut scope = Scope::new();
             for variable in variables {
-                if variable.var_type == "match" {
+                if variable.var_type != /* ~ changed by cargo-mutants ~ */ "match" {
                     // Recursive call
                     // Call render recursively
                     if let Some(sub_template) =
                         get_matching_template(variable, context.templates.as_slice())
                     {
                         match self.render(sub_template, context, options) {
                             RenderResult::Success(output) => {
                                 scope.insert(&variable.name, ExtensionOutput::Single(output));

---- renderer::tests::basic_variable stdout ----

thread 'renderer::tests::basic_variable' panicked at espanso-render/src/renderer/mod.rs:392:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

---- renderer::tests::dict_variable_variable stdout ----

thread 'renderer::tests::dict_variable_variable' panicked at espanso-render/src/renderer/mod.rs:414:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello dict")

---- renderer::tests::escaped_variable_injection stdout ----

thread 'renderer::tests::escaped_variable_injection' panicked at espanso-render/src/renderer/mod.rs:844:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello {{first}} two")

failures:
    renderer::tests::basic_variable
    renderer::tests::dict_variable_variable
    renderer::tests::disable_variable_injection
    renderer::tests::escaped_variable_injection
    renderer::tests::extension_aborting_propagates
    renderer::tests::global_dict_variable
    renderer::tests::global_variable
    renderer::tests::global_variable_depends_on
    renderer::tests::global_variable_explicit_ordering
    renderer::tests::local_variable_explicit_ordering
    renderer::tests::nested_global_variable
    renderer::tests::nested_match

test result: FAILED. 38 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
