*** espanso-render/src/renderer/resolve.rs:127:43: replace || with && in create_node_from_var

*** mutation diff:
--- espanso-render/src/renderer/resolve.rs
+++ replace || with && in create_node_from_var
@@ -119,17 +119,17 @@
     for node in local_vars_nodes {
         node_map.insert(node.name, node);
     }
 
     node_map
 }
 
 fn create_node_from_var(var: &Variable) -> Node {
-    let dependencies = if var.inject_vars || !var.depends_on.is_empty() {
+    let dependencies = if var.inject_vars && /* ~ changed by cargo-mutants ~ */ !var.depends_on.is_empty() {
         let mut vars = HashSet::new();
 
         if var.inject_vars {
             vars.extend(super::util::get_params_variable_names(&var.params));
         }
 
         vars.extend(var.depends_on.iter().map(String::as_str));

---- renderer::tests::nested_global_variable stdout ----

thread 'renderer::tests::nested_global_variable' panicked at espanso-render/src/renderer/mod.rs:545:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

failures:
    renderer::tests::nested_global_variable

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
