*** espanso-render/src/renderer/resolve.rs:127:46: delete ! in create_node_from_var

*** mutation diff:
--- espanso-render/src/renderer/resolve.rs
+++ delete ! in create_node_from_var
@@ -119,17 +119,17 @@
     for node in local_vars_nodes {
         node_map.insert(node.name, node);
     }
 
     node_map
 }
 
 fn create_node_from_var(var: &Variable) -> Node {
-    let dependencies = if var.inject_vars || !var.depends_on.is_empty() {
+    let dependencies = if var.inject_vars ||  /* ~ changed by cargo-mutants ~ */var.depends_on.is_empty() {
         let mut vars = HashSet::new();
 
         if var.inject_vars {
             vars.extend(super::util::get_params_variable_names(&var.params));
         }
 
         vars.extend(var.depends_on.iter().map(String::as_str));

*** result: Success
