*** espanso-render/src/renderer/resolve.rs:155:5: replace resolve_dependencies -> Result<()> with Ok(())

*** mutation diff:
--- espanso-render/src/renderer/resolve.rs
+++ replace resolve_dependencies -> Result<()> with Ok(())
@@ -147,57 +147,10 @@
 
 fn resolve_dependencies<'a>(
     node: &'a Node,
     node_map: &'a HashMap<&'a str, Node<'a>>,
     eval_order: &'a RefCell<Vec<&'a str>>,
     resolved: &'a RefCell<HashSet<&'a str>>,
     seen: &'a RefCell<HashSet<&'a str>>,
 ) -> Result<()> {
-    {
-        let mut seen_ref = seen.borrow_mut();
-        seen_ref.insert(node.name);
-    }
-
-    if let Some(dependencies) = &node.dependencies {
-        for dependency in dependencies {
-            let has_been_resolved = {
-                let resolved_ref = resolved.borrow();
-                resolved_ref.contains(dependency)
-            };
-            let has_been_seen = {
-                let seen_ref = seen.borrow();
-                seen_ref.contains(dependency)
-            };
-
-            if !has_been_resolved {
-                if has_been_seen {
-                    return Err(RendererError::CircularDependency(
-                        node.name.to_string(),
-                        (*dependency).to_string(),
-                    )
-                    .into());
-                }
-
-                if let Some(dependency_node) = node_map.get(dependency) {
-                    resolve_dependencies(dependency_node, node_map, eval_order, resolved, seen)?;
-                } else {
-                    error!("could not resolve variable {:?}", dependency);
-                    if let Some(variable) = &node.variable {
-                        if variable.var_type == "form" {
-                            super::log_new_form_syntax_tip();
-                        }
-                    }
-                    return Err(RendererError::MissingVariable((*dependency).to_string()).into());
-                }
-            }
-        }
-    }
-
-    {
-        let mut eval_order_ref = eval_order.borrow_mut();
-        eval_order_ref.push(node.name);
-        let mut resolved_ref = resolved.borrow_mut();
-        resolved_ref.insert(node.name);
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

---- renderer::tests::basic_variable stdout ----

thread 'renderer::tests::basic_variable' panicked at espanso-render/src/renderer/mod.rs:392:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

---- renderer::tests::dict_variable_variable stdout ----

thread 'renderer::tests::dict_variable_variable' panicked at espanso-render/src/renderer/mod.rs:414:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello dict")

---- renderer::tests::escaped_variable_injection stdout ----

thread 'renderer::tests::escaped_variable_injection' panicked at espanso-render/src/renderer/mod.rs:844:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello {{first}} two")

failures:
    renderer::tests::basic_variable
    renderer::tests::dict_variable_variable
    renderer::tests::disable_variable_injection
    renderer::tests::escaped_variable_injection
    renderer::tests::extension_aborting_propagates
    renderer::tests::global_dict_variable
    renderer::tests::global_variable
    renderer::tests::global_variable_depends_on
    renderer::tests::global_variable_explicit_ordering
    renderer::tests::local_variable_explicit_ordering
    renderer::tests::nested_global_variable
    renderer::tests::nested_match

test result: FAILED. 38 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
