*** espanso-render/src/renderer/resolve.rs:171:16: delete ! in resolve_dependencies

*** mutation diff:
--- espanso-render/src/renderer/resolve.rs
+++ delete ! in resolve_dependencies
@@ -163,17 +163,17 @@
                 let resolved_ref = resolved.borrow();
                 resolved_ref.contains(dependency)
             };
             let has_been_seen = {
                 let seen_ref = seen.borrow();
                 seen_ref.contains(dependency)
             };
 
-            if !has_been_resolved {
+            if  /* ~ changed by cargo-mutants ~ */has_been_resolved {
                 if has_been_seen {
                     return Err(RendererError::CircularDependency(
                         node.name.to_string(),
                         (*dependency).to_string(),
                     )
                     .into());
                 }

---- renderer::tests::basic_variable stdout ----

thread 'renderer::tests::basic_variable' panicked at espanso-render/src/renderer/mod.rs:392:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

---- renderer::tests::dict_variable_variable stdout ----

thread 'renderer::tests::dict_variable_variable' panicked at espanso-render/src/renderer/mod.rs:414:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello dict")

---- renderer::tests::escaped_variable_injection stdout ----

thread 'renderer::tests::escaped_variable_injection' panicked at espanso-render/src/renderer/mod.rs:844:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello {{first}} two")

failures:
    renderer::tests::basic_variable
    renderer::tests::dict_variable_variable
    renderer::tests::disable_variable_injection
    renderer::tests::escaped_variable_injection
    renderer::tests::extension_aborting_propagates
    renderer::tests::global_dict_variable
    renderer::tests::global_variable
    renderer::tests::global_variable_depends_on
    renderer::tests::global_variable_explicit_ordering
    renderer::tests::local_variable_explicit_ordering
    renderer::tests::nested_global_variable
    renderer::tests::nested_match

test result: FAILED. 38 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
