*** espanso-render/src/renderer/resolve.rs:185:46: replace == with != in resolve_dependencies

*** mutation diff:
--- espanso-render/src/renderer/resolve.rs
+++ replace == with != in resolve_dependencies
@@ -177,17 +177,17 @@
                     .into());
                 }
 
                 if let Some(dependency_node) = node_map.get(dependency) {
                     resolve_dependencies(dependency_node, node_map, eval_order, resolved, seen)?;
                 } else {
                     error!("could not resolve variable {:?}", dependency);
                     if let Some(variable) = &node.variable {
-                        if variable.var_type == "form" {
+                        if variable.var_type != /* ~ changed by cargo-mutants ~ */ "form" {
                             super::log_new_form_syntax_tip();
                         }
                     }
                     return Err(RendererError::MissingVariable((*dependency).to_string()).into());
                 }
             }
         }
     }

*** result: Success
