*** espanso-render/src/renderer/resolve.rs:43:5: replace resolve_evaluation_order -> Result<Vec<&'a Variable>> with Ok(vec![])

*** mutation diff:
--- espanso-render/src/renderer/resolve.rs
+++ replace resolve_evaluation_order -> Result<Vec<&'a Variable>> with Ok(vec![])
@@ -35,42 +35,17 @@
     dependencies: Option<HashSet<&'a str>>,
 }
 
 pub(crate) fn resolve_evaluation_order<'a>(
     body: &'a str,
     local_vars: &'a [&'a Variable],
     global_vars: &'a [&'a Variable],
 ) -> Result<Vec<&'a Variable>> {
-    let node_map = generate_nodes(body, local_vars, global_vars);
-
-    let body_node = node_map
-        .get("__match_body")
-        .ok_or_else(|| anyhow!("missing body node"))?;
-
-    let eval_order = RefCell::new(Vec::new());
-    let resolved = RefCell::new(HashSet::new());
-    let seen = RefCell::new(HashSet::new());
-    {
-        resolve_dependencies(body_node, &node_map, &eval_order, &resolved, &seen)?;
-    }
-
-    let eval_order_ref = eval_order.borrow();
-
-    let mut ordered_variables = Vec::new();
-    for var_name in &(*eval_order_ref) {
-        let node = node_map
-            .get(var_name)
-            .ok_or_else(|| anyhow!("could not find dependency node for variable: {}", var_name))?;
-        if let Some(var) = node.variable {
-            ordered_variables.push(var);
-        }
-    }
-
-    Ok(ordered_variables)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn generate_nodes<'a>(
     body: &'a str,
     local_vars: &'a [&'a Variable],
     global_vars: &'a [&'a Variable],
 ) -> HashMap<&'a str, Node<'a>> {
     let mut local_vars_nodes = Vec::new();

---- renderer::tests::basic_variable stdout ----

thread 'renderer::tests::basic_variable' panicked at espanso-render/src/renderer/mod.rs:392:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

---- renderer::tests::dict_variable_variable stdout ----

thread 'renderer::tests::dict_variable_variable' panicked at espanso-render/src/renderer/mod.rs:414:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello dict")

---- renderer::tests::escaped_variable_injection stdout ----

thread 'renderer::tests::escaped_variable_injection' panicked at espanso-render/src/renderer/mod.rs:844:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello {{first}} two")

failures:
    renderer::tests::basic_variable
    renderer::tests::dict_variable_variable
    renderer::tests::disable_variable_injection
    renderer::tests::escaped_variable_injection
    renderer::tests::extension_aborting_propagates
    renderer::tests::global_dict_variable
    renderer::tests::global_variable
    renderer::tests::global_variable_depends_on
    renderer::tests::global_variable_explicit_ordering
    renderer::tests::local_variable_explicit_ordering
    renderer::tests::nested_global_variable
    renderer::tests::nested_match

test result: FAILED. 38 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
