*** espanso-render/src/renderer/resolve.rs:86:18: replace > with == in generate_nodes

*** mutation diff:
--- espanso-render/src/renderer/resolve.rs
+++ replace > with == in generate_nodes
@@ -78,17 +78,17 @@
         let mut dependencies = HashSet::new();
         if var.inject_vars {
             dependencies.extend(super::util::get_params_variable_names(&var.params));
         }
         dependencies.extend(var.depends_on.iter().map(String::as_str));
 
         // Every local variable depends on the one before it.
         // Needed to guarantee execution order within local vars.
-        if index > 0 {
+        if index == /* ~ changed by cargo-mutants ~ */ 0 {
             let previous_var = local_vars.get(index - 1);
             if let Some(previous_var) = previous_var {
                 dependencies.insert(&previous_var.name);
             }
         }
 
         local_vars_nodes.push(Node {
             name: &var.name,

---- renderer::tests::basic_variable stdout ----

thread 'renderer::tests::basic_variable' panicked at espanso-render/src/renderer/resolve.rs:87:47:
attempt to subtract with overflow

---- renderer::tests::dict_variable_variable stdout ----

thread 'renderer::tests::dict_variable_variable' panicked at espanso-render/src/renderer/resolve.rs:87:47:
attempt to subtract with overflow

---- renderer::tests::escaped_variable_injection stdout ----

thread 'renderer::tests::escaped_variable_injection' panicked at espanso-render/src/renderer/resolve.rs:87:47:
attempt to subtract with overflow

failures:
    renderer::tests::basic_variable
    renderer::tests::dict_variable_variable
    renderer::tests::disable_variable_injection
    renderer::tests::escaped_variable_injection
    renderer::tests::extension_aborting_propagates
    renderer::tests::extension_error_propagates
    renderer::tests::global_variable_explicit_ordering
    renderer::tests::local_variable_explicit_ordering
    renderer::tests::missing_nested_match
    renderer::tests::nested_match
    renderer::tests::variable_injection
    renderer::tests::variable_injection_local_var_takes_precedence_over_global

test result: FAILED. 39 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.32s

*** result: Failure(101)
