*** espanso-render/src/renderer/resolve.rs:86:18: replace > with < in generate_nodes

*** mutation diff:
--- espanso-render/src/renderer/resolve.rs
+++ replace > with < in generate_nodes
@@ -78,17 +78,17 @@
         let mut dependencies = HashSet::new();
         if var.inject_vars {
             dependencies.extend(super::util::get_params_variable_names(&var.params));
         }
         dependencies.extend(var.depends_on.iter().map(String::as_str));
 
         // Every local variable depends on the one before it.
         // Needed to guarantee execution order within local vars.
-        if index > 0 {
+        if index < /* ~ changed by cargo-mutants ~ */ 0 {
             let previous_var = local_vars.get(index - 1);
             if let Some(previous_var) = previous_var {
                 dependencies.insert(&previous_var.name);
             }
         }
 
         local_vars_nodes.push(Node {
             name: &var.name,

---- renderer::tests::global_variable_explicit_ordering stdout ----

thread 'renderer::tests::global_variable_explicit_ordering' panicked at espanso-render/src/renderer/mod.rs:511:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello Bob Bob")

failures:
    renderer::tests::global_variable_explicit_ordering

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
