*** espanso-render/src/renderer/resolve.rs:87:53: replace - with / in generate_nodes

*** mutation diff:
--- espanso-render/src/renderer/resolve.rs
+++ replace - with / in generate_nodes
@@ -79,17 +79,17 @@
         if var.inject_vars {
             dependencies.extend(super::util::get_params_variable_names(&var.params));
         }
         dependencies.extend(var.depends_on.iter().map(String::as_str));
 
         // Every local variable depends on the one before it.
         // Needed to guarantee execution order within local vars.
         if index > 0 {
-            let previous_var = local_vars.get(index - 1);
+            let previous_var = local_vars.get(index / /* ~ changed by cargo-mutants ~ */ 1);
             if let Some(previous_var) = previous_var {
                 dependencies.insert(&previous_var.name);
             }
         }
 
         local_vars_nodes.push(Node {
             name: &var.name,
             variable: Some(var),

---- renderer::tests::escaped_variable_injection stdout ----

thread 'renderer::tests::escaped_variable_injection' panicked at espanso-render/src/renderer/mod.rs:844:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello {{first}} two")

---- renderer::tests::disable_variable_injection stdout ----

thread 'renderer::tests::disable_variable_injection' panicked at espanso-render/src/renderer/mod.rs:815:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello {{first}} two")

---- renderer::tests::global_variable_explicit_ordering stdout ----

thread 'renderer::tests::global_variable_explicit_ordering' panicked at espanso-render/src/renderer/mod.rs:511:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello Bob Bob")

failures:
    renderer::tests::disable_variable_injection
    renderer::tests::escaped_variable_injection
    renderer::tests::global_variable_explicit_ordering
    renderer::tests::variable_injection
    renderer::tests::variable_injection_local_var_takes_precedence_over_global
    renderer::tests::variable_injection_with_global_variable

test result: FAILED. 47 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
