*** espanso-render/src/renderer/resolve.rs:87:53: replace - with + in generate_nodes

*** mutation diff:
--- espanso-render/src/renderer/resolve.rs
+++ replace - with + in generate_nodes
@@ -79,17 +79,17 @@
         if var.inject_vars {
             dependencies.extend(super::util::get_params_variable_names(&var.params));
         }
         dependencies.extend(var.depends_on.iter().map(String::as_str));
 
         // Every local variable depends on the one before it.
         // Needed to guarantee execution order within local vars.
         if index > 0 {
-            let previous_var = local_vars.get(index - 1);
+            let previous_var = local_vars.get(index + /* ~ changed by cargo-mutants ~ */ 1);
             if let Some(previous_var) = previous_var {
                 dependencies.insert(&previous_var.name);
             }
         }
 
         local_vars_nodes.push(Node {
             name: &var.name,
             variable: Some(var),

---- renderer::tests::variable_injection stdout ----

thread 'renderer::tests::variable_injection' panicked at espanso-render/src/renderer/mod.rs:785:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello John Snow")

failures:
    renderer::tests::variable_injection

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
