*** espanso-render/src/renderer/util.rs:109:5: replace unescape_variable_inections -> String with "xyzzy".into()

*** mutation diff:
--- espanso-render/src/renderer/util.rs
+++ replace unescape_variable_inections -> String with "xyzzy".into()
@@ -101,17 +101,17 @@
         return Err(error.into());
     }
 
     let unescaped_output = unescape_variable_inections(&output);
     Ok(unescaped_output)
 }
 
 pub(crate) fn unescape_variable_inections(body: &str) -> String {
-    body.replace("\\{\\{", "{{").replace("\\}\\}", "}}")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn inject_variables_into_params(params: &Params, scope: &Scope) -> Result<Params> {
     let mut params = params.clone();
 
     for value in &mut params.values_mut() {
         inject_variables_into_value(value, scope)?;
     }

---- renderer::tests::basic_variable stdout ----

thread 'renderer::tests::basic_variable' panicked at espanso-render/src/renderer/mod.rs:392:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

---- renderer::tests::dict_variable_variable stdout ----

thread 'renderer::tests::dict_variable_variable' panicked at espanso-render/src/renderer/mod.rs:414:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello dict")

---- renderer::tests::escaped_variable_injection stdout ----

thread 'renderer::tests::escaped_variable_injection' panicked at espanso-render/src/renderer/mod.rs:844:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello {{first}} two")

failures:
    renderer::tests::basic_variable
    renderer::tests::dict_variable_variable
    renderer::tests::disable_variable_injection
    renderer::tests::escaped_variable_injection
    renderer::tests::global_dict_variable
    renderer::tests::global_variable
    renderer::tests::global_variable_explicit_ordering
    renderer::tests::nested_global_variable
    renderer::tests::nested_match
    renderer::tests::no_variable_capitalize
    renderer::tests::no_variable_capitalize_words
    renderer::tests::no_variable_no_styling

test result: FAILED. 35 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
