*** espanso-render/src/renderer/util.rs:113:5: replace inject_variables_into_params -> Result<Params> with Ok(Default::default())

*** mutation diff:
--- espanso-render/src/renderer/util.rs
+++ replace inject_variables_into_params -> Result<Params> with Ok(Default::default())
@@ -105,23 +105,17 @@
     Ok(unescaped_output)
 }
 
 pub(crate) fn unescape_variable_inections(body: &str) -> String {
     body.replace("\\{\\{", "{{").replace("\\}\\}", "}}")
 }
 
 pub(crate) fn inject_variables_into_params(params: &Params, scope: &Scope) -> Result<Params> {
-    let mut params = params.clone();
-
-    for value in &mut params.values_mut() {
-        inject_variables_into_value(value, scope)?;
-    }
-
-    Ok(params)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn inject_variables_into_value(value: &mut Value, scope: &Scope) -> Result<()> {
     match value {
         Value::String(s_value) => {
             let new_value = render_variables(s_value, scope)?;
 
             if &new_value != s_value {

---- renderer::tests::basic_variable stdout ----

thread 'renderer::tests::basic_variable' panicked at espanso-render/src/renderer/mod.rs:392:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

---- renderer::tests::disable_variable_injection stdout ----

thread 'renderer::tests::disable_variable_injection' panicked at espanso-render/src/renderer/mod.rs:815:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello {{first}} two")

---- renderer::tests::escaped_variable_injection stdout ----

thread 'renderer::tests::escaped_variable_injection' panicked at espanso-render/src/renderer/mod.rs:844:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello {{first}} two")

failures:
    renderer::tests::basic_variable
    renderer::tests::dict_variable_variable
    renderer::tests::disable_variable_injection
    renderer::tests::escaped_variable_injection
    renderer::tests::extension_error_propagates
    renderer::tests::global_dict_variable
    renderer::tests::global_variable
    renderer::tests::global_variable_explicit_ordering
    renderer::tests::nested_global_variable
    renderer::tests::variable_injection
    renderer::tests::variable_injection_local_var_takes_precedence_over_global
    renderer::tests::variable_injection_with_global_variable

test result: FAILED. 40 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
