*** espanso-render/src/renderer/util.rs:127:27: replace != with == in inject_variables_into_value

*** mutation diff:
--- espanso-render/src/renderer/util.rs
+++ replace != with == in inject_variables_into_value
@@ -119,17 +119,17 @@
     Ok(params)
 }
 
 fn inject_variables_into_value(value: &mut Value, scope: &Scope) -> Result<()> {
     match value {
         Value::String(s_value) => {
             let new_value = render_variables(s_value, scope)?;
 
-            if &new_value != s_value {
+            if &new_value == /* ~ changed by cargo-mutants ~ */ s_value {
                 s_value.clear();
                 s_value.push_str(&new_value);
             }
         }
         Value::Array(values) => {
             for value in values {
                 inject_variables_into_value(value, scope)?;
             }

---- renderer::tests::nested_global_variable stdout ----

thread 'renderer::tests::nested_global_variable' panicked at espanso-render/src/renderer/mod.rs:545:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

---- renderer::tests::variable_injection stdout ----

thread 'renderer::tests::variable_injection' panicked at espanso-render/src/renderer/mod.rs:785:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello John Snow")

---- renderer::tests::variable_injection_local_var_takes_precedence_over_global stdout ----

thread 'renderer::tests::variable_injection_local_var_takes_precedence_over_global' panicked at espanso-render/src/renderer/mod.rs:946:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello local")

failures:
    renderer::tests::nested_global_variable
    renderer::tests::variable_injection
    renderer::tests::variable_injection_local_var_takes_precedence_over_global
    renderer::tests::variable_injection_with_global_variable
    renderer::util::tests::test_inject_variables_into_params

test result: FAILED. 48 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.53s

*** result: Failure(101)
