*** espanso-render/src/renderer/util.rs:132:9: delete match arm

*** mutation diff:
--- espanso-render/src/renderer/util.rs
+++ delete match arm
@@ -124,21 +124,17 @@
         Value::String(s_value) => {
             let new_value = render_variables(s_value, scope)?;
 
             if &new_value != s_value {
                 s_value.clear();
                 s_value.push_str(&new_value);
             }
         }
-        Value::Array(values) => {
-            for value in values {
-                inject_variables_into_value(value, scope)?;
-            }
-        }
+         /* ~ changed by cargo-mutants ~ */
         Value::Object(fields) => {
             for value in fields.values_mut() {
                 inject_variables_into_value(value, scope)?;
             }
         }
         _ => {}
     }

---- renderer::util::tests::test_inject_variables_into_params stdout ----

thread 'renderer::util::tests::test_inject_variables_into_params' panicked at espanso-render/src/renderer/util.rs:196:9:
assertion `left == right` failed
  left: Array([String("this contains {{first}}")])
 right: Array([String("this contains one")])

failures:
    renderer::util::tests::test_inject_variables_into_params

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.55s

*** result: Failure(101)
