*** espanso-render/src/renderer/util.rs:137:9: delete match arm

*** mutation diff:
--- espanso-render/src/renderer/util.rs
+++ delete match arm
@@ -129,21 +129,17 @@
                 s_value.push_str(&new_value);
             }
         }
         Value::Array(values) => {
             for value in values {
                 inject_variables_into_value(value, scope)?;
             }
         }
-        Value::Object(fields) => {
-            for value in fields.values_mut() {
-                inject_variables_into_value(value, scope)?;
-            }
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => {}
     }
 
     Ok(())
 }
 
 #[cfg(test)]
 mod tests {

---- renderer::util::tests::test_inject_variables_into_params stdout ----

thread 'renderer::util::tests::test_inject_variables_into_params' panicked at espanso-render/src/renderer/util.rs:200:9:
assertion failed: matches!(result.get("field4").unwrap(), Value::Object(fields) if
    fields.get("subfield1").unwrap() ==
    &Value::String("also contains one".to_string()))

failures:
    renderer::util::tests::test_inject_variables_into_params

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
