*** espanso-render/src/renderer/util.rs:29:5: replace get_body_variable_names -> HashSet<&str> with HashSet::new()

*** mutation diff:
--- espanso-render/src/renderer/util.rs
+++ replace get_body_variable_names -> HashSet<&str> with HashSet::new()
@@ -21,22 +21,17 @@
 use anyhow::Result;
 use log::error;
 use regex::Captures;
 
 use super::VAR_REGEX;
 use std::collections::HashSet;
 
 pub(crate) fn get_body_variable_names(body: &str) -> HashSet<&str> {
-    let mut variables = HashSet::new();
-    for caps in VAR_REGEX.captures_iter(body) {
-        let var_name = caps.name("name").unwrap().as_str();
-        variables.insert(var_name);
-    }
-    variables
+    HashSet::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn get_params_variable_names(params: &Params) -> HashSet<&str> {
     let mut names = HashSet::new();
 
     for value in params.values() {
         let local_names = get_value_variable_names_recursively(value);
         names.extend(local_names);

---- renderer::tests::global_dict_variable stdout ----

thread 'renderer::tests::global_dict_variable' panicked at espanso-render/src/renderer/mod.rs:470:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello dict")

---- renderer::tests::global_variable stdout ----

thread 'renderer::tests::global_variable' panicked at espanso-render/src/renderer/mod.rs:445:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

---- renderer::tests::global_variable_depends_on stdout ----

thread 'renderer::tests::global_variable_depends_on' panicked at espanso-render/src/renderer/mod.rs:620:9:
assertion failed: matches!(res, RenderResult::Aborted)

failures:
    renderer::tests::global_dict_variable
    renderer::tests::global_variable
    renderer::tests::global_variable_depends_on
    renderer::tests::nested_global_variable
    renderer::util::tests::get_body_variable_names_multiple_vars

test result: FAILED. 48 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
