*** espanso-render/src/renderer/util.rs:29:5: replace get_body_variable_names -> HashSet<&str> with HashSet::from_iter([""])

*** mutation diff:
--- espanso-render/src/renderer/util.rs
+++ replace get_body_variable_names -> HashSet<&str> with HashSet::from_iter([""])
@@ -21,22 +21,17 @@
 use anyhow::Result;
 use log::error;
 use regex::Captures;
 
 use super::VAR_REGEX;
 use std::collections::HashSet;
 
 pub(crate) fn get_body_variable_names(body: &str) -> HashSet<&str> {
-    let mut variables = HashSet::new();
-    for caps in VAR_REGEX.captures_iter(body) {
-        let var_name = caps.name("name").unwrap().as_str();
-        variables.insert(var_name);
-    }
-    variables
+    HashSet::from_iter([""]) /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn get_params_variable_names(params: &Params) -> HashSet<&str> {
     let mut names = HashSet::new();
 
     for value in params.values() {
         let local_names = get_value_variable_names_recursively(value);
         names.extend(local_names);

---- renderer::tests::basic_variable stdout ----

thread 'renderer::tests::basic_variable' panicked at espanso-render/src/renderer/mod.rs:392:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

---- renderer::tests::dict_variable_variable stdout ----

thread 'renderer::tests::dict_variable_variable' panicked at espanso-render/src/renderer/mod.rs:414:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello dict")

---- renderer::tests::escaped_variable_injection stdout ----

thread 'renderer::tests::escaped_variable_injection' panicked at espanso-render/src/renderer/mod.rs:844:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello {{first}} two")

failures:
    renderer::tests::basic_variable
    renderer::tests::dict_variable_variable
    renderer::tests::disable_variable_injection
    renderer::tests::escaped_variable_injection
    renderer::tests::extension_aborting_propagates
    renderer::tests::global_dict_variable
    renderer::tests::global_variable
    renderer::tests::global_variable_depends_on
    renderer::tests::global_variable_explicit_ordering
    renderer::tests::local_variable_explicit_ordering
    renderer::tests::nested_global_variable
    renderer::tests::nested_match

test result: FAILED. 36 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.52s

*** result: Failure(101)
