*** espanso-render/src/renderer/util.rs:38:5: replace get_params_variable_names -> HashSet<&str> with HashSet::new()

*** mutation diff:
--- espanso-render/src/renderer/util.rs
+++ replace get_params_variable_names -> HashSet<&str> with HashSet::new()
@@ -30,24 +30,17 @@
     for caps in VAR_REGEX.captures_iter(body) {
         let var_name = caps.name("name").unwrap().as_str();
         variables.insert(var_name);
     }
     variables
 }
 
 pub(crate) fn get_params_variable_names(params: &Params) -> HashSet<&str> {
-    let mut names = HashSet::new();
-
-    for value in params.values() {
-        let local_names = get_value_variable_names_recursively(value);
-        names.extend(local_names);
-    }
-
-    names
+    HashSet::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_value_variable_names_recursively(value: &Value) -> HashSet<&str> {
     match value {
         Value::String(s_value) => get_body_variable_names(s_value),
         Value::Array(values) => {
             let mut local_names: HashSet<&str> = HashSet::new();
             for value in values {

---- renderer::tests::nested_global_variable stdout ----

thread 'renderer::tests::nested_global_variable' panicked at espanso-render/src/renderer/mod.rs:545:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

failures:
    renderer::tests::nested_global_variable

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
