*** espanso-render/src/renderer/util.rs:49:5: replace get_value_variable_names_recursively -> HashSet<&str> with HashSet::from_iter(["xyzzy"])

*** mutation diff:
--- espanso-render/src/renderer/util.rs
+++ replace get_value_variable_names_recursively -> HashSet<&str> with HashSet::from_iter(["xyzzy"])
@@ -41,34 +41,17 @@
         let local_names = get_value_variable_names_recursively(value);
         names.extend(local_names);
     }
 
     names
 }
 
 fn get_value_variable_names_recursively(value: &Value) -> HashSet<&str> {
-    match value {
-        Value::String(s_value) => get_body_variable_names(s_value),
-        Value::Array(values) => {
-            let mut local_names: HashSet<&str> = HashSet::new();
-            for value in values {
-                local_names.extend(get_value_variable_names_recursively(value));
-            }
-            local_names
-        }
-        Value::Object(fields) => {
-            let mut local_names: HashSet<&str> = HashSet::new();
-            for value in fields.values() {
-                local_names.extend(get_value_variable_names_recursively(value));
-            }
-            local_names
-        }
-        _ => HashSet::new(),
-    }
+    HashSet::from_iter(["xyzzy"]) /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn render_variables(body: &str, scope: &Scope) -> Result<String> {
     let mut replacing_error = None;
     let output = VAR_REGEX
         .replace_all(body, |caps: &Captures| {
             let var_name = caps.name("name").unwrap().as_str();
             let var_subname = caps.name("subname");

---- renderer::tests::basic_variable stdout ----

thread 'renderer::tests::basic_variable' panicked at espanso-render/src/renderer/mod.rs:392:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

---- renderer::tests::dict_variable_variable stdout ----

thread 'renderer::tests::dict_variable_variable' panicked at espanso-render/src/renderer/mod.rs:414:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello dict")

---- renderer::tests::escaped_variable_injection stdout ----

thread 'renderer::tests::escaped_variable_injection' panicked at espanso-render/src/renderer/mod.rs:844:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello {{first}} two")

failures:
    renderer::tests::basic_variable
    renderer::tests::dict_variable_variable
    renderer::tests::disable_variable_injection
    renderer::tests::escaped_variable_injection
    renderer::tests::extension_aborting_propagates
    renderer::tests::global_dict_variable
    renderer::tests::global_variable
    renderer::tests::global_variable_depends_on
    renderer::tests::global_variable_explicit_ordering
    renderer::tests::local_variable_explicit_ordering
    renderer::tests::nested_global_variable
    renderer::tests::nested_match

test result: FAILED. 38 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
