*** espanso-render/src/renderer/util.rs:50:9: delete match arm

*** mutation diff:
--- espanso-render/src/renderer/util.rs
+++ delete match arm
@@ -42,17 +42,17 @@
         names.extend(local_names);
     }
 
     names
 }
 
 fn get_value_variable_names_recursively(value: &Value) -> HashSet<&str> {
     match value {
-        Value::String(s_value) => get_body_variable_names(s_value),
+         /* ~ changed by cargo-mutants ~ */
         Value::Array(values) => {
             let mut local_names: HashSet<&str> = HashSet::new();
             for value in values {
                 local_names.extend(get_value_variable_names_recursively(value));
             }
             local_names
         }
         Value::Object(fields) => {

---- renderer::tests::nested_global_variable stdout ----

thread 'renderer::tests::nested_global_variable' panicked at espanso-render/src/renderer/mod.rs:545:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

failures:
    renderer::tests::nested_global_variable

test result: FAILED. 52 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.79s

*** result: Failure(101)
