*** espanso-render/src/renderer/util.rs:51:9: delete match arm

*** mutation diff:
--- espanso-render/src/renderer/util.rs
+++ delete match arm
@@ -43,23 +43,17 @@
     }
 
     names
 }
 
 fn get_value_variable_names_recursively(value: &Value) -> HashSet<&str> {
     match value {
         Value::String(s_value) => get_body_variable_names(s_value),
-        Value::Array(values) => {
-            let mut local_names: HashSet<&str> = HashSet::new();
-            for value in values {
-                local_names.extend(get_value_variable_names_recursively(value));
-            }
-            local_names
-        }
+         /* ~ changed by cargo-mutants ~ */
         Value::Object(fields) => {
             let mut local_names: HashSet<&str> = HashSet::new();
             for value in fields.values() {
                 local_names.extend(get_value_variable_names_recursively(value));
             }
             local_names
         }
         _ => HashSet::new(),

*** result: Success
