*** espanso-render/src/renderer/util.rs:58:9: delete match arm

*** mutation diff:
--- espanso-render/src/renderer/util.rs
+++ delete match arm
@@ -50,23 +50,17 @@
         Value::String(s_value) => get_body_variable_names(s_value),
         Value::Array(values) => {
             let mut local_names: HashSet<&str> = HashSet::new();
             for value in values {
                 local_names.extend(get_value_variable_names_recursively(value));
             }
             local_names
         }
-        Value::Object(fields) => {
-            let mut local_names: HashSet<&str> = HashSet::new();
-            for value in fields.values() {
-                local_names.extend(get_value_variable_names_recursively(value));
-            }
-            local_names
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => HashSet::new(),
     }
 }
 
 pub(crate) fn render_variables(body: &str, scope: &Scope) -> Result<String> {
     let mut replacing_error = None;
     let output = VAR_REGEX
         .replace_all(body, |caps: &Captures| {

*** result: Success
