*** espanso-render/src/renderer/util.rs:70:5: replace render_variables -> Result<String> with Ok("xyzzy".into())

*** mutation diff:
--- espanso-render/src/renderer/util.rs
+++ replace render_variables -> Result<String> with Ok("xyzzy".into())
@@ -62,52 +62,17 @@
             }
             local_names
         }
         _ => HashSet::new(),
     }
 }
 
 pub(crate) fn render_variables(body: &str, scope: &Scope) -> Result<String> {
-    let mut replacing_error = None;
-    let output = VAR_REGEX
-        .replace_all(body, |caps: &Captures| {
-            let var_name = caps.name("name").unwrap().as_str();
-            let var_subname = caps.name("subname");
-            if let Some(output) = scope.get(var_name) {
-                match output {
-                    ExtensionOutput::Single(output) => output,
-                    ExtensionOutput::Multiple(results) => {
-                        if let Some(var_subname) = var_subname {
-                            let var_subname = var_subname.as_str();
-                            results.get(var_subname).map_or("", |value| value)
-                        } else {
-                            error!("nested name missing from multi-value variable: {var_name}");
-                            replacing_error = Some(RendererError::MissingVariable(format!(
-                                "nested name missing from multi-value variable: {var_name}"
-                            )));
-                            ""
-                        }
-                    }
-                }
-            } else {
-                replacing_error = Some(RendererError::MissingVariable(format!(
-                    "variable '{var_name}' is missing"
-                )));
-                ""
-            }
-        })
-        .to_string();
-
-    if let Some(error) = replacing_error {
-        return Err(error.into());
-    }
-
-    let unescaped_output = unescape_variable_inections(&output);
-    Ok(unescaped_output)
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn unescape_variable_inections(body: &str) -> String {
     body.replace("\\{\\{", "{{").replace("\\}\\}", "}}")
 }
 
 pub(crate) fn inject_variables_into_params(params: &Params, scope: &Scope) -> Result<Params> {
     let mut params = params.clone();

---- renderer::tests::basic_variable stdout ----

thread 'renderer::tests::basic_variable' panicked at espanso-render/src/renderer/mod.rs:392:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello world")

---- renderer::tests::dict_variable_variable stdout ----

thread 'renderer::tests::dict_variable_variable' panicked at espanso-render/src/renderer/mod.rs:414:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello dict")

---- renderer::tests::escaped_variable_injection stdout ----

thread 'renderer::tests::escaped_variable_injection' panicked at espanso-render/src/renderer/mod.rs:844:9:
assertion failed: matches!(res, RenderResult::Success(str) if str == "hello {{first}} two")

failures:
    renderer::tests::basic_variable
    renderer::tests::dict_variable_variable
    renderer::tests::disable_variable_injection
    renderer::tests::escaped_variable_injection
    renderer::tests::global_dict_variable
    renderer::tests::global_variable
    renderer::tests::global_variable_explicit_ordering
    renderer::tests::nested_global_variable
    renderer::tests::nested_match
    renderer::tests::variable_injection
    renderer::tests::variable_injection_local_var_takes_precedence_over_global
    renderer::tests::variable_injection_with_global_variable

test result: FAILED. 40 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
