*** espanso-ui/src/lib.rs:68:5: replace create_ui -> Result<(Box<dyn UIRemote>, Box<dyn UIEventLoop>)> with Ok((Box::new(Default::default()), Box::new(Default::default())))

*** mutation diff:
--- espanso-ui/src/lib.rs
+++ replace create_ui -> Result<(Box<dyn UIRemote>, Box<dyn UIEventLoop>)> with Ok((Box::new(Default::default()), Box::new(Default::default())))
@@ -60,24 +60,17 @@
             icon_paths: Vec::new(),
             notification_icon_path: None,
         }
     }
 }
 
 #[cfg(target_os = "windows")]
 pub fn create_ui(options: UIOptions) -> Result<(Box<dyn UIRemote>, Box<dyn UIEventLoop>)> {
-    let (remote, eventloop) = win32::create(win32::Win32UIOptions {
-        show_icon: options.show_icon,
-        icon_paths: &options.icon_paths,
-        notification_icon_path: options
-            .notification_icon_path
-            .ok_or_else(|| UIError::MissingOption("notification icon".to_string()))?,
-    })?;
-    Ok((Box::new(remote), Box::new(eventloop)))
+    Ok((Box::new(Default::default()), Box::new(Default::default()))) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "macos")]
 pub fn create_ui(options: UIOptions) -> Result<(Box<dyn UIRemote>, Box<dyn UIEventLoop>)> {
     let (remote, eventloop) = mac::create(mac::MacUIOptions {
         show_icon: options.show_icon,
         icon_paths: &options.icon_paths,
     })?;

*** result: Success
