*** espanso-ui/src/lib.rs:89:5: replace create_ui -> Result<(Box<dyn UIRemote>, Box<dyn UIEventLoop>)> with Ok((Box::new(Default::default()), Box::new(Default::default())))

*** mutation diff:
--- espanso-ui/src/lib.rs
+++ replace create_ui -> Result<(Box<dyn UIRemote>, Box<dyn UIEventLoop>)> with Ok((Box::new(Default::default()), Box::new(Default::default())))
@@ -81,21 +81,16 @@
         show_icon: options.show_icon,
         icon_paths: &options.icon_paths,
     })?;
     Ok((Box::new(remote), Box::new(eventloop)))
 }
 
 #[cfg(target_os = "linux")]
 pub fn create_ui(options: UIOptions) -> Result<(Box<dyn UIRemote>, Box<dyn UIEventLoop>)> {
-    let (remote, eventloop) = linux::create(linux::LinuxUIOptions {
-        notification_icon_path: options
-            .notification_icon_path
-            .ok_or_else(|| UIError::MissingOption("notification icon".to_string()))?,
-    });
-    Ok((Box::new(remote), Box::new(eventloop)))
+    Ok((Box::new(Default::default()), Box::new(Default::default()))) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Error, Debug)]
 pub enum UIError {
     #[error("missing required option for ui: `{0}`")]
     MissingOption(String),
 }

*** result: Success
