*** espanso-ui/src/linux/mod.rs:104:9: replace <impl UIEventLoop for LinuxEventLoop>::run -> Result<()> with Ok(())

*** mutation diff:
--- espanso-ui/src/linux/mod.rs
+++ replace <impl UIEventLoop for LinuxEventLoop>::run -> Result<()> with Ok(())
@@ -96,31 +96,11 @@
 
 impl UIEventLoop for LinuxEventLoop {
     fn initialize(&mut self) -> Result<()> {
         // NOOP on linux
         Ok(())
     }
 
     fn run(&self, callback: crate::UIEventCallback) -> Result<()> {
-        loop {
-            select! {
-              recv(self.rx) -> result => {
-                // We don't run an event loop on Linux as there is no tray icon or application window needed.
-                // Thad said, we still need a way to block this method, and thus we use a channel
-                match result {
-                  Ok(()) => {
-                    // remote.exit() called
-                    return Ok(());
-                  }
-                  Err(error) => {
-                    error!("Unable to block the LinuxEventLoop: {}", error);
-                    return Err(error.into());
-                  }
-                }
-              },
-              default(Duration::from_millis(1000)) => {
-                (*callback)(UIEvent::Heartbeat);
-              }
-            }
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
