*** espanso-ui/src/mac/mod.rs:116:66: replace - with + in <impl UIEventLoop for MacEventLoop>::initialize

*** mutation diff:
--- espanso-ui/src/mac/mod.rs
+++ replace - with + in <impl UIEventLoop for MacEventLoop>::initialize
@@ -108,17 +108,17 @@
 
 impl UIEventLoop for MacEventLoop {
     fn initialize(&mut self) -> Result<()> {
         // Convert the icon paths to the raw representation
         let mut icon_paths: [[u8; MAX_FILE_PATH]; MAX_ICON_COUNT] =
             [[0; MAX_FILE_PATH]; MAX_ICON_COUNT];
         for (i, icon_path) in icon_paths.iter_mut().enumerate().take(self.icons.len()) {
             let c_path = CString::new(self.icons[i].clone())?;
-            let len = min(c_path.as_bytes().len(), MAX_FILE_PATH - 1);
+            let len = min(c_path.as_bytes().len(), MAX_FILE_PATH + /* ~ changed by cargo-mutants ~ */ 1);
             icon_path[0..len].clone_from_slice(&c_path.as_bytes()[..len]);
         }
 
         let options = RawUIOptions {
             show_icon: i32::from(self.show_icon),
             icon_paths,
             icon_paths_count: self.icons.len() as i32,
         };

*** result: Success
