*** espanso-ui/src/mac/mod.rs:228:13: delete match arm

*** mutation diff:
--- espanso-ui/src/mac/mod.rs
+++ delete match arm
@@ -220,19 +220,17 @@
     fn exit(&self) {
         unsafe { ui_exit() };
     }
 }
 
 impl From<RawUIEvent> for Option<UIEvent> {
     fn from(raw: RawUIEvent) -> Option<UIEvent> {
         match raw.event_type {
-            UI_EVENT_TYPE_ICON_CLICK => {
-                return Some(UIEvent::TrayIconClick);
-            }
+             /* ~ changed by cargo-mutants ~ */
             UI_EVENT_TYPE_CONTEXT_MENU_CLICK => {
                 return Some(UIEvent::ContextMenuClick(raw.context_menu_id));
             }
             UI_EVENT_TYPE_HEARTBEAT => {
                 return Some(UIEvent::Heartbeat);
             }
             _ => {}
         }

*** result: Success
