*** espanso-ui/src/mac/mod.rs:234:13: delete match arm

*** mutation diff:
--- espanso-ui/src/mac/mod.rs
+++ delete match arm
@@ -226,19 +226,17 @@
     fn from(raw: RawUIEvent) -> Option<UIEvent> {
         match raw.event_type {
             UI_EVENT_TYPE_ICON_CLICK => {
                 return Some(UIEvent::TrayIconClick);
             }
             UI_EVENT_TYPE_CONTEXT_MENU_CLICK => {
                 return Some(UIEvent::ContextMenuClick(raw.context_menu_id));
             }
-            UI_EVENT_TYPE_HEARTBEAT => {
-                return Some(UIEvent::Heartbeat);
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {}
         }
 
         None
     }
 }
 
 #[derive(Error, Debug)]

*** result: Success
