*** espanso-ui/src/menu.rs:30:9: replace Menu::to_json -> Result<String> with Ok("xyzzy".into())

*** mutation diff:
--- espanso-ui/src/menu.rs
+++ replace Menu::to_json -> Result<String> with Ok("xyzzy".into())
@@ -22,17 +22,17 @@
 
 #[derive(Debug)]
 pub struct Menu {
     pub items: Vec<MenuItem>,
 }
 
 impl Menu {
     pub fn to_json(&self) -> Result<String> {
-        Ok(serde_json::to_string(&self.items)?)
+        Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Serialize, Deserialize, Debug)]
 #[serde(tag = "type")]
 #[serde(rename_all = "snake_case")]
 pub enum MenuItem {
     Simple(SimpleMenuItem),

---- menu::tests::test_context_menu_serializes_correctly stdout ----

thread 'menu::tests::test_context_menu_serializes_correctly' panicked at espanso-ui/src/menu.rs:84:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "[{\"type\":\"simple\",\"id\":0,\"label\":\"Open\"},{\"type\":\"separator\"},{\"type\":\"sub\",\"label\":\"Sub\",\"items\":[{\"type\":\"simple\",\"id\":1,\"label\":\"Sub 1\"},{\"type\":\"simple\",\"id\":2,\"label\":\"Sub 2\"}]}]"

failures:
    menu::tests::test_context_menu_serializes_correctly

test result: FAILED. 0 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
