*** espanso-ui/src/win32/mod.rs:325:9: replace <impl UIRemote for Win32Remote>::exit with ()

*** mutation diff:
--- espanso-ui/src/win32/mod.rs
+++ replace <impl UIRemote for Win32Remote>::exit with ()
@@ -317,23 +317,17 @@
             }
             Err(error) => {
                 error!("Unable to show context menu, {}", error);
             }
         }
     }
 
     fn exit(&self) {
-        let handle = self.handle.load(Ordering::Acquire);
-        if handle.is_null() {
-            error!("Unable to exit eventloop, pointer is null");
-            return;
-        }
-
-        unsafe { ui_exit(handle) };
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[allow(clippy::single_match)] // TODO: remove after another match is used
 impl From<RawUIEvent> for Option<UIEvent> {
     fn from(raw: RawUIEvent) -> Option<UIEvent> {
         match raw.event_type {
             UI_EVENT_TYPE_ICON_CLICK => {

*** result: Success
