*** espanso-ui/src/win32/mod.rs:338:9: replace <impl From<RawUIEvent> for Option<UIEvent>>::from -> Option<UIEvent> with None

*** mutation diff:
--- espanso-ui/src/win32/mod.rs
+++ replace <impl From<RawUIEvent> for Option<UIEvent>>::from -> Option<UIEvent> with None
@@ -330,30 +330,17 @@
 
         unsafe { ui_exit(handle) };
     }
 }
 
 #[allow(clippy::single_match)] // TODO: remove after another match is used
 impl From<RawUIEvent> for Option<UIEvent> {
     fn from(raw: RawUIEvent) -> Option<UIEvent> {
-        match raw.event_type {
-            UI_EVENT_TYPE_ICON_CLICK => {
-                return Some(UIEvent::TrayIconClick);
-            }
-            UI_EVENT_TYPE_CONTEXT_MENU_CLICK => {
-                return Some(UIEvent::ContextMenuClick(raw.context_menu_id));
-            }
-            UI_EVENT_TYPE_HEARTBEAT => {
-                return Some(UIEvent::Heartbeat);
-            }
-            _ => {}
-        }
-
-        None
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Error, Debug)]
 pub enum Win32UIError {
     #[error("invalid handle")]
     InvalidHandle(),

*** result: Success
