*** espanso-ui/src/win32/notification.rs:92:5: replace is_espanso_app_user_model_id_set -> bool with true

*** mutation diff:
--- espanso-ui/src/win32/notification.rs
+++ replace is_espanso_app_user_model_id_set -> bool with true
@@ -84,29 +84,10 @@
             sender.send(msg.to_string())?;
             Ok(())
         }
         None => bail!("notification sender not available"),
     }
 }
 
 fn is_espanso_app_user_model_id_set() -> bool {
-    match Command::new("powershell")
-        .args(["-c", "get-startapps"])
-        .creation_flags(0x0800_0000)
-        .output()
-    {
-        Ok(output) => {
-            let output_str = String::from_utf8_lossy(&output.stdout);
-            // Check if espanso is present
-            output_str
-                .lines()
-                .any(|line| line.contains(ESPANSO_APP_USER_MODEL_ID))
-        }
-        Err(err) => {
-            error!(
-                "unable to determine if AppUserModelID was registered: {}",
-                err
-            );
-            false
-        }
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
