*** espanso/src/capabilities/fallback.rs:23:5: replace can_use_capabilities -> bool with true

*** mutation diff:
--- espanso/src/capabilities/fallback.rs
+++ replace can_use_capabilities -> bool with true
@@ -15,17 +15,17 @@
  *
  * You should have received a copy of the GNU General Public License
  * along with espanso.  If not, see <https://www.gnu.org/licenses/>.
  */
 
 use anyhow::Result;
 
 pub fn can_use_capabilities() -> bool {
-    false
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn grant_capabilities() -> Result<()> {
     Ok(())
 }
 
 pub fn clear_capabilities() -> Result<()> {
     Ok(())

*** result: Success
