*** espanso/src/capabilities/linux.rs:24:5: replace can_use_capabilities -> bool with false

*** mutation diff:
--- espanso/src/capabilities/linux.rs
+++ replace can_use_capabilities -> bool with false
@@ -16,23 +16,17 @@
  * You should have received a copy of the GNU General Public License
  * along with espanso.  If not, see <https://www.gnu.org/licenses/>.
  */
 use anyhow::Result;
 use caps::{CapSet, Capability};
 use log::error;
 
 pub fn can_use_capabilities() -> bool {
-    match caps::has_cap(None, CapSet::Permitted, Capability::CAP_DAC_OVERRIDE) {
-        Ok(has_cap) => has_cap,
-        Err(err) => {
-            error!("error while checking if capabilities are enabled: {}", err);
-            false
-        }
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn grant_capabilities() -> Result<()> {
     caps::raise(None, CapSet::Effective, Capability::CAP_DAC_OVERRIDE)?;
     Ok(())
 }
 
 pub fn clear_capabilities() -> Result<()> {

*** result: Success
