*** espanso/src/capabilities/linux.rs:34:5: replace grant_capabilities -> Result<()> with Ok(())

*** mutation diff:
--- espanso/src/capabilities/linux.rs
+++ replace grant_capabilities -> Result<()> with Ok(())
@@ -26,17 +26,16 @@
         Err(err) => {
             error!("error while checking if capabilities are enabled: {}", err);
             false
         }
     }
 }
 
 pub fn grant_capabilities() -> Result<()> {
-    caps::raise(None, CapSet::Effective, Capability::CAP_DAC_OVERRIDE)?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn clear_capabilities() -> Result<()> {
     caps::clear(None, CapSet::Effective)?;
     caps::clear(None, CapSet::Permitted)?;
     Ok(())
 }

*** result: Success
