*** espanso/src/cli/daemon/ipc.rs:30:5: replace initialize_and_spawn -> Result<()> with Ok(())

*** mutation diff:
--- espanso/src/cli/daemon/ipc.rs
+++ replace initialize_and_spawn -> Result<()> with Ok(())
@@ -22,39 +22,10 @@
 use anyhow::Result;
 use crossbeam::channel::Sender;
 use espanso_ipc::{EventHandlerResponse, IPCServer};
 use log::{error, warn};
 
 use crate::{exit_code::DAEMON_SUCCESS, ipc::IPCEvent};
 
 pub fn initialize_and_spawn(runtime_dir: &Path, exit_notify: Sender<i32>) -> Result<()> {
-    let server = crate::ipc::create_daemon_ipc_server(runtime_dir)?;
-
-    std::thread::Builder::new()
-        .name("daemon-ipc-handler".to_string())
-        .spawn(move || {
-            server
-                .run(Box::new(move |event| match event {
-                    IPCEvent::Exit => {
-                        if let Err(err) = exit_notify.send(DAEMON_SUCCESS) {
-                            error!(
-                "experienced error while sending exit signal from daemon ipc handler: {}",
-                err
-              );
-                        }
-
-                        EventHandlerResponse::NoResponse
-                    }
-                    unexpected_event => {
-                        warn!(
-                            "received unexpected event in daemon ipc handler: {:?}",
-                            unexpected_event
-                        );
-
-                        EventHandlerResponse::NoResponse
-                    }
-                }))
-                .expect("unable to start IPC handler");
-        })?;
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
