*** espanso/src/cli/daemon/keyboard_layout_watcher.rs:28:5: replace initialize_and_spawn -> Result<()> with Ok(())

*** mutation diff:
--- espanso/src/cli/daemon/keyboard_layout_watcher.rs
+++ replace initialize_and_spawn -> Result<()> with Ok(())
@@ -20,27 +20,17 @@
 use anyhow::Result;
 use crossbeam::channel::Sender;
 use log::{debug, error, warn};
 
 const WATCHER_INTERVAL: u64 = 1000;
 
 pub fn initialize_and_spawn(watcher_notify: Sender<()>) -> Result<()> {
     // On Windows and macOS we don't need to restart espanso when the layout changes
-    if !cfg!(target_os = "linux") {
-        return Ok(());
-    }
-
-    std::thread::Builder::new()
-        .name("keyboard_layout_watcher".to_string())
-        .spawn(move || {
-            watcher_main(&watcher_notify);
-        })?;
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn watcher_main(watcher_notify: &Sender<()>) {
     let mut layout = espanso_detect::get_active_layout();
 
     if layout.is_none() {
         warn!("keyboard layout watcher couldn't determine active layout.");
     }

*** result: Success
