*** espanso/src/cli/daemon/keyboard_layout_watcher.rs:42:5: replace watcher_main with ()

*** mutation diff:
--- espanso/src/cli/daemon/keyboard_layout_watcher.rs
+++ replace watcher_main with ()
@@ -34,33 +34,10 @@
         .spawn(move || {
             watcher_main(&watcher_notify);
         })?;
 
     Ok(())
 }
 
 fn watcher_main(watcher_notify: &Sender<()>) {
-    let mut layout = espanso_detect::get_active_layout();
-
-    if layout.is_none() {
-        warn!("keyboard layout watcher couldn't determine active layout.");
-    }
-
-    loop {
-        std::thread::sleep(std::time::Duration::from_millis(WATCHER_INTERVAL));
-
-        let current_layout = espanso_detect::get_active_layout();
-        if current_layout != layout {
-            debug!(
-                "detected keyboard layout change: from '{}' to '{}'",
-                layout.as_deref().unwrap_or_default(),
-                current_layout.as_deref().unwrap_or_default(),
-            );
-
-            if let Err(error) = watcher_notify.send(()) {
-                error!("unable to send keyboard layout changed event: {}", error);
-            }
-
-            layout = current_layout;
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
