*** espanso/src/cli/daemon/keyboard_layout_watcher.rs:52:27: replace != with == in watcher_main

*** mutation diff:
--- espanso/src/cli/daemon/keyboard_layout_watcher.rs
+++ replace != with == in watcher_main
@@ -44,17 +44,17 @@
     if layout.is_none() {
         warn!("keyboard layout watcher couldn't determine active layout.");
     }
 
     loop {
         std::thread::sleep(std::time::Duration::from_millis(WATCHER_INTERVAL));
 
         let current_layout = espanso_detect::get_active_layout();
-        if current_layout != layout {
+        if current_layout == /* ~ changed by cargo-mutants ~ */ layout {
             debug!(
                 "detected keyboard layout change: from '{}' to '{}'",
                 layout.as_deref().unwrap_or_default(),
                 current_layout.as_deref().unwrap_or_default(),
             );
 
             if let Err(error) = watcher_notify.send(()) {
                 error!("unable to send keyboard layout changed event: {}", error);

*** result: Success
