*** espanso/src/cli/daemon/watcher.rs:111:5: replace debouncer_main with ()

*** mutation diff:
--- espanso/src/cli/daemon/watcher.rs
+++ replace debouncer_main with ()
@@ -103,34 +103,17 @@
                     error
                 );
             }
         }
     }
 }
 
 fn debouncer_main(debounce_rx: crossbeam::channel::Receiver<()>, watcher_notify: &Sender<()>) {
-    let mut has_received_event = false;
-
-    loop {
-        select! {
-          recv(debounce_rx) -> _ => {
-            has_received_event = true;
-          },
-          default(Duration::from_millis(WATCHER_DEBOUNCE_DURATION_MS)) => {
-            if has_received_event {
-              if let Err(error) = watcher_notify.send(()) {
-                error!("unable to send watcher file changed event: {}", error);
-              }
-            }
-
-            has_received_event = false;
-          },
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_file_hidden(path: &Path) -> bool {
     let starts_with_dot = path
         .file_name()
         .unwrap_or_default()
         .to_string_lossy()
         .starts_with('.');

*** result: Success
