*** espanso/src/cli/daemon/watcher.rs:132:5: replace is_file_hidden -> bool with false

*** mutation diff:
--- espanso/src/cli/daemon/watcher.rs
+++ replace is_file_hidden -> bool with false
@@ -124,23 +124,17 @@
 
             has_received_event = false;
           },
         }
     }
 }
 
 fn is_file_hidden(path: &Path) -> bool {
-    let starts_with_dot = path
-        .file_name()
-        .unwrap_or_default()
-        .to_string_lossy()
-        .starts_with('.');
-
-    starts_with_dot || has_hidden_attribute(path)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(windows)]
 fn has_hidden_attribute(path: &Path) -> bool {
     use std::os::windows::prelude::*;
     let metadata = std::fs::metadata(path);
     if metadata.is_err() {
         return false;

*** result: Success
