*** espanso/src/cli/daemon/watcher.rs:138:21: replace || with && in is_file_hidden

*** mutation diff:
--- espanso/src/cli/daemon/watcher.rs
+++ replace || with && in is_file_hidden
@@ -130,17 +130,17 @@
 
 fn is_file_hidden(path: &Path) -> bool {
     let starts_with_dot = path
         .file_name()
         .unwrap_or_default()
         .to_string_lossy()
         .starts_with('.');
 
-    starts_with_dot || has_hidden_attribute(path)
+    starts_with_dot && /* ~ changed by cargo-mutants ~ */ has_hidden_attribute(path)
 }
 
 #[cfg(windows)]
 fn has_hidden_attribute(path: &Path) -> bool {
     use std::os::windows::prelude::*;
     let metadata = std::fs::metadata(path);
     if metadata.is_err() {
         return false;

*** result: Success
