*** espanso/src/cli/daemon/watcher.rs:155:5: replace has_hidden_attribute -> bool with true

*** mutation diff:
--- espanso/src/cli/daemon/watcher.rs
+++ replace has_hidden_attribute -> bool with true
@@ -147,10 +147,10 @@
     }
     let attributes = metadata.unwrap().file_attributes();
 
     (attributes & 0x2) > 0
 }
 
 #[cfg(not(windows))]
 fn has_hidden_attribute(_: &Path) -> bool {
-    false
+    true /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
