*** espanso/src/cli/daemon/watcher.rs:69:21: delete match arm

*** mutation diff:
--- espanso/src/cli/daemon/watcher.rs
+++ delete match arm
@@ -61,17 +61,17 @@
 
     info!("watching for changes in path: {:?}", config_dir);
 
     loop {
         let should_reload = match rx.recv() {
             Ok(event) => {
                 let path = match event {
                     DebouncedEvent::Create(path) => Some(path),
-                    DebouncedEvent::Write(path) => Some(path),
+                     /* ~ changed by cargo-mutants ~ */
                     DebouncedEvent::Remove(path) => Some(path),
                     DebouncedEvent::Rename(_, path) => Some(path),
                     _ => None,
                 };
 
                 if let Some(path) = path {
                     let extension = path
                         .extension()

*** result: Success
