*** espanso/src/cli/edit.rs:144:20: delete ! in determine_target_path

*** mutation diff:
--- espanso/src/cli/edit.rs
+++ delete ! in determine_target_path
@@ -136,17 +136,17 @@
 }
 
 fn determine_target_path(config_path: &Path, target_file: Option<&str>) -> PathBuf {
     if let Some(target_file) = target_file {
         match target_file {
             "default" => config_path.join("config").join("default.yml"),
             "base" => config_path.join("match").join("base.yml"),
             custom => {
-                if !std::path::Path::new(custom)
+                if  /* ~ changed by cargo-mutants ~ */std::path::Path::new(custom)
                     .extension()
                     .is_some_and(|ext| ext.eq_ignore_ascii_case("yml"))
                     && !std::path::Path::new(custom)
                         .extension()
                         .is_some_and(|ext| ext.eq_ignore_ascii_case("yaml"))
                 {
                     config_path.join("match").join(format!("{custom}.yml"))
                 } else {

*** result: Success
