*** espanso/src/cli/edit.rs:27:5: replace default_editor -> String with "xyzzy".into()

*** mutation diff:
--- espanso/src/cli/edit.rs
+++ replace default_editor -> String with "xyzzy".into()
@@ -19,17 +19,17 @@
 
 use std::path::{Path, PathBuf};
 use std::process::Command;
 
 use super::{CliModule, CliModuleArgs};
 
 #[cfg(target_os = "linux")]
 fn default_editor() -> String {
-    "/bin/nano".to_owned()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 #[cfg(target_os = "macos")]
 fn default_editor() -> String {
     "/usr/bin/nano".to_owned()
 }
 #[cfg(target_os = "windows")]
 fn default_editor() -> String {
     "C:\\Windows\\System32\\notepad.exe".to_owned()

*** result: Success
