*** espanso/src/cli/edit.rs:35:5: replace default_editor -> String with String::new()

*** mutation diff:
--- espanso/src/cli/edit.rs
+++ replace default_editor -> String with String::new()
@@ -27,17 +27,17 @@
     "/bin/nano".to_owned()
 }
 #[cfg(target_os = "macos")]
 fn default_editor() -> String {
     "/usr/bin/nano".to_owned()
 }
 #[cfg(target_os = "windows")]
 fn default_editor() -> String {
-    "C:\\Windows\\System32\\notepad.exe".to_owned()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn new() -> CliModule {
     CliModule {
         requires_paths: true,
         subcommand: "edit".to_string(),
         entry: edit_main,
         ..Default::default()

*** result: Success
