*** espanso/src/cli/env_path.rs:26:5: replace new -> CliModule with Default::default()

*** mutation diff:
--- espanso/src/cli/env_path.rs
+++ replace new -> CliModule with Default::default()
@@ -18,24 +18,17 @@
  */
 
 use crate::exit_code::{ADD_TO_PATH_FAILURE, ADD_TO_PATH_SUCCESS};
 
 use super::{CliModule, CliModuleArgs};
 use log::error;
 
 pub fn new() -> CliModule {
-    CliModule {
-        enable_logs: true,
-        disable_logs_terminal_output: true,
-        log_mode: super::LogMode::AppendOnly,
-        subcommand: "env-path".to_string(),
-        entry: env_path_main,
-        ..Default::default()
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn env_path_main(args: CliModuleArgs) -> i32 {
     let cli_args = args.cli_args.expect("missing cli_args");
 
     let elevated_priviledge_prompt = cli_args.is_present("prompt");
 
     if cli_args.subcommand_matches("register").is_some() {

*** result: Success
