*** espanso/src/cli/launcher/accessibility.rs:27:5: replace prompt_enable_accessibility -> bool with false

*** mutation diff:
--- espanso/src/cli/launcher/accessibility.rs
+++ replace prompt_enable_accessibility -> bool with false
@@ -19,17 +19,17 @@
 
 #[cfg(not(target_os = "macos"))]
 pub fn is_accessibility_enabled() -> bool {
     true
 }
 
 #[cfg(not(target_os = "macos"))]
 pub fn prompt_enable_accessibility() -> bool {
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "macos")]
 pub fn is_accessibility_enabled() -> bool {
     espanso_mac_utils::check_accessibility()
 }
 
 #[cfg(target_os = "macos")]

*** result: Success
