*** espanso/src/cli/launcher/accessibility.rs:32:5: replace is_accessibility_enabled -> bool with true

*** mutation diff:
--- espanso/src/cli/launcher/accessibility.rs
+++ replace is_accessibility_enabled -> bool with true
@@ -24,15 +24,15 @@
 
 #[cfg(not(target_os = "macos"))]
 pub fn prompt_enable_accessibility() -> bool {
     true
 }
 
 #[cfg(target_os = "macos")]
 pub fn is_accessibility_enabled() -> bool {
-    espanso_mac_utils::check_accessibility()
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "macos")]
 pub fn prompt_enable_accessibility() -> bool {
     espanso_mac_utils::prompt_accessibility()
 }

*** result: Success
