*** espanso/src/cli/launcher/daemon.rs:30:5: replace launch_daemon -> Result<()> with Ok(())

*** mutation diff:
--- espanso/src/cli/launcher/daemon.rs
+++ replace launch_daemon -> Result<()> with Ok(())
@@ -22,28 +22,17 @@
 use anyhow::Result;
 use std::process::ExitStatus;
 use thiserror::Error;
 
 use crate::cli::util::CommandExt;
 use crate::cli::PathsOverrides;
 
 pub fn launch_daemon(paths_overrides: &PathsOverrides) -> Result<()> {
-    let espanso_exe_path = std::env::current_exe()?;
-    let mut command = Command::new(espanso_exe_path.to_string_lossy().to_string());
-    command.args(["daemon"]);
-    command.with_paths_overrides(paths_overrides);
-
-    let result = spawn_and_wait(command)?;
-
-    if result.success() {
-        Ok(())
-    } else {
-        Err(DaemonError::NonZeroExitCode.into())
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Error, Debug)]
 pub enum DaemonError {
     #[error("unexpected error, 'espanso daemon' returned a non-zero exit code.")]
     NonZeroExitCode,
 }

*** result: Success
