*** espanso/src/cli/launcher/daemon.rs:52:5: replace spawn_and_wait -> Result<ExitStatus> with Ok(Default::default())

*** mutation diff:
--- espanso/src/cli/launcher/daemon.rs
+++ replace spawn_and_wait -> Result<ExitStatus> with Ok(Default::default())
@@ -44,18 +44,17 @@
 #[derive(Error, Debug)]
 pub enum DaemonError {
     #[error("unexpected error, 'espanso daemon' returned a non-zero exit code.")]
     NonZeroExitCode,
 }
 
 #[cfg(not(target_os = "macos"))]
 fn spawn_and_wait(mut command: Command) -> Result<ExitStatus> {
-    let mut child = command.spawn()?;
-    Ok(child.wait()?)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 // On macOS, if we simply wait for the daemon process to terminate, the application will
 // appear as "Not Responding" after a few seconds, even though it's working correctly.
 // To avoid this undesirable behavior, we spawn an headless eventloop so that the
 // launcher looks "alive", while waiting for the daemon
 #[cfg(target_os = "macos")]
 fn spawn_and_wait(mut command: Command) -> Result<ExitStatus> {

*** result: Success
