*** espanso/src/cli/launcher/edition_check.rs:24:8: delete ! in is_wrong_edition

*** mutation diff:
--- espanso/src/cli/launcher/edition_check.rs
+++ delete ! in is_wrong_edition
@@ -16,17 +16,17 @@
  * You should have received a copy of the GNU General Public License
  * along with espanso.  If not, see <https://www.gnu.org/licenses/>.
  */
 
 use crate::warn_eprintln;
 use espanso_modulo::wizard::DetectedOS;
 
 pub fn is_wrong_edition() -> (bool, DetectedOS) {
-    if !cfg!(target_os = "linux") {
+    if  /* ~ changed by cargo-mutants ~ */cfg!(target_os = "linux") {
         return (false, DetectedOS::Unknown);
     }
 
     match get_session_type().as_deref() {
         Some("x11") if cfg!(feature = "wayland") => return (true, DetectedOS::X11),
         Some("wayland") if !cfg!(feature = "wayland") => return (true, DetectedOS::Wayland),
         None => {
             warn_eprintln!("could not automatically determine the session type (X11/Wayland), so make sure you have the correct espanso version!");

*** result: Success
