*** espanso/src/cli/launcher/edition_check.rs:29:24: replace match guard with true

*** mutation diff:
--- espanso/src/cli/launcher/edition_check.rs
+++ replace match guard with true
@@ -21,17 +21,17 @@
 use espanso_modulo::wizard::DetectedOS;
 
 pub fn is_wrong_edition() -> (bool, DetectedOS) {
     if !cfg!(target_os = "linux") {
         return (false, DetectedOS::Unknown);
     }
 
     match get_session_type().as_deref() {
-        Some("x11") if cfg!(feature = "wayland") => return (true, DetectedOS::X11),
+        Some("x11") if true /* ~ changed by cargo-mutants ~ */ => return (true, DetectedOS::X11),
         Some("wayland") if !cfg!(feature = "wayland") => return (true, DetectedOS::Wayland),
         None => {
             warn_eprintln!("could not automatically determine the session type (X11/Wayland), so make sure you have the correct espanso version!");
         }
         _ => {}
     }
 
     (false, DetectedOS::Unknown)

*** result: Success
