*** espanso/src/cli/launcher/edition_check.rs:31:9: delete match arm

*** mutation diff:
--- espanso/src/cli/launcher/edition_check.rs
+++ delete match arm
@@ -23,19 +23,17 @@
 pub fn is_wrong_edition() -> (bool, DetectedOS) {
     if !cfg!(target_os = "linux") {
         return (false, DetectedOS::Unknown);
     }
 
     match get_session_type().as_deref() {
         Some("x11") if cfg!(feature = "wayland") => return (true, DetectedOS::X11),
         Some("wayland") if !cfg!(feature = "wayland") => return (true, DetectedOS::Wayland),
-        None => {
-            warn_eprintln!("could not automatically determine the session type (X11/Wayland), so make sure you have the correct espanso version!");
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => {}
     }
 
     (false, DetectedOS::Unknown)
 }
 
 fn get_session_type() -> Option<String> {
     let output = std::process::Command::new("sh")

*** result: Success
