*** espanso/src/cli/launcher/edition_check.rs:41:5: replace get_session_type -> Option<String> with Some(String::new())

*** mutation diff:
--- espanso/src/cli/launcher/edition_check.rs
+++ replace get_session_type -> Option<String> with Some(String::new())
@@ -33,27 +33,10 @@
         }
         _ => {}
     }
 
     (false, DetectedOS::Unknown)
 }
 
 fn get_session_type() -> Option<String> {
-    let output = std::process::Command::new("sh")
-        .arg("-c")
-        .arg("loginctl show-session $(loginctl | grep $(whoami) | awk '{print $1}') -p Type")
-        .output()
-        .ok()?;
-
-    if !output.status.success() {
-        return None;
-    }
-
-    let raw_session_type = String::from_utf8_lossy(&output.stdout);
-    let raw_session_type = raw_session_type.trim();
-    if !raw_session_type.contains("Type=") {
-        return None;
-    }
-
-    let session_type: Option<&str> = raw_session_type.split('=').next_back();
-    session_type.map(String::from)
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
