*** espanso/src/cli/launcher/mod.rs:110:17: delete ! in launcher_main

*** mutation diff:
--- espanso/src/cli/launcher/mod.rs
+++ delete ! in launcher_main
@@ -102,17 +102,17 @@
 
     let is_add_path_page_enabled =
         if cfg!(not(target_os = "linux")) && !preferences.has_completed_wizard() {
             if cfg!(target_os = "macos") {
                 !crate::path::is_espanso_in_path()
             } else if paths.is_portable_mode {
                 false
             } else {
-                !crate::path::is_espanso_in_path()
+                 /* ~ changed by cargo-mutants ~ */crate::path::is_espanso_in_path()
             }
         } else {
             false
         };
     let add_to_path_handler = Box::new(move || match util::add_espanso_to_path() {
         Ok(()) => true,
         Err(error) => {
             eprintln!("Add to path returned error: {error}");

*** result: Success
