*** espanso/src/cli/launcher/util.rs:28:5: replace is_legacy_version_running -> bool with true

*** mutation diff:
--- espanso/src/cli/launcher/util.rs
+++ replace is_legacy_version_running -> bool with true
@@ -20,17 +20,17 @@
 use std::process::Command;
 
 use anyhow::{bail, Result};
 use thiserror::Error;
 
 use crate::util::set_command_flags;
 
 pub fn is_legacy_version_running() -> bool {
-    false
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn add_espanso_to_path() -> Result<()> {
     let espanso_exe_path = std::env::current_exe()?;
     let mut command = Command::new(espanso_exe_path.to_string_lossy().to_string());
     command.args(["env-path", "--prompt", "register"]);
 
     let mut child = command.spawn()?;

*** result: Success
