*** espanso/src/cli/launcher/util.rs:32:5: replace add_espanso_to_path -> Result<()> with Ok(())

*** mutation diff:
--- espanso/src/cli/launcher/util.rs
+++ replace add_espanso_to_path -> Result<()> with Ok(())
@@ -24,28 +24,17 @@
 
 use crate::util::set_command_flags;
 
 pub fn is_legacy_version_running() -> bool {
     false
 }
 
 pub fn add_espanso_to_path() -> Result<()> {
-    let espanso_exe_path = std::env::current_exe()?;
-    let mut command = Command::new(espanso_exe_path.to_string_lossy().to_string());
-    command.args(["env-path", "--prompt", "register"]);
-
-    let mut child = command.spawn()?;
-    let result = child.wait()?;
-
-    if result.success() {
-        Ok(())
-    } else {
-        Err(AddToPathError::NonZeroExitCode.into())
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Error, Debug)]
 pub enum AddToPathError {
     #[error("unexpected error, 'espanso env-path register' returned a non-zero exit code.")]
     NonZeroExitCode,
 }

*** result: Success
