*** espanso/src/cli/launcher/util.rs:53:5: replace show_already_running_warning -> Result<()> with Ok(())

*** mutation diff:
--- espanso/src/cli/launcher/util.rs
+++ replace show_already_running_warning -> Result<()> with Ok(())
@@ -45,23 +45,17 @@
 
 #[derive(Error, Debug)]
 pub enum AddToPathError {
     #[error("unexpected error, 'espanso env-path register' returned a non-zero exit code.")]
     NonZeroExitCode,
 }
 
 pub fn show_already_running_warning() -> Result<()> {
-    let espanso_exe_path = std::env::current_exe()?;
-    let mut command = Command::new(espanso_exe_path.to_string_lossy().to_string());
-    command.args(["modulo", "welcome", "--already-running"]);
-
-    let mut child = command.spawn()?;
-    child.wait()?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn configure_auto_start(auto_start: bool) -> Result<()> {
     let espanso_exe_path = std::env::current_exe()?;
     let mut command = Command::new(espanso_exe_path.to_string_lossy().to_string());
     let mut args = vec!["service"];
     if auto_start {
         args.push("register");

*** result: Success
