*** espanso/src/cli/log.rs:26:5: replace new -> CliModule with Default::default()

*** mutation diff:
--- espanso/src/cli/log.rs
+++ replace new -> CliModule with Default::default()
@@ -18,22 +18,17 @@
  */
 
 use std::io::BufRead;
 use std::{fs::File, io::BufReader};
 
 use super::{CliModule, CliModuleArgs};
 
 pub fn new() -> CliModule {
-    CliModule {
-        requires_paths: true,
-        subcommand: "log".to_string(),
-        entry: log_main,
-        ..Default::default()
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn log_main(args: CliModuleArgs) -> i32 {
     let paths = args.paths.expect("missing paths argument");
     let log_file = paths.runtime.join(crate::LOG_FILE_NAME);
 
     if !log_file.exists() {
         eprintln!("No log file found.");

*** result: Success
