*** espanso/src/cli/log.rs:35:5: replace log_main -> i32 with -1

*** mutation diff:
--- espanso/src/cli/log.rs
+++ replace log_main -> i32 with -1
@@ -27,29 +27,10 @@
         requires_paths: true,
         subcommand: "log".to_string(),
         entry: log_main,
         ..Default::default()
     }
 }
 
 fn log_main(args: CliModuleArgs) -> i32 {
-    let paths = args.paths.expect("missing paths argument");
-    let log_file = paths.runtime.join(crate::LOG_FILE_NAME);
-
-    if !log_file.exists() {
-        eprintln!("No log file found.");
-        return 2;
-    }
-
-    let log_file = File::open(log_file);
-    if let Ok(log_file) = log_file {
-        let reader = BufReader::new(log_file);
-        for line in reader.lines().map_while(Result::ok) {
-            println!("{line}");
-        }
-    } else {
-        eprintln!("Error reading log file");
-        return 1;
-    }
-
-    0
+    -1 /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
