*** espanso/src/cli/log.rs:38:8: delete ! in log_main

*** mutation diff:
--- espanso/src/cli/log.rs
+++ delete ! in log_main
@@ -30,17 +30,17 @@
         ..Default::default()
     }
 }
 
 fn log_main(args: CliModuleArgs) -> i32 {
     let paths = args.paths.expect("missing paths argument");
     let log_file = paths.runtime.join(crate::LOG_FILE_NAME);
 
-    if !log_file.exists() {
+    if  /* ~ changed by cargo-mutants ~ */log_file.exists() {
         eprintln!("No log file found.");
         return 2;
     }
 
     let log_file = File::open(log_file);
     if let Ok(log_file) = log_file {
         let reader = BufReader::new(log_file);
         for line in reader.lines().map_while(Result::ok) {

*** result: Success
