*** espanso/src/cli/match_cli/exec.rs:36:26: replace || with && in exec_main

*** mutation diff:
--- espanso/src/cli/match_cli/exec.rs
+++ replace || with && in exec_main
@@ -28,17 +28,17 @@
     ipc::{create_ipc_client_to_worker, IPCEvent, RequestMatchExpansionPayload},
     lock::acquire_worker_lock,
 };
 
 pub fn exec_main(cli_args: &ArgMatches, paths: &Paths) -> Result<()> {
     let trigger = cli_args.value_of("trigger");
     let args = cli_args.values_of("arg");
 
-    if trigger.is_none() || trigger.is_some_and(str::is_empty) {
+    if trigger.is_none() && /* ~ changed by cargo-mutants ~ */ trigger.is_some_and(str::is_empty) {
         bail!("You need to specify the --trigger 'trigger' option. Run `espanso match exec --help` for more information.");
     }
 
     if acquire_worker_lock(&paths.runtime).is_some() {
         bail!("Worker process is not running, please start Espanso first.")
     }
 
     let mut client = create_ipc_client_to_worker(&paths.runtime)?;

*** result: Success
