*** espanso/src/cli/match_cli/list.rs:33:5: replace list_main -> Result<()> with Ok(())

*** mutation diff:
--- espanso/src/cli/match_cli/list.rs
+++ replace list_main -> Result<()> with Ok(())
@@ -25,33 +25,17 @@
 };
 use serde::Serialize;
 
 pub fn list_main(
     cli_args: &ArgMatches,
     config_store: Box<dyn ConfigStore>,
     match_store: Box<dyn MatchStore>,
 ) -> Result<()> {
-    let only_triggers = cli_args.is_present("onlytriggers");
-    let preserve_newlines = cli_args.is_present("preservenewlines");
-
-    let class = cli_args.value_of("class");
-    let title = cli_args.value_of("title");
-    let exec = cli_args.value_of("exec");
-
-    let config = config_store.active(&AppProperties { title, class, exec });
-    let match_set = match_store.query(config.match_paths());
-
-    if cli_args.is_present("json") {
-        print_matches_as_json(&match_set.matches)?;
-    } else {
-        print_matches_as_plain(&match_set.matches, only_triggers, preserve_newlines)?;
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn print_matches_as_plain(
     match_list: &[&Match],
     only_triggers: bool,
     preserve_newlines: bool,
 ) -> Result<()> {
     for m in match_list {

*** result: Success
