*** espanso/src/cli/modulo/form.rs:30:30: replace == with != in form_main

*** mutation diff:
--- espanso/src/cli/modulo/form.rs
+++ replace == with != in form_main
@@ -22,17 +22,17 @@
 use espanso_modulo::form::*;
 
 pub fn form_main(matches: &ArgMatches, _icon_paths: &IconPaths) -> i32 {
     let as_json: bool = matches.is_present("json");
 
     let input_file = matches
         .value_of("input_file")
         .expect("missing input, please specify the -i option");
-    let data = if input_file == "-" {
+    let data = if input_file != /* ~ changed by cargo-mutants ~ */ "-" {
         use std::io::Read;
         let mut buffer = String::new();
         std::io::stdin()
             .read_to_string(&mut buffer)
             .expect("unable to obtain input from stdin");
         buffer
     } else {
         std::fs::read_to_string(input_file).expect("unable to read input file")

*** result: Success
