*** espanso/src/cli/package/install.rs:69:26: replace && with || in install_package

*** mutation diff:
--- espanso/src/cli/package/install.rs
+++ replace && with || in install_package
@@ -61,17 +61,17 @@
                 name: package_name.to_string(),
                 version: version.map(String::from),
                 ..Default::default()
             },
             false,
         )
     };
 
-    if requires_external && !external {
+    if requires_external || /* ~ changed by cargo-mutants ~ */ !external {
         error_eprintln!("Error: the requested package is hosted on an external repository");
         error_eprintln!("and its contents may not have been verified by the espanso team.");
         error_eprintln!("");
         error_eprintln!(
             "For security reasons, espanso blocks packages that are not verified by default."
         );
         error_eprintln!(
             "If you want to install the package anyway, you can proceed with the installation"

*** result: Success
