*** espanso/src/cli/package/list.rs:28:5: replace list_packages -> Result<()> with Ok(())

*** mutation diff:
--- espanso/src/cli/package/list.rs
+++ replace list_packages -> Result<()> with Ok(())
@@ -20,39 +20,10 @@
 use crate::path::Paths;
 use anyhow::{Context, Result};
 use clap::ArgMatches;
 use espanso_package::StoredPackage;
 
 use crate::info_println;
 
 pub fn list_packages(paths: &Paths, _: &ArgMatches) -> Result<()> {
-    let archiver =
-        espanso_package::get_archiver(&paths.packages).context("unable to get package archiver")?;
-
-    let packages = archiver.list().context("unable to list packages")?;
-
-    if packages.is_empty() {
-        info_println!("No packages found!");
-        return Ok(());
-    }
-
-    info_println!("Installed packages:");
-    info_println!("");
-
-    for package in packages {
-        match package {
-            StoredPackage::Legacy(legacy) => {
-                info_println!("- {} (legacy)", legacy.name);
-            }
-            StoredPackage::Modern(package) => {
-                info_println!(
-                    "- {} - version: {} ({})",
-                    package.manifest.name,
-                    package.manifest.version,
-                    package.source
-                );
-            }
-        }
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
