*** espanso/src/cli/package/mod.rs:71:13: delete match arm

*** mutation diff:
--- espanso/src/cli/package/mod.rs
+++ delete match arm
@@ -63,20 +63,17 @@
         }
     } else if let Some(sub_matches) = cli_args.subcommand_matches("list") {
         if let Err(err) = list::list_packages(&paths, sub_matches) {
             error_eprintln!("unable to list packages: {:?}", err);
             return PACKAGE_LIST_FAILED;
         }
     } else if let Some(sub_matches) = cli_args.subcommand_matches("update") {
         match update::update_package(&paths, sub_matches) {
-            Ok(update::UpdateResults::PartialFailure) => {
-                error_eprintln!("some packages were updated, but not all of them. Check the previous log for more information");
-                return PACKAGE_UPDATE_PARTIAL_FAILURE;
-            }
+             /* ~ changed by cargo-mutants ~ */
             Err(err) => {
                 error_eprintln!("unable to update package: {:?}", err);
                 return PACKAGE_UPDATE_FAILED;
             }
             _ => {}
         }
     }

*** result: Success
