*** espanso/src/cli/package/uninstall.rs:27:5: replace uninstall_package -> Result<()> with Ok(())

*** mutation diff:
--- espanso/src/cli/package/uninstall.rs
+++ replace uninstall_package -> Result<()> with Ok(())
@@ -19,23 +19,10 @@
 
 use crate::path::Paths;
 use anyhow::{anyhow, Context, Result};
 use clap::ArgMatches;
 
 use crate::info_println;
 
 pub fn uninstall_package(paths: &Paths, matches: &ArgMatches) -> Result<()> {
-    let package_name = matches
-        .value_of("package_name")
-        .ok_or_else(|| anyhow!("missing package name"))?;
-
-    let archiver =
-        espanso_package::get_archiver(&paths.packages).context("unable to get package archiver")?;
-
-    archiver
-        .delete(package_name)
-        .context("unable to delete package")?;
-
-    info_println!("package '{}' uninstalled!", package_name);
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
