*** espanso/src/cli/service/linux.rs:148:55: replace == with != in is_registered

*** mutation diff:
--- espanso/src/cli/service/linux.rs
+++ replace == with != in is_registered
@@ -140,17 +140,17 @@
                 let output = String::from_utf8_lossy(cmd_output.stdout.as_slice());
                 let output = output.trim();
                 if cmd_output.status.success() {
                     let caps = EXEC_PATH_REGEX.captures(output).unwrap();
                     let path = caps.get(1).map_or("", |m| m.as_str());
                     let espanso_path =
                         get_binary_path().expect("unable to get espanso executable path");
 
-                    if espanso_path.to_string_lossy() == path {
+                    if espanso_path.to_string_lossy() != /* ~ changed by cargo-mutants ~ */ path {
                         true
                     } else {
                         error_eprintln!("Espanso is registered as a systemd service, but it points to another binary location:");
                         error_eprintln!("");
                         error_eprintln!("  {}", path);
                         error_eprintln!("");
                         error_eprintln!(
                             "This could have been caused by an update that changed its location."

*** result: Success
