*** espanso/src/cli/service/macos.rs:145:8: delete ! in start_service

*** mutation diff:
--- espanso/src/cli/service/macos.rs
+++ delete ! in start_service
@@ -137,17 +137,17 @@
     let home_dir = dirs::home_dir().expect("could not get user home directory");
     let library_dir = home_dir.join("Library");
     let agents_dir = library_dir.join("LaunchAgents");
     let plist_file = agents_dir.join(SERVICE_PLIST_FILE_NAME);
     plist_file.is_file()
 }
 
 pub fn start_service() -> Result<()> {
-    if !is_registered() {
+    if  /* ~ changed by cargo-mutants ~ */is_registered() {
         eprintln!("Unable to start espanso as a service as it's not been registered.");
         eprintln!("You can either register it first with `espanso service register` or");
         eprintln!("you can run it in unmanaged mode with `espanso service start --unmanaged`");
         eprintln!();
         eprintln!("NOTE: unmanaged mode means espanso does not rely on the system service manager");
         eprintln!("      to run, but as a result, you are in charge of starting/stopping espanso");
         eprintln!("      when needed.");
         return Err(StartError::NotRegistered.into());

*** result: Success
