*** espanso/src/cli/service/stop.rs:80:5: replace wait_for_worker_to_be_stopped -> bool with false

*** mutation diff:
--- espanso/src/cli/service/stop.rs
+++ replace wait_for_worker_to_be_stopped -> bool with false
@@ -72,27 +72,17 @@
     #[error("worker timed out")]
     WorkerTimedOut,
 
     #[error("ipc error: `{0}`")]
     IPCError(Error),
 }
 
 fn wait_for_worker_to_be_stopped(runtime_dir: &Path) -> bool {
-    let now = Instant::now();
-    while now.elapsed() < std::time::Duration::from_secs(3) {
-        let lock_file = acquire_worker_lock(runtime_dir);
-        if lock_file.is_some() {
-            return true;
-        }
-
-        std::thread::sleep(std::time::Duration::from_millis(200));
-    }
-
-    false
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn forcefully_terminate_espanso() {
     let mut sys =
         System::new_with_specifics(RefreshKind::new().with_processes(ProcessRefreshKind::new()));
     sys.refresh_processes_specifics(ProcessRefreshKind::new());
 
     let target_process_names = if cfg!(target_os = "windows") {

*** result: Success
