*** espanso/src/cli/service/win.rs:124:5: replace get_startup_shortcut_file -> Result<PathBuf> with Ok(Default::default())

*** mutation diff:
--- espanso/src/cli/service/win.rs
+++ replace get_startup_shortcut_file -> Result<PathBuf> with Ok(Default::default())
@@ -116,18 +116,17 @@
     if !startup.is_dir() {
         create_dir_all(&startup)?;
     }
 
     Ok(startup)
 }
 
 fn get_startup_shortcut_file() -> Result<PathBuf> {
-    let parent = get_startup_dir()?;
-    Ok(parent.join("espanso.lnk"))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_shortcut_target_file(shortcut_path: &Path) -> Result<PathBuf> {
     let output = Command::new("powershell")
             .arg("-c")
             .arg("$sh = New-Object -ComObject WScript.Shell; $target = $sh.CreateShortcut($env:TARGET_FILE_PATH).TargetPath; echo $target")
             .env("TARGET_FILE_PATH", shortcut_path.to_string_lossy().to_string())
             .output()?;

*** result: Success
