*** espanso/src/cli/service/win.rs:68:37: replace != with == in is_registered

*** mutation diff:
--- espanso/src/cli/service/win.rs
+++ replace != with == in is_registered
@@ -60,17 +60,17 @@
                 return false;
             }
 
             match get_shortcut_target_file(&shortcut_path) {
                 Ok(target_path) => {
                     // Check if the target file is the same as the current binary
                     let current_path = std::env::current_exe().expect("unable to get exec path");
 
-                    if current_path != target_path {
+                    if current_path == /* ~ changed by cargo-mutants ~ */ target_path {
                         warn_eprintln!("WARNING: Espanso is already registered as a service, but it points to another executable,");
                         warn_eprintln!("which can create some inconsistencies.");
                         warn_eprintln!(
               "To fix the problem, unregister and register espanso again with these commands:"
             );
                         warn_eprintln!("");
                         warn_eprintln!("   espanso service unregister");
                         warn_eprintln!("   espanso service register");

*** result: Success
