*** espanso/src/cli/util.rs:60:5: replace prevent_running_as_root_on_macos with ()

*** mutation diff:
--- espanso/src/cli/util.rs
+++ replace prevent_running_as_root_on_macos with ()
@@ -52,22 +52,17 @@
 
         self
     }
 }
 
 // For context, see also this issue: https://github.com/espanso/espanso/issues/648
 #[cfg(target_os = "macos")]
 pub fn prevent_running_as_root_on_macos() {
-    use crate::{error_eprintln, exit_code::UNEXPECTED_RUN_AS_ROOT};
-
-    if unsafe { libc::geteuid() } == 0 {
-        error_eprintln!("Espanso is being run as root, but this can create unwanted side-effects. Please run it as a normal user.");
-        std::process::exit(UNEXPECTED_RUN_AS_ROOT);
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(target_os = "macos"))]
 pub fn prevent_running_as_root_on_macos() {
     // Do nothing on other platforms
 }
 
 // This is needed to make sure the app is NOT subject to "App Translocation" on

*** result: Success
