*** espanso/src/cli/util.rs:62:35: replace == with != in prevent_running_as_root_on_macos

*** mutation diff:
--- espanso/src/cli/util.rs
+++ replace == with != in prevent_running_as_root_on_macos
@@ -54,17 +54,17 @@
     }
 }
 
 // For context, see also this issue: https://github.com/espanso/espanso/issues/648
 #[cfg(target_os = "macos")]
 pub fn prevent_running_as_root_on_macos() {
     use crate::{error_eprintln, exit_code::UNEXPECTED_RUN_AS_ROOT};
 
-    if unsafe { libc::geteuid() } == 0 {
+    if unsafe { libc::geteuid() } != /* ~ changed by cargo-mutants ~ */ 0 {
         error_eprintln!("Espanso is being run as root, but this can create unwanted side-effects. Please run it as a normal user.");
         std::process::exit(UNEXPECTED_RUN_AS_ROOT);
     }
 }
 
 #[cfg(not(target_os = "macos"))]
 pub fn prevent_running_as_root_on_macos() {
     // Do nothing on other platforms

*** result: Success
