*** espanso/src/cli/util.rs:77:5: replace is_subject_to_app_translocation_on_macos -> bool with false

*** mutation diff:
--- espanso/src/cli/util.rs
+++ replace is_subject_to_app_translocation_on_macos -> bool with false
@@ -69,17 +69,10 @@
 pub fn prevent_running_as_root_on_macos() {
     // Do nothing on other platforms
 }
 
 // This is needed to make sure the app is NOT subject to "App Translocation" on
 // macOS, which would make Espanso misbehave on some circumstances.
 // For more information, see: https://github.com/espanso/espanso/issues/844
 pub fn is_subject_to_app_translocation_on_macos() -> bool {
-    if !cfg!(target_os = "macos") {
-        return false;
-    }
-
-    let exec_path = std::env::current_exe().expect("unable to extract executable path");
-    let exec_path = exec_path.to_string_lossy();
-
-    exec_path.contains("/private/")
+    false /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
