*** espanso/src/cli/workaround/mod.rs:35:5: replace workaround_main -> i32 with -1

*** mutation diff:
--- espanso/src/cli/workaround/mod.rs
+++ replace workaround_main -> i32 with -1
@@ -27,28 +27,10 @@
     CliModule {
         subcommand: "workaround".to_string(),
         entry: workaround_main,
         ..Default::default()
     }
 }
 
 fn workaround_main(args: CliModuleArgs) -> i32 {
-    let cli_args = args.cli_args.expect("missing cli_args");
-
-    if cli_args.subcommand_matches("secure-input").is_some() {
-        #[cfg(target_os = "macos")]
-        {
-            use crate::exit_code::WORKAROUND_FAILURE;
-            if let Err(err) = secure_input::run_secure_input_workaround() {
-                error_eprintln!("secure-input workaround reported error: {}", err);
-                return WORKAROUND_FAILURE;
-            }
-        }
-        #[cfg(not(target_os = "macos"))]
-        {
-            error_eprintln!("secure-input workaround is only available on macOS");
-            return crate::exit_code::WORKAROUND_NOT_AVAILABLE;
-        }
-    }
-
-    WORKAROUND_SUCCESS
+    -1 /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
