*** espanso/src/cli/worker/builtin/debug.rs:46:5: replace create_match_paste_active_app_info -> BuiltInMatch with Default::default()

*** mutation diff:
--- espanso/src/cli/worker/builtin/debug.rs
+++ replace create_match_paste_active_app_info -> BuiltInMatch with Default::default()
@@ -38,37 +38,17 @@
                 force_mode: None,
             })
         },
         ..Default::default()
     }
 }
 
 pub fn create_match_paste_active_app_info() -> BuiltInMatch {
-    BuiltInMatch {
-        id: generate_next_builtin_id(),
-        label: "Paste active application information (detect)",
-        triggers: vec!["#pdetect#".to_string()],
-        action: |context| {
-            let info = context.get_active_app_info();
-
-            let dump = format!(
-                "title: '{}'\nexec: '{}'\nclass: '{}'",
-                info.title.unwrap_or_default(),
-                info.exec.unwrap_or_default(),
-                info.class.unwrap_or_default()
-            );
-
-            EventType::TextInject(TextInjectRequest {
-                text: dump,
-                force_mode: None,
-            })
-        },
-        ..Default::default()
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn create_match_show_active_config_info() -> BuiltInMatch {
     BuiltInMatch {
         id: generate_next_builtin_id(),
         label: "Show active config information",
         triggers: vec!["#acfg#".to_string()],
         action: |context| {

*** result: Success
