*** espanso/src/cli/worker/builtin/debug.rs:70:5: replace create_match_show_active_config_info -> BuiltInMatch with Default::default()

*** mutation diff:
--- espanso/src/cli/worker/builtin/debug.rs
+++ replace create_match_show_active_config_info -> BuiltInMatch with Default::default()
@@ -62,30 +62,17 @@
                 force_mode: None,
             })
         },
         ..Default::default()
     }
 }
 
 pub fn create_match_show_active_config_info() -> BuiltInMatch {
-    BuiltInMatch {
-        id: generate_next_builtin_id(),
-        label: "Show active config information",
-        triggers: vec!["#acfg#".to_string()],
-        action: |context| {
-            let dump = context.get_active_config().pretty_dump();
-
-            EventType::ShowText(ShowTextEvent {
-                text: dump,
-                title: "Active configuration".to_string(),
-            })
-        },
-        ..Default::default()
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn create_match_show_active_app_info() -> BuiltInMatch {
     BuiltInMatch {
         id: generate_next_builtin_id(),
         label: "Show active application information (detect)",
         triggers: vec!["#detect#".to_string()],
         action: |context| {

*** result: Success
