*** espanso/src/cli/worker/builtin/mod.rs:55:5: replace get_builtin_matches -> Vec<BuiltInMatch> with vec![Default::default()]

*** mutation diff:
--- espanso/src/cli/worker/builtin/mod.rs
+++ replace get_builtin_matches -> Vec<BuiltInMatch> with vec![Default::default()]
@@ -47,34 +47,17 @@
             triggers: Vec::new(),
             hotkey: None,
             action: |_| EventType::NOOP,
         }
     }
 }
 
 pub fn get_builtin_matches(config: &dyn Config) -> Vec<BuiltInMatch> {
-    let mut matches = vec![
-        debug::create_match_paste_active_config_info(),
-        debug::create_match_paste_active_app_info(),
-        debug::create_match_show_active_config_info(),
-        debug::create_match_show_active_app_info(),
-        debug::create_match_show_logs(),
-        process::create_match_exit(),
-        process::create_match_restart(),
-    ];
-
-    if config.search_trigger().is_some() || config.search_shortcut().is_some() {
-        matches.push(search::create_match_trigger_search_bar(
-            config.search_trigger(),
-            config.search_shortcut(),
-        ));
-    }
-
-    matches
+    vec![Default::default()] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn is_builtin_match(id: i32) -> bool {
     id >= MIN_BUILTIN_MATCH_ID
 }
 
 thread_local! {
   static CURRENT_BUILTIN_MATCH_ID: Cell<i32> = const { Cell::new(MIN_BUILTIN_MATCH_ID) };

*** result: Success
