*** espanso/src/cli/worker/builtin/mod.rs:76:5: replace is_builtin_match -> bool with true

*** mutation diff:
--- espanso/src/cli/worker/builtin/mod.rs
+++ replace is_builtin_match -> bool with true
@@ -68,17 +68,17 @@
             config.search_shortcut(),
         ));
     }
 
     matches
 }
 
 pub fn is_builtin_match(id: i32) -> bool {
-    id >= MIN_BUILTIN_MATCH_ID
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 thread_local! {
   static CURRENT_BUILTIN_MATCH_ID: Cell<i32> = const { Cell::new(MIN_BUILTIN_MATCH_ID) };
 }
 
 fn generate_next_builtin_id() -> i32 {
     CURRENT_BUILTIN_MATCH_ID.with(|value| {

*** result: Success
