*** espanso/src/cli/worker/builtin/search.rs:30:5: replace create_match_trigger_search_bar -> BuiltInMatch with Default::default()

*** mutation diff:
--- espanso/src/cli/worker/builtin/search.rs
+++ replace create_match_trigger_search_bar -> BuiltInMatch with Default::default()
@@ -22,16 +22,10 @@
 use crate::cli::worker::builtin::generate_next_builtin_id;
 
 use super::BuiltInMatch;
 
 pub fn create_match_trigger_search_bar(
     trigger: Option<String>,
     hotkey: Option<String>,
 ) -> BuiltInMatch {
-    BuiltInMatch {
-        id: generate_next_builtin_id(),
-        label: "Open search bar",
-        triggers: trigger.map(|trigger| vec![trigger]).unwrap_or_default(),
-        hotkey,
-        action: |_| EventType::ShowSearchBar,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
