*** espanso/src/cli/worker/config.rs:197:9: replace <impl espanso_engine::process::EnabledStatusProvider for ConfigManager<'_>>::is_config_enabled -> bool with false

*** mutation diff:
--- espanso/src/cli/worker/config.rs
+++ replace <impl espanso_engine::process::EnabledStatusProvider for ConfigManager<'_>>::is_config_enabled -> bool with false
@@ -189,17 +189,17 @@
         }
 
         self.active().undo_backspace()
     }
 }
 
 impl espanso_engine::process::EnabledStatusProvider for ConfigManager<'_> {
     fn is_config_enabled(&self) -> bool {
-        self.active().enable()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl crate::gui::modulo::form::ModuloFormUIOptionProvider for ConfigManager<'_> {
     fn get_post_form_delay(&self) -> usize {
         self.active().post_form_delay()
     }

*** result: Success
