*** espanso/src/cli/worker/config.rs:211:9: replace <impl crate::gui::modulo::form::ModuloFormUIOptionProvider for ConfigManager<'_>>::get_max_form_height -> usize with 0

*** mutation diff:
--- espanso/src/cli/worker/config.rs
+++ replace <impl crate::gui::modulo::form::ModuloFormUIOptionProvider for ConfigManager<'_>>::get_max_form_height -> usize with 0
@@ -203,17 +203,17 @@
         self.active().post_form_delay()
     }
 
     fn get_max_form_width(&self) -> usize {
         self.active().max_form_width()
     }
 
     fn get_max_form_height(&self) -> usize {
-        self.active().max_form_height()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl crate::gui::modulo::search::ModuloSearchUIOptionProvider for ConfigManager<'_> {
     fn get_post_search_delay(&self) -> usize {
         self.active().post_search_delay()
     }
 }

*** result: Success
