*** espanso/src/cli/worker/config.rs:223:9: replace <impl espanso_engine::process::AltCodeSynthEnabledProvider for ConfigManager<'_>>::is_alt_code_synthesizer_enabled -> bool with true

*** mutation diff:
--- espanso/src/cli/worker/config.rs
+++ replace <impl espanso_engine::process::AltCodeSynthEnabledProvider for ConfigManager<'_>>::is_alt_code_synthesizer_enabled -> bool with true
@@ -215,11 +215,11 @@
 impl crate::gui::modulo::search::ModuloSearchUIOptionProvider for ConfigManager<'_> {
     fn get_post_search_delay(&self) -> usize {
         self.active().post_search_delay()
     }
 }
 
 impl espanso_engine::process::AltCodeSynthEnabledProvider for ConfigManager<'_> {
     fn is_alt_code_synthesizer_enabled(&self) -> bool {
-        self.active().emulate_alt_codes()
+        true /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
