*** espanso/src/cli/worker/daemon_monitor.rs:43:5: replace daemon_monitor_main with ()

*** mutation diff:
--- espanso/src/cli/worker/daemon_monitor.rs
+++ replace daemon_monitor_main with ()
@@ -35,29 +35,10 @@
         .spawn(move || {
             daemon_monitor_main(&runtime_dir_clone, exit_notify.clone());
         })?;
 
     Ok(())
 }
 
 fn daemon_monitor_main(runtime_dir: &Path, exit_notify: Sender<ExitMode>) {
-    info!("monitoring the status of the daemon process");
-
-    loop {
-        let is_daemon_lock_free = {
-            let lock = acquire_daemon_lock(runtime_dir);
-            lock.is_some()
-        };
-
-        if is_daemon_lock_free {
-            warn!("detected unexpected daemon termination, sending exit signal to the engine");
-            if let Err(error) = exit_notify.send(ExitMode::Exit) {
-                error!("unable to send daemon exit signal: {}", error);
-            }
-            break;
-        }
-
-        std::thread::sleep(std::time::Duration::from_millis(
-            DAEMON_STATUS_CHECK_INTERVAL,
-        ));
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
