*** espanso/src/cli/worker/engine/caches/app_info_provider.rs:48:34: replace < with > in <impl AppInfoProvider for CachedAppInfoProvider<'_>>::get_info

*** mutation diff:
--- espanso/src/cli/worker/engine/caches/app_info_provider.rs
+++ replace < with > in <impl AppInfoProvider for CachedAppInfoProvider<'_>>::get_info
@@ -40,17 +40,17 @@
         }
     }
 }
 
 impl AppInfoProvider for CachedAppInfoProvider<'_> {
     fn get_info(&self) -> espanso_info::AppInfo {
         let mut cached_info = self.cached_info.borrow_mut();
         if let Some((instant, cached_value)) = &*cached_info {
-            if instant.elapsed() < self.caching_interval {
+            if instant.elapsed() > /* ~ changed by cargo-mutants ~ */ self.caching_interval {
                 // Return cached config
                 return cached_value.clone();
             }
         }
 
         let info = self.app_info_provider.get_info();
         *cached_info = Some((Instant::now(), info.clone()));

*** result: Success
