*** espanso/src/cli/worker/engine/dispatch/executor/clipboard_injector.rs:148:9: replace <impl HtmlInjector for ClipboardInjectorAdapter<'_>>::inject_html -> anyhow::Result<()> with Ok(())

*** mutation diff:
--- espanso/src/cli/worker/engine/dispatch/executor/clipboard_injector.rs
+++ replace <impl HtmlInjector for ClipboardInjectorAdapter<'_>>::inject_html -> anyhow::Result<()> with Ok(())
@@ -140,24 +140,17 @@
         self.send_paste_combination()?;
 
         Ok(())
     }
 }
 
 impl HtmlInjector for ClipboardInjectorAdapter<'_> {
     fn inject_html(&self, html: &str, fallback_text: &str) -> anyhow::Result<()> {
-        let _guard = self.restore_clipboard_guard();
-
-        self.clipboard
-            .set_html(html, Some(fallback_text), &self.get_operation_options())?;
-
-        self.send_paste_combination()?;
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl ImageInjector for ClipboardInjectorAdapter<'_> {
     fn inject_image(&self, image_path: &str) -> anyhow::Result<()> {
         let path = PathBuf::from(image_path);
         if !path.is_file() {
             return Err(std::io::Error::new(

*** result: Success
