*** espanso/src/cli/worker/engine/dispatch/executor/clipboard_injector.rs:161:9: replace <impl ImageInjector for ClipboardInjectorAdapter<'_>>::inject_image -> anyhow::Result<()> with Ok(())

*** mutation diff:
--- espanso/src/cli/worker/engine/dispatch/executor/clipboard_injector.rs
+++ replace <impl ImageInjector for ClipboardInjectorAdapter<'_>>::inject_image -> anyhow::Result<()> with Ok(())
@@ -153,33 +153,17 @@
         self.send_paste_combination()?;
 
         Ok(())
     }
 }
 
 impl ImageInjector for ClipboardInjectorAdapter<'_> {
     fn inject_image(&self, image_path: &str) -> anyhow::Result<()> {
-        let path = PathBuf::from(image_path);
-        if !path.is_file() {
-            return Err(std::io::Error::new(
-                std::io::ErrorKind::NotFound,
-                "image can't be found in the given path",
-            )
-            .into());
-        }
-
-        let _guard = self.restore_clipboard_guard();
-
-        self.clipboard
-            .set_image(&path, &self.get_operation_options())?;
-
-        self.send_paste_combination()?;
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 struct ClipboardRestoreGuard<'a> {
     clipboard: &'a dyn Clipboard,
     content: Option<String>,
     restore_delay: u64,
     clipboard_operation_options: ClipboardOperationOptions,

*** result: Success
