*** espanso/src/cli/worker/engine/dispatch/executor/clipboard_injector.rs:207:9: replace <impl Drop for ClipboardRestoreGuard<'_>>::drop with ()

*** mutation diff:
--- espanso/src/cli/worker/engine/dispatch/executor/clipboard_injector.rs
+++ replace <impl Drop for ClipboardRestoreGuard<'_>>::drop with ()
@@ -199,31 +199,17 @@
             restore_delay,
             clipboard_operation_options,
         }
     }
 }
 
 impl Drop for ClipboardRestoreGuard<'_> {
     fn drop(&mut self) {
-        if let Some(content) = self.content.take() {
-            // Sometimes an expansion gets overwritten before pasting by the previous content
-            // A delay is needed to mitigate the problem
-            std::thread::sleep(std::time::Duration::from_millis(self.restore_delay));
-
-            if let Err(error) = self
-                .clipboard
-                .set_text(&content, &self.clipboard_operation_options)
-            {
-                error!(
-                    "unable to restore clipboard content after expansion: {}",
-                    error
-                );
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn parse_combination(combination: &str) -> Option<Vec<Key>> {
     let tokens = combination.split('+');
     let mut keys: Vec<Key> = Vec::new();
     for token in tokens {
         keys.push(Key::parse(token)?);

*** result: Success
