*** espanso/src/cli/worker/engine/dispatch/executor/clipboard_injector.rs:226:5: replace parse_combination -> Option<Vec<Key>> with None

*** mutation diff:
--- espanso/src/cli/worker/engine/dispatch/executor/clipboard_injector.rs
+++ replace parse_combination -> Option<Vec<Key>> with None
@@ -218,16 +218,10 @@
                     error
                 );
             }
         }
     }
 }
 
 fn parse_combination(combination: &str) -> Option<Vec<Key>> {
-    let tokens = combination.split('+');
-    let mut keys: Vec<Key> = Vec::new();
-    for token in tokens {
-        keys.push(Key::parse(token)?);
-    }
-
-    Some(keys)
+    None /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
