*** espanso/src/cli/worker/engine/dispatch/executor/text_ui.rs:43:9: replace <impl TextUIHandler for TextUIHandlerAdapter<'_>>::show_logs -> anyhow::Result<()> with Ok(())

*** mutation diff:
--- espanso/src/cli/worker/engine/dispatch/executor/text_ui.rs
+++ replace <impl TextUIHandler for TextUIHandlerAdapter<'_>>::show_logs -> anyhow::Result<()> with Ok(())
@@ -35,13 +35,11 @@
 
 impl TextUIHandler for TextUIHandlerAdapter<'_> {
     fn show_text(&self, title: &str, text: &str) -> anyhow::Result<()> {
         self.text_ui.show_text(title, text)?;
         Ok(())
     }
 
     fn show_logs(&self) -> anyhow::Result<()> {
-        self.text_ui
-            .show_file("Espanso Logs", &self.paths.runtime.join("espanso.log"))?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
