*** espanso/src/cli/worker/engine/funnel/exit.rs:49:9: replace <impl funnel::Source<'a> for ExitSource<'a>>::receive -> Option<Event> with None

*** mutation diff:
--- espanso/src/cli/worker/engine/funnel/exit.rs
+++ replace <impl funnel::Source<'a> for ExitSource<'a>>::receive -> Option<Event> with None
@@ -41,17 +41,11 @@
 }
 
 impl<'a> funnel::Source<'a> for ExitSource<'a> {
     fn register(&'a self, select: &mut Select<'a>) -> usize {
         select.recv(&self.exit_signal)
     }
 
     fn receive(&self, op: SelectedOperation) -> Option<Event> {
-        let mode = op
-            .recv(&self.exit_signal)
-            .expect("unable to select data from ExitSource receiver");
-        Some(Event {
-            source_id: self.sequencer.next_id(),
-            etype: EventType::ExitRequested(mode),
-        })
+        None /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
