*** espanso/src/cli/worker/engine/funnel/key_state.rs:104:9: replace KeyStatus::is_outdated -> bool with false

*** mutation diff:
--- espanso/src/cli/worker/engine/funnel/key_state.rs
+++ replace KeyStatus::is_outdated -> bool with false
@@ -96,22 +96,17 @@
         }
     }
 
     fn is_pressed(&self) -> bool {
         self.pressed_at.is_some()
     }
 
     fn is_outdated(&self) -> bool {
-        let now = Instant::now();
-        if let Some(pressed_at) = self.pressed_at {
-            now.duration_since(pressed_at) > KEY_PRESS_EVENT_INVALIDATION_TIMEOUT
-        } else {
-            false
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn release(&mut self) {
         self.pressed_at = None;
     }
 
     fn press(&mut self) {
         self.pressed_at = Some(Instant::now());

*** result: Success
