*** espanso/src/cli/worker/engine/funnel/key_state.rs:113:9: replace KeyStatus::release with ()

*** mutation diff:
--- espanso/src/cli/worker/engine/funnel/key_state.rs
+++ replace KeyStatus::release with ()
@@ -105,17 +105,17 @@
         if let Some(pressed_at) = self.pressed_at {
             now.duration_since(pressed_at) > KEY_PRESS_EVENT_INVALIDATION_TIMEOUT
         } else {
             false
         }
     }
 
     fn release(&mut self) {
-        self.pressed_at = None;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn press(&mut self) {
         self.pressed_at = Some(Instant::now());
     }
 }
 
 impl KeyboardStateProvider for KeyStateStore {

*** result: Success
