*** espanso/src/cli/worker/engine/funnel/key_state.rs:123:9: replace <impl KeyboardStateProvider for KeyStateStore>::is_key_pressed -> bool with true

*** mutation diff:
--- espanso/src/cli/worker/engine/funnel/key_state.rs
+++ replace <impl KeyboardStateProvider for KeyStateStore>::is_key_pressed -> bool with true
@@ -115,11 +115,11 @@
 
     fn press(&mut self) {
         self.pressed_at = Some(Instant::now());
     }
 }
 
 impl KeyboardStateProvider for KeyStateStore {
     fn is_key_pressed(&self, code: u32) -> bool {
-        self.is_key_pressed(code)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
