*** espanso/src/cli/worker/engine/funnel/mod.rs:147:5: replace get_modifier_status -> Option<(Modifier, bool)> with None

*** mutation diff:
--- espanso/src/cli/worker/engine/funnel/mod.rs
+++ replace get_modifier_status -> Option<(Modifier, bool)> with None
@@ -139,28 +139,10 @@
     #[error("detection thread initialization failed")]
     ThreadInitFailed,
 
     #[error("detection source initialization failed")]
     InitFailed,
 }
 
 fn get_modifier_status(event: &InputEvent) -> Option<(Modifier, bool)> {
-    match event {
-        InputEvent::Keyboard(KeyboardEvent {
-            key,
-            status,
-            value: _,
-            variant: _,
-            code: _,
-        }) => {
-            let is_pressed = *status == Status::Pressed;
-            match key {
-                espanso_detect::event::Key::Alt => Some((Modifier::Alt, is_pressed)),
-                espanso_detect::event::Key::Control => Some((Modifier::Ctrl, is_pressed)),
-                espanso_detect::event::Key::Meta => Some((Modifier::Meta, is_pressed)),
-                espanso_detect::event::Key::Shift => Some((Modifier::Shift, is_pressed)),
-                _ => None,
-            }
-        }
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
