*** espanso/src/cli/worker/engine/funnel/mod.rs:148:9: delete match arm

*** mutation diff:
--- espanso/src/cli/worker/engine/funnel/mod.rs
+++ delete match arm
@@ -140,27 +140,12 @@
     ThreadInitFailed,
 
     #[error("detection source initialization failed")]
     InitFailed,
 }
 
 fn get_modifier_status(event: &InputEvent) -> Option<(Modifier, bool)> {
     match event {
-        InputEvent::Keyboard(KeyboardEvent {
-            key,
-            status,
-            value: _,
-            variant: _,
-            code: _,
-        }) => {
-            let is_pressed = *status == Status::Pressed;
-            match key {
-                espanso_detect::event::Key::Alt => Some((Modifier::Alt, is_pressed)),
-                espanso_detect::event::Key::Control => Some((Modifier::Ctrl, is_pressed)),
-                espanso_detect::event::Key::Meta => Some((Modifier::Meta, is_pressed)),
-                espanso_detect::event::Key::Shift => Some((Modifier::Shift, is_pressed)),
-                _ => None,
-            }
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }

*** result: Success
