*** espanso/src/cli/worker/engine/funnel/mod.rs:155:38: replace == with != in get_modifier_status

*** mutation diff:
--- espanso/src/cli/worker/engine/funnel/mod.rs
+++ replace == with != in get_modifier_status
@@ -147,17 +147,17 @@
     match event {
         InputEvent::Keyboard(KeyboardEvent {
             key,
             status,
             value: _,
             variant: _,
             code: _,
         }) => {
-            let is_pressed = *status == Status::Pressed;
+            let is_pressed = *status != /* ~ changed by cargo-mutants ~ */ Status::Pressed;
             match key {
                 espanso_detect::event::Key::Alt => Some((Modifier::Alt, is_pressed)),
                 espanso_detect::event::Key::Control => Some((Modifier::Ctrl, is_pressed)),
                 espanso_detect::event::Key::Meta => Some((Modifier::Meta, is_pressed)),
                 espanso_detect::event::Key::Shift => Some((Modifier::Shift, is_pressed)),
                 _ => None,
             }
         }

*** result: Success
