*** espanso/src/cli/worker/engine/funnel/ui.rs:50:9: replace <impl funnel::Source<'a> for UISource<'a>>::receive -> Option<Event> with None

*** mutation diff:
--- espanso/src/cli/worker/engine/funnel/ui.rs
+++ replace <impl funnel::Source<'a> for UISource<'a>>::receive -> Option<Event> with None
@@ -42,24 +42,11 @@
 }
 
 impl<'a> funnel::Source<'a> for UISource<'a> {
     fn register(&'a self, select: &mut Select<'a>) -> usize {
         select.recv(&self.ui_receiver)
     }
 
     fn receive(&self, op: SelectedOperation) -> Option<Event> {
-        let ui_event = op
-            .recv(&self.ui_receiver)
-            .expect("unable to select data from UISource receiver");
-
-        Some(Event {
-            source_id: self.sequencer.next_id(),
-            etype: match ui_event {
-                UIEvent::TrayIconClick => EventType::TrayIconClicked,
-                UIEvent::ContextMenuClick(context_item_id) => {
-                    EventType::ContextMenuClicked(ContextMenuClickedEvent { context_item_id })
-                }
-                UIEvent::Heartbeat => EventType::Heartbeat,
-            },
-        })
+        None /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
