*** espanso/src/cli/worker/engine/keyboard_layout_util.rs:25:5: replace generate_rmlvo_config -> Option<RMLVOConfig> with Some(Default::default())

*** mutation diff:
--- espanso/src/cli/worker/engine/keyboard_layout_util.rs
+++ replace generate_rmlvo_config -> Option<RMLVOConfig> with Some(Default::default())
@@ -17,36 +17,17 @@
  * along with espanso.  If not, see <https://www.gnu.org/licenses/>.
  */
 
 use espanso_config::config::{Config, RMLVOConfig};
 use log::{info, warn};
 
 fn generate_rmlvo_config(config: &dyn Config) -> Option<RMLVOConfig> {
     // Not needed on Windows and macOS
-    if !cfg!(target_os = "linux") {
-        return None;
-    }
-
-    // Not needed on X11
-    if !cfg!(feature = "wayland") {
-        return None;
-    }
-
-    if let Some(keyboard_config) = config.keyboard_layout() {
-        Some(keyboard_config)
-    } else if let Some(active_layout) = espanso_detect::get_active_layout() {
-        Some(RMLVOConfig {
-            layout: Some(active_layout),
-            ..Default::default()
-        })
-    } else {
-        warn!("unable to determine keyboard layout automatically, please explicitly specify it in the configuration.");
-        None
-    }
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn generate_detect_rmlvo(config: &dyn Config) -> Option<espanso_detect::KeyboardConfig> {
     generate_rmlvo_config(config)
         .map(|config| {
             info!("detection module will use this keyboard layout: {}", config);
             config
         })

*** result: Success
