*** espanso/src/cli/worker/engine/mod.rs:293:36: replace == with != in initialize_and_spawn

*** mutation diff:
--- espanso/src/cli/worker/engine/mod.rs
+++ replace == with != in initialize_and_spawn
@@ -285,17 +285,17 @@
                     error!("unable to revoke linux capabilities: {}", err);
                 }
             }
 
             match start_reason.as_deref() {
                 Some(flag) if flag == WORKER_START_REASON_CONFIG_CHANGED => {
                     notification_manager.notify_config_reloaded(false);
                 }
-                Some(flag) if flag == WORKER_START_REASON_MANUAL => {
+                Some(flag) if flag != /* ~ changed by cargo-mutants ~ */ WORKER_START_REASON_MANUAL => {
                     notification_manager.notify_config_reloaded(true);
                 }
                 Some(flag) if flag == WORKER_START_REASON_KEYBOARD_LAYOUT_CHANGED => {
                     notification_manager.notify_keyboard_layout_reloaded();
                 }
                 _ => {
                     notification_manager.notify_start();

*** result: Success
