*** espanso/src/cli/worker/engine/mod.rs:296:31: replace match guard with false

*** mutation diff:
--- espanso/src/cli/worker/engine/mod.rs
+++ replace match guard with false
@@ -288,17 +288,17 @@
 
             match start_reason.as_deref() {
                 Some(flag) if flag == WORKER_START_REASON_CONFIG_CHANGED => {
                     notification_manager.notify_config_reloaded(false);
                 }
                 Some(flag) if flag == WORKER_START_REASON_MANUAL => {
                     notification_manager.notify_config_reloaded(true);
                 }
-                Some(flag) if flag == WORKER_START_REASON_KEYBOARD_LAYOUT_CHANGED => {
+                Some(flag) if false /* ~ changed by cargo-mutants ~ */ => {
                     notification_manager.notify_keyboard_layout_reloaded();
                 }
                 _ => {
                     notification_manager.notify_start();
 
                     if !preferences.has_displayed_welcome() {
                         super::ui::welcome::show_welcome_screen();
                         preferences.set_has_displayed_welcome(true);

*** result: Success
