*** espanso/src/cli/worker/engine/mod.rs:322:5: replace grant_linux_capabilities -> bool with false

*** mutation diff:
--- espanso/src/cli/worker/engine/mod.rs
+++ replace grant_linux_capabilities -> bool with false
@@ -314,37 +314,10 @@
 
             exit_mode
         })?;
 
     Ok(handle)
 }
 
 fn grant_linux_capabilities(use_evdev_backend: bool) -> bool {
-    if use_evdev_backend {
-        if crate::capabilities::can_use_capabilities() {
-            debug!("using linux capabilities to grant permissions needed by EVDEV backend");
-            if let Err(err) = crate::capabilities::grant_capabilities() {
-                error!("unable to grant CAP_DAC_OVERRIDE capability: {}", err);
-                false
-            } else {
-                debug!("successfully granted permissions using capabilities");
-                true
-            }
-        } else {
-            warn!("EVDEV backend is being used, but without enabling linux capabilities.");
-            warn!("  Although you CAN run espanso EVDEV backend as root, it's not recommended due");
-            warn!(
-        "  to security reasons. Espanso supports linux capabilities to limit the attack surface"
-      );
-            warn!(
-                "  area by only leveraging on the CAP_DAC_OVERRIDE capability (needed to work with"
-            );
-            warn!(
-                "  /dev/input/* devices to detect and inject text) and disabling it as soon as the"
-            );
-            warn!("  initial setup is completed.");
-            false
-        }
-    } else {
-        false
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
