*** espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs:100:9: delete match arm

*** mutation diff:
--- espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs
+++ delete match arm
@@ -92,12 +92,12 @@
         Key::F13 => espanso_match::event::Key::F13,
         Key::F14 => espanso_match::event::Key::F14,
         Key::F15 => espanso_match::event::Key::F15,
         Key::F16 => espanso_match::event::Key::F16,
         Key::F17 => espanso_match::event::Key::F17,
         Key::F18 => espanso_match::event::Key::F18,
         Key::F19 => espanso_match::event::Key::F19,
         Key::F20 => espanso_match::event::Key::F20,
-        Key::Other(_) => espanso_match::event::Key::Other,
+         /* ~ changed by cargo-mutants ~ */
         _ => espanso_match::event::Key::Other,
     }
 }

*** result: Success
