*** espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs:61:9: delete match arm

*** mutation diff:
--- espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs
+++ delete match arm
@@ -53,17 +53,17 @@
         left_separator: result.left_separator,
         right_separator: result.right_separator,
         args: result.vars,
     }
 }
 
 pub fn convert_to_match_key(key: Key) -> espanso_match::event::Key {
     match key {
-        Key::Alt => espanso_match::event::Key::Alt,
+         /* ~ changed by cargo-mutants ~ */
         Key::CapsLock => espanso_match::event::Key::CapsLock,
         Key::Control => espanso_match::event::Key::Control,
         Key::Meta => espanso_match::event::Key::Meta,
         Key::NumLock => espanso_match::event::Key::NumLock,
         Key::Shift => espanso_match::event::Key::Shift,
         Key::Enter => espanso_match::event::Key::Enter,
         Key::Tab => espanso_match::event::Key::Tab,
         Key::Space => espanso_match::event::Key::Space,

*** result: Success
