*** espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs:71:9: delete match arm

*** mutation diff:
--- espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs
+++ delete match arm
@@ -63,17 +63,17 @@
         Key::Control => espanso_match::event::Key::Control,
         Key::Meta => espanso_match::event::Key::Meta,
         Key::NumLock => espanso_match::event::Key::NumLock,
         Key::Shift => espanso_match::event::Key::Shift,
         Key::Enter => espanso_match::event::Key::Enter,
         Key::Tab => espanso_match::event::Key::Tab,
         Key::Space => espanso_match::event::Key::Space,
         Key::ArrowDown => espanso_match::event::Key::ArrowDown,
-        Key::ArrowLeft => espanso_match::event::Key::ArrowLeft,
+         /* ~ changed by cargo-mutants ~ */
         Key::ArrowRight => espanso_match::event::Key::ArrowRight,
         Key::ArrowUp => espanso_match::event::Key::ArrowUp,
         Key::End => espanso_match::event::Key::End,
         Key::Home => espanso_match::event::Key::Home,
         Key::PageDown => espanso_match::event::Key::PageDown,
         Key::PageUp => espanso_match::event::Key::PageUp,
         Key::Escape => espanso_match::event::Key::Escape,
         Key::Backspace => espanso_match::event::Key::Backspace,

*** result: Success
