*** espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs:76:9: delete match arm

*** mutation diff:
--- espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs
+++ delete match arm
@@ -68,17 +68,17 @@
         Key::Tab => espanso_match::event::Key::Tab,
         Key::Space => espanso_match::event::Key::Space,
         Key::ArrowDown => espanso_match::event::Key::ArrowDown,
         Key::ArrowLeft => espanso_match::event::Key::ArrowLeft,
         Key::ArrowRight => espanso_match::event::Key::ArrowRight,
         Key::ArrowUp => espanso_match::event::Key::ArrowUp,
         Key::End => espanso_match::event::Key::End,
         Key::Home => espanso_match::event::Key::Home,
-        Key::PageDown => espanso_match::event::Key::PageDown,
+         /* ~ changed by cargo-mutants ~ */
         Key::PageUp => espanso_match::event::Key::PageUp,
         Key::Escape => espanso_match::event::Key::Escape,
         Key::Backspace => espanso_match::event::Key::Backspace,
         Key::F1 => espanso_match::event::Key::F1,
         Key::F2 => espanso_match::event::Key::F2,
         Key::F3 => espanso_match::event::Key::F3,
         Key::F4 => espanso_match::event::Key::F4,
         Key::F5 => espanso_match::event::Key::F5,

*** result: Success
