*** espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs:81:9: delete match arm

*** mutation diff:
--- espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs
+++ delete match arm
@@ -73,17 +73,17 @@
         Key::ArrowUp => espanso_match::event::Key::ArrowUp,
         Key::End => espanso_match::event::Key::End,
         Key::Home => espanso_match::event::Key::Home,
         Key::PageDown => espanso_match::event::Key::PageDown,
         Key::PageUp => espanso_match::event::Key::PageUp,
         Key::Escape => espanso_match::event::Key::Escape,
         Key::Backspace => espanso_match::event::Key::Backspace,
         Key::F1 => espanso_match::event::Key::F1,
-        Key::F2 => espanso_match::event::Key::F2,
+         /* ~ changed by cargo-mutants ~ */
         Key::F3 => espanso_match::event::Key::F3,
         Key::F4 => espanso_match::event::Key::F4,
         Key::F5 => espanso_match::event::Key::F5,
         Key::F6 => espanso_match::event::Key::F6,
         Key::F7 => espanso_match::event::Key::F7,
         Key::F8 => espanso_match::event::Key::F8,
         Key::F9 => espanso_match::event::Key::F9,
         Key::F10 => espanso_match::event::Key::F10,

*** result: Success
