*** espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs:86:9: delete match arm

*** mutation diff:
--- espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs
+++ delete match arm
@@ -78,17 +78,17 @@
         Key::Escape => espanso_match::event::Key::Escape,
         Key::Backspace => espanso_match::event::Key::Backspace,
         Key::F1 => espanso_match::event::Key::F1,
         Key::F2 => espanso_match::event::Key::F2,
         Key::F3 => espanso_match::event::Key::F3,
         Key::F4 => espanso_match::event::Key::F4,
         Key::F5 => espanso_match::event::Key::F5,
         Key::F6 => espanso_match::event::Key::F6,
-        Key::F7 => espanso_match::event::Key::F7,
+         /* ~ changed by cargo-mutants ~ */
         Key::F8 => espanso_match::event::Key::F8,
         Key::F9 => espanso_match::event::Key::F9,
         Key::F10 => espanso_match::event::Key::F10,
         Key::F11 => espanso_match::event::Key::F11,
         Key::F12 => espanso_match::event::Key::F12,
         Key::F13 => espanso_match::event::Key::F13,
         Key::F14 => espanso_match::event::Key::F14,
         Key::F15 => espanso_match::event::Key::F15,

*** result: Success
