*** espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs:95:9: delete match arm

*** mutation diff:
--- espanso/src/cli/worker/engine/process/middleware/matcher/mod.rs
+++ delete match arm
@@ -87,17 +87,17 @@
         Key::F8 => espanso_match::event::Key::F8,
         Key::F9 => espanso_match::event::Key::F9,
         Key::F10 => espanso_match::event::Key::F10,
         Key::F11 => espanso_match::event::Key::F11,
         Key::F12 => espanso_match::event::Key::F12,
         Key::F13 => espanso_match::event::Key::F13,
         Key::F14 => espanso_match::event::Key::F14,
         Key::F15 => espanso_match::event::Key::F15,
-        Key::F16 => espanso_match::event::Key::F16,
+         /* ~ changed by cargo-mutants ~ */
         Key::F17 => espanso_match::event::Key::F17,
         Key::F18 => espanso_match::event::Key::F18,
         Key::F19 => espanso_match::event::Key::F19,
         Key::F20 => espanso_match::event::Key::F20,
         Key::Other(_) => espanso_match::event::Key::Other,
         _ => espanso_match::event::Key::Other,
     }
 }

*** result: Success
