*** espanso/src/cli/worker/engine/process/middleware/render/extension/choice.rs:46:5: replace convert_items -> Vec<SearchItem> with vec![]

*** mutation diff:
--- espanso/src/cli/worker/engine/process/middleware/render/extension/choice.rs
+++ replace convert_items -> Vec<SearchItem> with vec![]
@@ -38,19 +38,10 @@
             Ok(Some(choice)) => ChoiceSelectorResult::Success(choice),
             Ok(None) => ChoiceSelectorResult::Aborted,
             Err(err) => ChoiceSelectorResult::Error(err),
         }
     }
 }
 
 fn convert_items(choices: &[espanso_render::extension::choice::Choice]) -> Vec<SearchItem> {
-    choices
-        .iter()
-        .map(|choice| SearchItem {
-            id: choice.id.to_string(),
-            label: choice.label.to_string(),
-            tag: None,
-            additional_search_terms: vec![],
-            is_builtin: false,
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
