*** espanso/src/cli/worker/engine/process/middleware/render/extension/form.rs:110:9: delete match arm

*** mutation diff:
--- espanso/src/cli/worker/engine/process/middleware/render/extension/form.rs
+++ delete match arm
@@ -102,23 +102,17 @@
 }
 
 fn extract_values(value: &Value, trim_string_values: Option<&Value>) -> Option<Vec<String>> {
     let trim_string_values = *trim_string_values
         .and_then(|v| v.as_bool())
         .unwrap_or(&true);
 
     match value {
-        Value::Array(values) => Some(
-            values
-                .iter()
-                .filter_map(|choice| choice.as_string())
-                .cloned()
-                .collect(),
-        ),
+         /* ~ changed by cargo-mutants ~ */
         Value::String(values) => Some(
             values
                 .lines()
                 .filter_map(|line| {
                     if trim_string_values {
                         let trimmed_line = line.trim();
                         if trimmed_line.is_empty() {
                             None

*** result: Success
