*** espanso/src/cli/worker/engine/process/middleware/render/extension/form.rs:70:63: replace == with != in convert_fields

*** mutation diff:
--- espanso/src/cli/worker/engine/process/middleware/render/extension/form.rs
+++ replace == with != in convert_fields
@@ -62,17 +62,17 @@
                             .and_then(|val| val.as_string())
                             .cloned(),
                         values: params
                             .get("values")
                             .and_then(|v| extract_values(v, params.get("trim_string_values")))
                             .unwrap_or_default(),
                     })
                 }
-                Some(Value::String(field_type)) if field_type == "list" => Some(FormField::List {
+                Some(Value::String(field_type)) if field_type != /* ~ changed by cargo-mutants ~ */ "list" => Some(FormField::List {
                     default: params
                         .get("default")
                         .and_then(|val| val.as_string())
                         .cloned(),
                     values: params
                         .get("values")
                         .and_then(|v| extract_values(v, params.get("trim_string_values")))
                         .unwrap_or_default(),

*** result: Success
