*** espanso/src/cli/worker/engine/process/middleware/render/mod.rs:101:5: replace generate_context -> Context<'a> with Default::default()

*** mutation diff:
--- espanso/src/cli/worker/engine/process/middleware/render/mod.rs
+++ replace generate_context -> Context<'a> with Default::default()
@@ -93,35 +93,17 @@
     global_vars_map
 }
 
 fn generate_context<'a>(
     match_set: &MatchSet,
     template_map: &'a HashMap<i32, Option<Template>>,
     global_vars_map: &'a HashMap<i32, Variable>,
 ) -> Context<'a> {
-    let mut templates = Vec::new();
-    let mut global_vars = Vec::new();
-
-    for m in &match_set.matches {
-        if let Some(Some(template)) = template_map.get(&m.id) {
-            templates.push(template);
-        }
-    }
-
-    for var in &match_set.global_vars {
-        if let Some(var) = global_vars_map.get(&var.id) {
-            global_vars.push(var);
-        }
-    }
-
-    Context {
-        global_vars,
-        templates,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 // TODO: move conversion methods to new file?
 
 fn convert_to_template(m: &Match) -> Option<Template> {
     if let MatchEffect::Text(text_effect) = &m.effect {
         let ids = if let MatchCause::Trigger(cause) = &m.cause {
             cause.triggers.clone()

*** result: Success
