*** espanso/src/cli/worker/engine/process/middleware/render/mod.rs:265:5: replace is_propagate_case -> bool with false

*** mutation diff:
--- espanso/src/cli/worker/engine/process/middleware/render/mod.rs
+++ replace is_propagate_case -> bool with false
@@ -257,21 +257,17 @@
     if let MatchCause::Trigger(cause) = &m.cause {
         Some(cause.uppercase_style.clone())
     } else {
         None
     }
 }
 
 fn is_propagate_case(m: &Match) -> bool {
-    if let MatchCause::Trigger(cause) = &m.cause {
-        cause.propagate_case
-    } else {
-        false
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn calculate_casing_style(
     trigger: &str,
     uppercasing_style: Option<UpperCasingStyle>,
 ) -> CasingStyle {
     let mut first_alphabetic = None;
     let mut second_alphabetic = None;

*** result: Success
