*** espanso/src/cli/worker/engine/process/middleware/render/mod.rs:308:17: delete match arm

*** mutation diff:
--- espanso/src/cli/worker/engine/process/middleware/render/mod.rs
+++ delete match arm
@@ -300,17 +300,17 @@
                     }
                 }
             } else {
                 CasingStyle::None
             }
         } else if first.is_uppercase() {
             match uppercasing_style {
                 Some(UpperCasingStyle::Capitalize) => CasingStyle::Capitalize,
-                Some(UpperCasingStyle::CapitalizeWords) => CasingStyle::CapitalizeWords,
+                 /* ~ changed by cargo-mutants ~ */
                 _ => CasingStyle::Uppercase,
             }
         } else {
             CasingStyle::None
         }
     } else {
         CasingStyle::None
     }

*** result: Success
