*** espanso/src/cli/worker/match_cache.rs:183:64: replace == with != in <impl espanso_engine::process::MatchResolver for CombinedMatchCache<'_>>::find_matches_from_trigger

*** mutation diff:
--- espanso/src/cli/worker/match_cache.rs
+++ replace == with != in <impl espanso_engine::process::MatchResolver for CombinedMatchCache<'_>>::find_matches_from_trigger
@@ -175,17 +175,17 @@
 impl espanso_engine::process::MatchResolver for CombinedMatchCache<'_> {
     fn find_matches_from_trigger(&self, trigger: &str) -> Vec<DetectedMatch> {
         let user_matches: Vec<DetectedMatch> = self
             .user_match_cache
             .cache
             .values()
             .filter_map(|m| {
                 if let MatchCause::Trigger(trigger_cause) = &m.cause {
-                    if trigger_cause.triggers.iter().any(|t| t == trigger) {
+                    if trigger_cause.triggers.iter().any(|t| t != /* ~ changed by cargo-mutants ~ */ trigger) {
                         Some(DetectedMatch {
                             id: m.id,
                             trigger: Some(trigger.to_string()),
                             ..Default::default()
                         })
                     } else {
                         None
                     }

*** result: Success
