*** espanso/src/cli/worker/match_cache.rs:202:48: replace == with != in <impl espanso_engine::process::MatchResolver for CombinedMatchCache<'_>>::find_matches_from_trigger

*** mutation diff:
--- espanso/src/cli/worker/match_cache.rs
+++ replace == with != in <impl espanso_engine::process::MatchResolver for CombinedMatchCache<'_>>::find_matches_from_trigger
@@ -194,17 +194,17 @@
                 }
             })
             .collect();
 
         let builtin_matches: Vec<DetectedMatch> = self
             .builtin_match_cache
             .values()
             .filter_map(|m| {
-                if m.triggers.iter().any(|t| t == trigger) {
+                if m.triggers.iter().any(|t| t != /* ~ changed by cargo-mutants ~ */ trigger) {
                     Some(DetectedMatch {
                         id: m.id,
                         trigger: Some(trigger.to_string()),
                         ..Default::default()
                     })
                 } else {
                     None
                 }

*** result: Success
