*** espanso/src/cli/worker/ui/util.rs:25:5: replace convert_icon_paths_to_tray_vec -> Vec<(TrayIcon, String)> with vec![]

*** mutation diff:
--- espanso/src/cli/worker/ui/util.rs
+++ replace convert_icon_paths_to_tray_vec -> Vec<(TrayIcon, String)> with vec![]
@@ -17,27 +17,10 @@
  * along with espanso.  If not, see <https://www.gnu.org/licenses/>.
  */
 
 use espanso_ui::icons::TrayIcon;
 
 use crate::icon::IconPaths;
 
 pub fn convert_icon_paths_to_tray_vec(icon_paths: &IconPaths) -> Vec<(TrayIcon, String)> {
-    let mut paths = Vec::new();
-
-    if let Some(normal) = &icon_paths.tray_icon_normal {
-        paths.push((TrayIcon::Normal, normal.to_string_lossy().to_string()));
-    }
-
-    if let Some(disabled) = &icon_paths.tray_icon_disabled {
-        paths.push((TrayIcon::Disabled, disabled.to_string_lossy().to_string()));
-    }
-
-    if let Some(system_disabled) = &icon_paths.tray_icon_system_disabled {
-        paths.push((
-            TrayIcon::SystemDisabled,
-            system_disabled.to_string_lossy().to_string(),
-        ));
-    }
-
-    paths
+    vec![] /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
