*** espanso/src/cli/worker/ui/welcome.rs:22:5: replace show_welcome_screen with ()

*** mutation diff:
--- espanso/src/cli/worker/ui/welcome.rs
+++ replace show_welcome_screen with ()
@@ -14,22 +14,15 @@
  * GNU General Public License for more details.
  *
  * You should have received a copy of the GNU General Public License
  * along with espanso.  If not, see <https://www.gnu.org/licenses/>.
  */
 
 #[cfg(feature = "modulo")]
 pub fn show_welcome_screen() {
-    let espanso_exe_path = std::env::current_exe().expect("unable to determine executable path");
-    let mut command = std::process::Command::new(espanso_exe_path.to_string_lossy().to_string());
-    command.args(["modulo", "welcome"]);
-
-    let _ = command
-        .spawn()
-        .expect("unable to show welcome screen")
-        .wait();
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(feature = "modulo"))]
 pub fn show_welcome_screen() {
     // NOOP
 }

*** result: Success
