*** espanso/src/config.rs:33:8: delete ! in populate_default_config

*** mutation diff:
--- espanso/src/config.rs
+++ delete ! in populate_default_config
@@ -25,17 +25,17 @@
 };
 use log::{error, info, warn};
 use std::path::Path;
 
 const DEFAULT_CONFIG_FILE_CONTENT: &str = include_str!("./res/config/default.yml");
 const DEFAULT_MATCH_FILE_CONTENT: &str = include_str!("./res/config/base.yml");
 
 pub fn populate_default_config(config_dir: &Path) -> Result<()> {
-    if !config_dir.is_dir() {
+    if  /* ~ changed by cargo-mutants ~ */config_dir.is_dir() {
         info!(
             "generating base configuration directory in: {:?}",
             config_dir
         );
         std::fs::create_dir_all(config_dir)?;
     }
 
     let sub_config_dir = config_dir.join("config");

*** result: Success
