*** espanso/src/config.rs:56:8: delete ! in populate_default_config

*** mutation diff:
--- espanso/src/config.rs
+++ delete ! in populate_default_config
@@ -48,17 +48,17 @@
     if !sub_match_dir.is_dir() {
         info!("generating match directory in: {:?}", sub_match_dir);
         std::fs::create_dir_all(&sub_match_dir)?;
     }
 
     let default_file = sub_config_dir.join("default.yml");
     let match_file = sub_match_dir.join("base.yml");
 
-    if !default_file.is_file() {
+    if  /* ~ changed by cargo-mutants ~ */default_file.is_file() {
         info!(
             "populating default.yml file with initial content: {:?}",
             default_file
         );
         std::fs::write(default_file, DEFAULT_CONFIG_FILE_CONTENT)?;
     }
     if !match_file.is_file() {
         info!(

*** result: Success
