*** espanso/src/gui/modulo/textview.rs:43:9: replace <impl TextUI for ModuloTextUI<'_>>::show_file -> anyhow::Result<()> with Ok(())

*** mutation diff:
--- espanso/src/gui/modulo/textview.rs
+++ replace <impl TextUI for ModuloTextUI<'_>>::show_file -> anyhow::Result<()> with Ok(())
@@ -35,15 +35,11 @@
     fn show_text(&self, title: &str, text: &str) -> anyhow::Result<()> {
         self.manager
             .spawn(&["textview", "--title", title, "-i", "-"], text)?;
 
         Ok(())
     }
 
     fn show_file(&self, title: &str, path: &std::path::Path) -> anyhow::Result<()> {
-        let path_str = path.to_string_lossy().to_string();
-        self.manager
-            .spawn(&["textview", "--title", title, "-i", &path_str], "")?;
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
