*** espanso/src/icon.rs:70:5: replace load_icon_paths -> Result<IconPaths> with Ok(Default::default())

*** mutation diff:
--- espanso/src/icon.rs
+++ replace load_icon_paths -> Result<IconPaths> with Ok(Default::default())
@@ -62,45 +62,17 @@
     pub tray_explain_image: Option<PathBuf>,
 
     pub logo: Option<PathBuf>,
     pub logo_no_background: Option<PathBuf>,
 }
 
 #[cfg(target_os = "windows")]
 pub fn load_icon_paths(runtime_dir: &Path) -> Result<IconPaths> {
-    Ok(IconPaths {
-        form_icon: Some(extract_icon(
-            WINDOWS_LOGO_ICO_BINARY,
-            &runtime_dir.join("formv2.ico"),
-        )?),
-        search_icon: Some(extract_icon(ICON_BINARY, &runtime_dir.join("search.png"))?),
-        wizard_icon: Some(extract_icon(
-            WINDOWS_LOGO_ICO_BINARY,
-            &runtime_dir.join("wizardv2.ico"),
-        )?),
-        tray_icon_normal: Some(extract_icon(
-            WINDOWS_NORMAL_DARK_ICO_BINARY,
-            &runtime_dir.join("normalv2.ico"),
-        )?),
-        tray_icon_disabled: Some(extract_icon(
-            WINDOWS_DISABLED_DARK_ICO_BINARY,
-            &runtime_dir.join("disabledv2.ico"),
-        )?),
-        logo: Some(extract_icon(ICON_BINARY, &runtime_dir.join("iconv2.png"))?),
-        logo_no_background: Some(extract_icon(
-            LOGO_NO_BACKGROUND_BINARY,
-            &runtime_dir.join("icon_no_backgroundv2.png"),
-        )?),
-        tray_explain_image: Some(extract_icon(
-            WINDOWS_TRAY_EXPLAIN_IMAGE,
-            &runtime_dir.join("tray_explain_image.png"),
-        )?),
-        ..Default::default()
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(target_os = "macos")]
 pub fn load_icon_paths(runtime_dir: &Path) -> Result<IconPaths> {
     Ok(IconPaths {
         search_icon: Some(extract_icon(
             ICON_BINARY,
             &runtime_dir.join("searchv2.png"),

*** result: Success
