*** espanso/src/lock.rs:65:5: replace acquire_daemon_lock -> Option<Lock> with None

*** mutation diff:
--- espanso/src/lock.rs
+++ replace acquire_daemon_lock -> Option<Lock> with None
@@ -57,14 +57,14 @@
 impl Drop for Lock {
     fn drop(&mut self) {
         fs2::FileExt::unlock(&self.lock_file)
             .unwrap_or_else(|_| panic!("unable to unlock lock_file: {:?}", self.lock_file));
     }
 }
 
 pub fn acquire_daemon_lock(runtime_dir: &Path) -> Option<Lock> {
-    Lock::acquire(runtime_dir, "espanso-daemon")
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn acquire_worker_lock(runtime_dir: &Path) -> Option<Lock> {
     Lock::acquire(runtime_dir, "espanso-worker")
 }

*** result: Success
