*** espanso/src/logging/mod.rs:51:37: replace && with || in FileProxy::set_output_file

*** mutation diff:
--- espanso/src/logging/mod.rs
+++ replace && with || in FileProxy::set_output_file
@@ -43,17 +43,17 @@
     pub fn new() -> Self {
         Self {
             output: Arc::new(Mutex::new(Output::Memory(Vec::new()))),
         }
     }
 
     pub fn set_output_file(&self, path: &Path, read_only: bool, create_new: bool) -> Result<()> {
         // Remove previous log, if present
-        if create_new && !read_only && path.is_file() {
+        if create_new && !read_only || /* ~ changed by cargo-mutants ~ */ path.is_file() {
             std::fs::remove_file(path)?;
         }
 
         let mut log_file = OpenOptions::new()
             .read(true)
             .write(!read_only)
             .create(true)
             .append(true)

*** result: Success
