*** espanso/src/logging/mod.rs:75:9: replace <impl Write for FileProxy>::write -> std::io::Result<usize> with Ok(1)

*** mutation diff:
--- espanso/src/logging/mod.rs
+++ replace <impl Write for FileProxy>::write -> std::io::Result<usize> with Ok(1)
@@ -67,29 +67,17 @@
         }
         *lock = Output::File(log_file);
         Ok(())
     }
 }
 
 impl Write for FileProxy {
     fn write(&mut self, buf: &[u8]) -> std::io::Result<usize> {
-        match self.output.lock() {
-            Ok(mut lock) => {
-                match &mut (*lock) {
-                    // Write to the memory buffer until a file is ready
-                    Output::Memory(buffer) => buffer.write(buf),
-                    Output::File(output) => output.write(buf),
-                }
-            }
-            Err(_) => Err(std::io::Error::new(
-                std::io::ErrorKind::Other,
-                "lock poison error",
-            )),
-        }
+        Ok(1) /* ~ changed by cargo-mutants ~ */
     }
 
     fn flush(&mut self) -> std::io::Result<()> {
         match self.output.lock() {
             Ok(mut lock) => match &mut (*lock) {
                 Output::Memory(buffer) => buffer.flush(),
                 Output::File(output) => output.flush(),
             },

*** result: Success
