*** espanso/src/logging/mod.rs:91:9: replace <impl Write for FileProxy>::flush -> std::io::Result<()> with Ok(())

*** mutation diff:
--- espanso/src/logging/mod.rs
+++ replace <impl Write for FileProxy>::flush -> std::io::Result<()> with Ok(())
@@ -83,26 +83,17 @@
             Err(_) => Err(std::io::Error::new(
                 std::io::ErrorKind::Other,
                 "lock poison error",
             )),
         }
     }
 
     fn flush(&mut self) -> std::io::Result<()> {
-        match self.output.lock() {
-            Ok(mut lock) => match &mut (*lock) {
-                Output::Memory(buffer) => buffer.flush(),
-                Output::File(output) => output.flush(),
-            },
-            Err(_) => Err(std::io::Error::new(
-                std::io::ErrorKind::Other,
-                "lock poison error",
-            )),
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[macro_export]
 macro_rules! info_println {
   ($($tts:tt)*) => {
     println!($($tts)*);
     log::info!($($tts)*);

*** result: Success
