*** espanso/src/main.rs:512:24: replace == with != in main

*** mutation diff:
--- espanso/src/main.rs
+++ replace == with != in main
@@ -504,17 +504,17 @@
             .iter()
             .find(|cli| matches.subcommand_matches(&cli.subcommand).is_some())
     };
 
     if handler.is_none() {
         // When started from the macOS App Bundle, override the default
         // handler with "launcher" if not present, otherwise the GUI could not be started.
         if let Some(context) = std::env::var_os("MAC_LAUNCH_CONTEXT") {
-            if context == "bundle" {
+            if context != /* ~ changed by cargo-mutants ~ */ "bundle" {
                 handler = CLI_HANDLERS.iter().find(|cli| cli.subcommand == "launcher");
             }
         }
 
         // When started from a Linux app image, override the default handler with the launcher
         // to start espanso when launching it directly
         if std::env::var_os("APPIMAGE").is_some() {
             handler = CLI_HANDLERS.iter().find(|cli| cli.subcommand == "launcher");

*** result: Success
