*** espanso/src/main.rs:571:35: replace || with && in main

*** mutation diff:
--- espanso/src/main.rs
+++ replace || with && in main
@@ -563,17 +563,17 @@
         // dock icons due to the multi-process nature of espanso.
         #[cfg(target_os = "macos")]
         if handler.show_in_dock {
             espanso_mac_utils::convert_to_foreground_app();
         }
 
         let mut cli_args: CliModuleArgs = CliModuleArgs::default();
 
-        if handler.requires_paths || handler.requires_config {
+        if handler.requires_paths && /* ~ changed by cargo-mutants ~ */ handler.requires_config {
             let force_config_path = get_path_override(&matches, "config_dir", "ESPANSO_CONFIG_DIR");
             let force_package_path =
                 get_path_override(&matches, "package_dir", "ESPANSO_PACKAGE_DIR");
             let force_runtime_path =
                 get_path_override(&matches, "runtime_dir", "ESPANSO_RUNTIME_DIR");
 
             let paths = crate::path::resolve_paths(
                 force_config_path.as_deref(),

*** result: Success
