*** espanso/src/patch/config_store.rs:72:12: delete ! in <impl ConfigStore for PatchedConfigStore>::active

*** mutation diff:
--- espanso/src/patch/config_store.rs
+++ delete ! in <impl ConfigStore for PatchedConfigStore>::active
@@ -64,17 +64,17 @@
 impl ConfigStore for PatchedConfigStore {
     fn default(&self) -> Arc<dyn Config> {
         self.config_store.default()
     }
 
     fn active(&self, app: &espanso_config::config::AppProperties) -> Arc<dyn Config> {
         let active_config = self.config_store.active(app);
 
-        if !active_config.apply_patch() {
+        if  /* ~ changed by cargo-mutants ~ */active_config.apply_patch() {
             return active_config;
         }
 
         // Check if a patch should be applied
         if let Some(patch) = self.patches.iter().find(|patch| (patch.should_patch)(app)) {
             (patch.apply)(active_config, patch.name)
         } else {
             active_config

*** result: Success
