*** espanso/src/patch/patches/linux/urxvt_terminal_x11.rs:26:5: replace patch -> PatchDefinition with Default::default()

*** mutation diff:
--- espanso/src/patch/patches/linux/urxvt_terminal_x11.rs
+++ replace patch -> PatchDefinition with Default::default()
@@ -18,24 +18,10 @@
  */
 
 use std::sync::Arc;
 
 use crate::patch::patches::{PatchedConfig, Patches};
 use crate::patch::PatchDefinition;
 
 pub fn patch() -> PatchDefinition {
-    PatchDefinition {
-        name: module_path!().split(':').next_back().unwrap_or("unknown"),
-        is_enabled: || cfg!(target_os = "linux") && !super::util::is_wayland(),
-        should_patch: |app| app.class.unwrap_or_default().contains("URxvt"),
-        apply: |base, name| {
-            Arc::new(PatchedConfig::patch(
-                base,
-                name,
-                Patches {
-                    paste_shortcut: Some(Some("CTRL+ALT+V".to_string())),
-                    ..Default::default()
-                },
-            ))
-        },
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
