*** espanso/src/patch/patches/win/brave.rs:26:5: replace patch -> PatchDefinition with Default::default()

*** mutation diff:
--- espanso/src/patch/patches/win/brave.rs
+++ replace patch -> PatchDefinition with Default::default()
@@ -18,24 +18,10 @@
  */
 
 use std::sync::Arc;
 
 use crate::patch::patches::{PatchedConfig, Patches};
 use crate::patch::PatchDefinition;
 
 pub fn patch() -> PatchDefinition {
-    PatchDefinition {
-        name: module_path!().split(':').next_back().unwrap_or("unknown"),
-        is_enabled: || cfg!(target_os = "windows"),
-        should_patch: |app| app.exec.unwrap_or_default().contains("brave.exe"),
-        apply: |base, name| {
-            Arc::new(PatchedConfig::patch(
-                base,
-                name,
-                Patches {
-                    pre_paste_delay: Some(400),
-                    ..Default::default()
-                },
-            ))
-        },
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
