*** espanso/src/patch/patches/win/vscode_win.rs:28:5: replace patch -> PatchDefinition with Default::default()

*** mutation diff:
--- espanso/src/patch/patches/win/vscode_win.rs
+++ replace patch -> PatchDefinition with Default::default()
@@ -20,25 +20,10 @@
 use std::sync::Arc;
 
 use espanso_config::config::Backend;
 
 use crate::patch::patches::{PatchedConfig, Patches};
 use crate::patch::PatchDefinition;
 
 pub fn patch() -> PatchDefinition {
-    PatchDefinition {
-        name: module_path!().split(':').next_back().unwrap_or("unknown"),
-        is_enabled: || cfg!(target_os = "windows"),
-        should_patch: |app| app.exec.unwrap_or_default().contains("Code.exe"),
-        apply: |base, name| {
-            Arc::new(PatchedConfig::patch(
-                base,
-                name,
-                Patches {
-                    key_delay: Some(Some(10)),
-                    backend: Some(Backend::Clipboard),
-                    ..Default::default()
-                },
-            ))
-        },
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
