*** espanso/src/path/linux.rs:74:5: replace get_binary_path -> Result<PathBuf> with Ok(Default::default())

*** mutation diff:
--- espanso/src/path/linux.rs
+++ replace get_binary_path -> Result<PathBuf> with Ok(Default::default())
@@ -66,14 +66,10 @@
 
     #[error("symlink does not exist, so there is nothing to remove.")]
     SymlinkNotFound,
 }
 
 fn get_binary_path() -> Result<PathBuf> {
     // If executed as part of an AppImage, get the app image path instead of
     // the binary itself (which was extracted in a temp directory).
-    if let Some(app_image_path) = std::env::var_os("APPIMAGE") {
-        return Ok(PathBuf::from(app_image_path));
-    }
-
-    Ok(std::env::current_exe()?)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }

*** result: Success
