*** espanso/src/path/macos.rs:127:24: delete ! in remove_espanso_from_path

*** mutation diff:
--- espanso/src/path/macos.rs
+++ delete ! in remove_espanso_from_path
@@ -119,17 +119,17 @@
                         target_link_path.to_string_lossy(),
                     );
 
                     let mut child = std::process::Command::new("osascript")
                         .args(["-e", &params])
                         .spawn()?;
 
                     let result = child.wait()?;
-                    if !result.success() {
+                    if  /* ~ changed by cargo-mutants ~ */result.success() {
                         return Err(PathError::ElevationRequestFailure.into());
                     }
                 } else {
                     return Err(PathError::SymlinkError(error).into());
                 }
             }
             _other_error => {
                 return Err(PathError::SymlinkError(error).into());

*** result: Success
