*** espanso/src/path/macos.rs:50:48: replace match guard with false

*** mutation diff:
--- espanso/src/path/macos.rs
+++ replace match guard with false
@@ -42,17 +42,17 @@
 
     let target_link_path = target_link_dir.join("espanso");
 
     if !target_link_dir.is_dir() {
         warn!("/usr/local/bin folder does not exist, attempting to create one...");
 
         if let Err(error) = create_dir_all(&target_link_dir) {
             match error.kind() {
-                ErrorKind::PermissionDenied if prompt_when_necessary => {
+                ErrorKind::PermissionDenied if false /* ~ changed by cargo-mutants ~ */ => {
                     warn!("target link file can't be accessed with current permissions, requesting elevated ones through AppleScript.");
 
                     create_dir_and_link_with_applescript(&exec_path, &target_link_path)
                         .context("unable to create link with AppleScript")?;
 
                     return Ok(());
                 }
                 _other_error => {

*** result: Success
