*** espanso/src/path/mod.rs:147:5: replace get_portable_config_dir -> Option<PathBuf> with None

*** mutation diff:
--- espanso/src/path/mod.rs
+++ replace get_portable_config_dir -> Option<PathBuf> with None
@@ -139,25 +139,17 @@
         debug!("detected default config directory at {:?}", config_dir);
         Some(config_dir)
     } else {
         None
     }
 }
 
 fn get_portable_config_dir() -> Option<PathBuf> {
-    let espanso_exe_path = std::env::current_exe().expect("unable to obtain executable path");
-    let exe_dir = espanso_exe_path.parent();
-    if let Some(parent) = exe_dir {
-        let config_dir = parent.join(".espanso");
-        if config_dir.is_dir() {
-            return Some(config_dir);
-        }
-    }
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_home_espanso_dir() -> Option<PathBuf> {
     if let Some(home_dir) = dirs::home_dir() {
         let config_espanso_dir = home_dir.join(".espanso");
         if config_espanso_dir.is_dir() {
             return Some(config_espanso_dir);
         }

*** result: Success
