*** espanso/src/path/mod.rs:159:5: replace get_home_espanso_dir -> Option<PathBuf> with Some(Default::default())

*** mutation diff:
--- espanso/src/path/mod.rs
+++ replace get_home_espanso_dir -> Option<PathBuf> with Some(Default::default())
@@ -151,23 +151,17 @@
         if config_dir.is_dir() {
             return Some(config_dir);
         }
     }
     None
 }
 
 fn get_home_espanso_dir() -> Option<PathBuf> {
-    if let Some(home_dir) = dirs::home_dir() {
-        let config_espanso_dir = home_dir.join(".espanso");
-        if config_espanso_dir.is_dir() {
-            return Some(config_espanso_dir);
-        }
-    }
-    None
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_home_config_espanso_dir() -> Option<PathBuf> {
     if let Some(home_dir) = dirs::home_dir() {
         let home_espanso_dir = home_dir.join(".config").join("espanso");
         if home_espanso_dir.is_dir() {
             return Some(home_espanso_dir);
         }

*** result: Success
