*** espanso/src/path/mod.rs:242:5: replace get_legacy_runtime_dir -> Option<PathBuf> with None

*** mutation diff:
--- espanso/src/path/mod.rs
+++ replace get_legacy_runtime_dir -> Option<PathBuf> with None
@@ -234,23 +234,17 @@
     if let Some(parent) = exe_dir {
         let config_dir = parent.join(".espanso-runtime");
         return Some(config_dir);
     }
     None
 }
 
 fn get_legacy_runtime_dir() -> Option<PathBuf> {
-    let data_dir = dirs::data_local_dir().expect("unable to obtain dirs::data_local_dir()");
-    let espanso_dir = data_dir.join("espanso");
-    if is_legacy_runtime_dir(&espanso_dir) {
-        Some(espanso_dir)
-    } else {
-        None
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_default_runtime_dir() -> Option<PathBuf> {
     let default_dir = get_default_runtime_path();
     if default_dir.is_dir() {
         Some(default_dir)
     } else {
         None

*** result: Success
