*** espanso/src/path/mod.rs:266:5: replace get_packages_dir -> Option<PathBuf> with Some(Default::default())

*** mutation diff:
--- espanso/src/path/mod.rs
+++ replace get_packages_dir -> Option<PathBuf> with Some(Default::default())
@@ -258,28 +258,17 @@
 }
 
 fn get_default_runtime_path() -> PathBuf {
     let runtime_dir = dirs::cache_dir().expect("unable to obtain dirs::cache_dir()");
     runtime_dir.join("espanso")
 }
 
 fn get_packages_dir(config_dir: &Path, legacy_data_dir: &Path) -> Option<PathBuf> {
-    if let Some(packages_dir) = get_default_packages_dir(config_dir) {
-        debug!("detected default packages dir: {:?}", packages_dir);
-        Some(packages_dir)
-    } else if let Some(packages_dir) = get_legacy_embedded_packages_dir(config_dir) {
-        debug!("detected legacy packages dir: {:?}", packages_dir);
-        Some(packages_dir)
-    } else if let Some(packages_dir) = get_legacy_packages_dir(legacy_data_dir) {
-        debug!("detected legacy packages dir: {:?}", packages_dir);
-        Some(packages_dir)
-    } else {
-        None
-    }
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_legacy_packages_dir(legacy_data_dir: &Path) -> Option<PathBuf> {
     let legacy_dir = legacy_data_dir.join("packages");
     if legacy_dir.is_dir() {
         Some(legacy_dir)
     } else {
         None

*** result: Success
