*** espanso/src/path/mod.rs:281:5: replace get_legacy_packages_dir -> Option<PathBuf> with Some(Default::default())

*** mutation diff:
--- espanso/src/path/mod.rs
+++ replace get_legacy_packages_dir -> Option<PathBuf> with Some(Default::default())
@@ -273,22 +273,17 @@
         debug!("detected legacy packages dir: {:?}", packages_dir);
         Some(packages_dir)
     } else {
         None
     }
 }
 
 fn get_legacy_packages_dir(legacy_data_dir: &Path) -> Option<PathBuf> {
-    let legacy_dir = legacy_data_dir.join("packages");
-    if legacy_dir.is_dir() {
-        Some(legacy_dir)
-    } else {
-        None
-    }
+    Some(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn get_legacy_embedded_packages_dir(config_dir: &Path) -> Option<PathBuf> {
     let legacy_dir = config_dir.join("packages");
     if legacy_dir.is_dir() {
         Some(legacy_dir)
     } else {
         None

*** result: Success
