*** espanso/src/path/mod.rs:312:5: replace is_portable_mode -> bool with true

*** mutation diff:
--- espanso/src/path/mod.rs
+++ replace is_portable_mode -> bool with true
@@ -304,25 +304,17 @@
     }
 }
 
 fn get_default_packages_path(config_dir: &Path) -> PathBuf {
     config_dir.join("match").join("packages")
 }
 
 fn is_portable_mode() -> bool {
-    let espanso_exe_path = std::env::current_exe().expect("unable to obtain executable path");
-    let exe_dir = espanso_exe_path.parent();
-    if let Some(parent) = exe_dir {
-        let config_dir = parent.join(".espanso");
-        if config_dir.is_dir() {
-            return true;
-        }
-    }
-    false
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 const LEGACY_RUNTIME_DIR_CANDIDATES_FILE: &[&str] = &[
     "espanso.log",
     "espanso.lock",
     "espanso-worker.lock",
     "espanso-daemon.lock",
 ];

*** result: Success
