*** espanso/src/path/mod.rs:336:8: delete ! in is_legacy_runtime_dir

*** mutation diff:
--- espanso/src/path/mod.rs
+++ delete ! in is_legacy_runtime_dir
@@ -328,17 +328,17 @@
 ];
 
 // Run an heuristic to determine if the given directory
 // is a legacy runtime dir or not.
 // Unfortunately, due to the way the legacy path works
 // we really have to analyse the content to determine this
 // information
 fn is_legacy_runtime_dir(path: &Path) -> bool {
-    if !path.is_dir() {
+    if  /* ~ changed by cargo-mutants ~ */path.is_dir() {
         return false;
     }
 
     for candidate in LEGACY_RUNTIME_DIR_CANDIDATES_FILE {
         let candidate_path = path.join(candidate);
         if candidate_path.is_file() {
             return true;
         }

*** result: Success
