*** espanso/src/path/win.rs:33:5: replace add_espanso_to_path -> Result<()> with Ok(())

*** mutation diff:
--- espanso/src/path/win.rs
+++ replace add_espanso_to_path -> Result<()> with Ok(())
@@ -25,30 +25,17 @@
 use winreg::enums::*;
 use winreg::RegKey;
 
 pub fn is_espanso_in_path() -> bool {
     read_paths().iter().any(|path| path.contains("espanso"))
 }
 
 pub fn add_espanso_to_path(_: bool) -> Result<()> {
-    let mut paths = read_paths();
-    let exe_path = std::env::current_exe().expect("unable to obtain exec path");
-    let parent_path = exe_path.parent().expect("unable to obtain parent path");
-
-    // Add espanso to path list
-    paths.push(parent_path.to_string_lossy().to_string());
-
-    let path = paths.join(";");
-    write_user_path_value(path)?;
-
-    // Send broadcast to let other applications know that the env variables have changed
-    send_change_broadcast();
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn remove_espanso_from_path(_: bool) -> Result<()> {
     let paths = read_paths();
     let paths_without_espanso: Vec<String> = paths
         .into_iter()
         .filter(|path| !path.contains("espanso"))
         .collect();

*** result: Success
