*** espanso/src/preferences/default.rs:58:9: replace <impl Preferences for DefaultPreferences<KVSType>>::has_completed_wizard -> bool with false

*** mutation diff:
--- espanso/src/preferences/default.rs
+++ replace <impl Preferences for DefaultPreferences<KVSType>>::has_completed_wizard -> bool with false
@@ -50,17 +50,17 @@
         self.kvs
             .set(key, value)
             .unwrap_or_else(|_| panic!("unable to write preference for key {key}"));
     }
 }
 
 impl<KVSType: KVS> Preferences for DefaultPreferences<KVSType> {
     fn has_completed_wizard(&self) -> bool {
-        self.get(HAS_COMPLETED_WIZARD_KEY).unwrap_or(false)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn set_completed_wizard(&self, value: bool) {
         self.set(HAS_COMPLETED_WIZARD_KEY, value);
     }
 
     fn has_displayed_welcome(&self) -> bool {
         self.get(HAS_DISPLAYED_WELCOME_KEY).unwrap_or(false)

*** result: Success
