*** espanso/src/preferences/default.rs:62:9: replace <impl Preferences for DefaultPreferences<KVSType>>::set_completed_wizard with ()

*** mutation diff:
--- espanso/src/preferences/default.rs
+++ replace <impl Preferences for DefaultPreferences<KVSType>>::set_completed_wizard with ()
@@ -54,17 +54,17 @@
 }
 
 impl<KVSType: KVS> Preferences for DefaultPreferences<KVSType> {
     fn has_completed_wizard(&self) -> bool {
         self.get(HAS_COMPLETED_WIZARD_KEY).unwrap_or(false)
     }
 
     fn set_completed_wizard(&self, value: bool) {
-        self.set(HAS_COMPLETED_WIZARD_KEY, value);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn has_displayed_welcome(&self) -> bool {
         self.get(HAS_DISPLAYED_WELCOME_KEY).unwrap_or(false)
     }
 
     fn set_has_displayed_welcome(&self, value: bool) {
         self.set(HAS_DISPLAYED_WELCOME_KEY, value);

*** result: Success
