*** espanso/src/preferences/default.rs:66:9: replace <impl Preferences for DefaultPreferences<KVSType>>::has_displayed_welcome -> bool with false

*** mutation diff:
--- espanso/src/preferences/default.rs
+++ replace <impl Preferences for DefaultPreferences<KVSType>>::has_displayed_welcome -> bool with false
@@ -58,17 +58,17 @@
         self.get(HAS_COMPLETED_WIZARD_KEY).unwrap_or(false)
     }
 
     fn set_completed_wizard(&self, value: bool) {
         self.set(HAS_COMPLETED_WIZARD_KEY, value);
     }
 
     fn has_displayed_welcome(&self) -> bool {
-        self.get(HAS_DISPLAYED_WELCOME_KEY).unwrap_or(false)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn set_has_displayed_welcome(&self, value: bool) {
         self.set(HAS_DISPLAYED_WELCOME_KEY, value);
     }
 
     fn should_display_troubleshoot_for_non_fatal_errors(&self) -> bool {
         self.get(SHOULD_DISPLAY_TROUBLESHOOT_FOR_NON_FATAL_ERRORS)

*** result: Success
