*** espanso/src/preferences/default.rs:70:9: replace <impl Preferences for DefaultPreferences<KVSType>>::set_has_displayed_welcome with ()

*** mutation diff:
--- espanso/src/preferences/default.rs
+++ replace <impl Preferences for DefaultPreferences<KVSType>>::set_has_displayed_welcome with ()
@@ -62,17 +62,17 @@
         self.set(HAS_COMPLETED_WIZARD_KEY, value);
     }
 
     fn has_displayed_welcome(&self) -> bool {
         self.get(HAS_DISPLAYED_WELCOME_KEY).unwrap_or(false)
     }
 
     fn set_has_displayed_welcome(&self, value: bool) {
-        self.set(HAS_DISPLAYED_WELCOME_KEY, value);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn should_display_troubleshoot_for_non_fatal_errors(&self) -> bool {
         self.get(SHOULD_DISPLAY_TROUBLESHOOT_FOR_NON_FATAL_ERRORS)
             .unwrap_or(true)
     }
 
     fn set_should_display_troubleshoot_for_non_fatal_errors(&self, value: bool) {

*** result: Success
