*** espanso/src/preferences/default.rs:74:9: replace <impl Preferences for DefaultPreferences<KVSType>>::should_display_troubleshoot_for_non_fatal_errors -> bool with false

*** mutation diff:
--- espanso/src/preferences/default.rs
+++ replace <impl Preferences for DefaultPreferences<KVSType>>::should_display_troubleshoot_for_non_fatal_errors -> bool with false
@@ -66,18 +66,17 @@
         self.get(HAS_DISPLAYED_WELCOME_KEY).unwrap_or(false)
     }
 
     fn set_has_displayed_welcome(&self, value: bool) {
         self.set(HAS_DISPLAYED_WELCOME_KEY, value);
     }
 
     fn should_display_troubleshoot_for_non_fatal_errors(&self) -> bool {
-        self.get(SHOULD_DISPLAY_TROUBLESHOOT_FOR_NON_FATAL_ERRORS)
-            .unwrap_or(true)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn set_should_display_troubleshoot_for_non_fatal_errors(&self, value: bool) {
         self.set(SHOULD_DISPLAY_TROUBLESHOOT_FOR_NON_FATAL_ERRORS, value);
     }
 
     fn has_selected_auto_start_option(&self) -> bool {
         self.get(HAS_SELECTED_AUTO_START_OPTION).unwrap_or(false)

*** result: Success
