*** espanso/src/preferences/default.rs:87:9: replace <impl Preferences for DefaultPreferences<KVSType>>::set_has_selected_auto_start_option with ()

*** mutation diff:
--- espanso/src/preferences/default.rs
+++ replace <impl Preferences for DefaultPreferences<KVSType>>::set_has_selected_auto_start_option with ()
@@ -79,11 +79,11 @@
         self.set(SHOULD_DISPLAY_TROUBLESHOOT_FOR_NON_FATAL_ERRORS, value);
     }
 
     fn has_selected_auto_start_option(&self) -> bool {
         self.get(HAS_SELECTED_AUTO_START_OPTION).unwrap_or(false)
     }
 
     fn set_has_selected_auto_start_option(&self, value: bool) {
-        self.set(HAS_SELECTED_AUTO_START_OPTION, value);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
