*** espanso/src/util.rs:30:5: replace set_command_flags with ()

*** mutation diff:
--- espanso/src/util.rs
+++ replace set_command_flags with ()
@@ -22,20 +22,17 @@
 use std::process::Command;
 use sysinfo::{System, SystemExt};
 
 #[cfg(target_os = "windows")]
 pub fn set_command_flags(command: &mut Command) {
     // Avoid showing the shell window
     // See: https://github.com/espanso/espanso/issues/249
     // and https://learn.microsoft.com/en-us/windows/win32/procthread/process-creation-flags
-    use std::os::windows::process::CommandExt;
-
-    const CREATE_NO_WINDOW: u32 = 0x0800_0000;
-    command.creation_flags(CREATE_NO_WINDOW);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(target_os = "windows"))]
 pub fn set_command_flags(_: &mut Command) {
     // NOOP on Linux and macOS
 }
 
 #[cfg(target_os = "windows")]

*** result: Success
